Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xE.h
#include "core_cm4.h"             /* Cortex-M4 processor and core peripherals */
#include "system_py32e4xx.h"
#include <stdint.h>

/**
* @brief ADC Registers
  */
typedef struct
{
   __IO uint32_t ISR;              /*!< ADC ISR Register,                   Address offset: 0x00  */
   __IO uint32_t IER;              /*!< ADC IER Register,                   Address offset: 0x04  */
   __IO uint32_t CR;               /*!< ADC CR Register,                    Address offset: 0x08  */
   __IO uint32_t CFGR;             /*!< ADC CFGR Register,                  Address offset: 0x0C  */
   __IO uint32_t CFGR2;            /*!< ADC CFGR2 Register,                 Address offset: 0x10  */
   __IO uint32_t SMPR1;            /*!< ADC SMPR1 Register,                 Address offset: 0x14  */
   __IO uint32_t SMPR2;            /*!< ADC SMPR2 Register,                 Address offset: 0x18  */
   __IO uint32_t RESERVED1;         
   __IO uint32_t TR1;              /*!< ADC TR1 Register,                   Address offset: 0x20  */
   __IO uint32_t TR2;              /*!< ADC TR2 Register,                   Address offset: 0x24  */
   __IO uint32_t TR3;              /*!< ADC TR3 Register,                   Address offset: 0x28  */
   __IO uint32_t RESERVED2;         
   __IO uint32_t SQR1;             /*!< ADC SQR1 Register,                  Address offset: 0x30  */
   __IO uint32_t SQR2;             /*!< ADC SQR2 Register,                  Address offset: 0x34  */
   __IO uint32_t SQR3;             /*!< ADC SQR3 Register,                  Address offset: 0x38  */
   __IO uint32_t SQR4;             /*!< ADC SQR4 Register,                  Address offset: 0x3C  */
   __IO uint32_t DR;               /*!< ADC DR Register,                    Address offset: 0x40  */
   __IO uint32_t RESERVED3[2];      
   __IO uint32_t JSQR;             /*!< ADC JSQR Register,                  Address offset: 0x4C  */
   __IO uint32_t RESERVED4[4];      
   __IO uint32_t OFR1;             /*!< ADC OFR1 Register,                  Address offset: 0x60  */
   __IO uint32_t OFR2;             /*!< ADC OFR2 Register,                  Address offset: 0x64  */
   __IO uint32_t OFR3;             /*!< ADC OFR3 Register,                  Address offset: 0x68  */
   __IO uint32_t OFR4;             /*!< ADC OFR4 Register,                  Address offset: 0x6C  */
   __IO uint32_t RESERVED5[4];      
   __IO uint32_t JDR1;             /*!< ADC JDR1 Register,                  Address offset: 0x80  */
   __IO uint32_t JDR2;             /*!< ADC JDR2 Register,                  Address offset: 0x84  */
   __IO uint32_t JDR3;             /*!< ADC JDR3 Register,                  Address offset: 0x88  */
   __IO uint32_t JDR4;             /*!< ADC JDR4 Register,                  Address offset: 0x8C  */
   __IO uint32_t RESERVED6[4];      
   __IO uint32_t AWD2CR;           /*!< ADC AWD2CR Register,                Address offset: 0xA0  */
   __IO uint32_t AWD3CR;           /*!< ADC AWD3CR Register,                Address offset: 0xA4  */
   __IO uint32_t RESERVED7[2];      
   __IO uint32_t DIFSEL;           /*!< ADC DIFSEL Register,                Address offset: 0xB0  */
   __IO uint32_t CALFACT;          /*!< ADC CALFACT Register,               Address offset: 0xB4  */
   __IO uint32_t RESERVED8[2];      
   __IO uint32_t GCOMP;            /*!< ADC GCOMP Register,                 Address offset: 0xC0  */
} ADC_TypeDef;

typedef struct
{
  __IO uint32_t CCR;          /*!< ADC common configuration register,     Address offset: 0x300 + 0x08 */
} ADC_Common_TypeDef;

/**
* @brief AES Registers
*/
typedef struct
{
   __IO uint32_t MSG_CFG;          /*!< AES MSG_CFG Register,               Address offset: 0x00  */
   __IO uint32_t CTX_CFG;          /*!< AES CTX_CFG Register,               Address offset: 0x4  */
   __IO uint32_t MSG_TOTAL_BYTES;  /*!< AES MSG_TOTAL_BYTES Register,       Address offset: 0x8  */
   __IO uint32_t MSG_AAD_BYTES;    /*!< AES MSG_AAD_BYTES Register,         Address offset: 0xC  */
   __IO uint32_t GCM_AAD_INFO;     /*!< AES GCM_AAD_INFO Register,          Address offset: 0x10  */
   __IO uint32_t RESERVED1[3];      
   __IO uint32_t CTX_KEY[8];       /*!< AES CTX_KEY Register,               Address offset: 0x20  */
   __IO uint32_t CTX_CBC_KEY[4];   /*!< AES CTX_CBC_KEY Register,           Address offset: 0x40  */
   __IO uint32_t CTX_CTR[4];       /*!< AES CTX_CTR Register,               Address offset: 0x50  */
   __IO uint32_t CTX_IV[4];        /*!< AES CTX_IV Register,                Address offset: 0x60  */
   __IO uint32_t CTX_MAC[4];       /*!< AES CTX_MAC0 Register,              Address offset: 0x70  */
   __IO uint32_t INGRESS_FIFO;     /*!< AES INGRESS_FIFO Register,          Address offset: 0x80  */
   __IO uint32_t ING_DBCFG;        /*!< AES ING_DBCFG Register,             Address offset: 0x84  */
   __IO uint32_t DMA_ENG_LEN;      /*!< AES DMA_ENG_LEN Register,           Address offset: 0x88  */
   __IO uint32_t ENG_DBCFG;        /*!< AES ENG_DBCFG Register,             Address offset: 0x8C  */
   __IO uint32_t DMA_ING_LEN;      /*!< AES DMA_ING_LEN Register,           Address offset: 0x90  */
   __IO uint32_t INGF_STATUS;      /*!< AES INGF_STATUS Register,           Address offset: 0x94  */
   __IO uint32_t ENGRESS_FIFO;     /*!< AES ENGRESS_FIFO Register,          Address offset: 0x98  */
   __IO uint32_t ENGFIFO_STATUS;   /*!< AES ENGFIFO_STATUS Register,        Address offset: 0x9C  */
   __IO uint32_t ING_DMA_DONE;     /*!< AES ING_DMA_DONE Register,          Address offset: 0xA0  */
   __IO uint32_t ENG_DMA_DONE;     /*!< AES ENG_DMA_DONE Register,          Address offset: 0xA4  */
   __IO uint32_t DONE_STATUS;      /*!< AES DONE_STATUS Register,           Address offset: 0xA8  */
} AES_TypeDef;

/**
* @brief BKP Registers
*/
typedef struct
{
   __IO uint32_t CR;               /*!< BKP CR Register,                    Address offset: 0x0  */
   __IO uint32_t CSR;              /*!< BKP CSR Register,                   Address offset: 0x4  */
   __IO uint32_t RTCCR;            /*!< BKP RTCCR Register,                 Address offset: 0x8  */
   __IO uint32_t RESERVED1[29];     
   __IO uint32_t DR0;              /*!< BKP DR0 Register,                   Address offset: 0x80  */
   __IO uint32_t DR1;              /*!< BKP DR1 Register,                   Address offset: 0x84  */
   __IO uint32_t DR2;              /*!< BKP DR2 Register,                   Address offset: 0x88  */
   __IO uint32_t DR3;              /*!< BKP DR3 Register,                   Address offset: 0x8C  */
   __IO uint32_t DR4;              /*!< BKP DR4 Register,                   Address offset: 0x90  */
   __IO uint32_t DR5;              /*!< BKP DR5 Register,                   Address offset: 0x94  */
   __IO uint32_t DR6;              /*!< BKP DR6 Register,                   Address offset: 0x98  */
   __IO uint32_t DR7;              /*!< BKP DR7 Register,                   Address offset: 0x9C  */
   __IO uint32_t DR8;              /*!< BKP DR8 Register,                   Address offset: 0xA0  */
   __IO uint32_t DR9;              /*!< BKP DR9 Register,                   Address offset: 0xA4  */
   __IO uint32_t DR10;             /*!< BKP DR10 Register,                  Address offset: 0xA8  */
   __IO uint32_t DR11;             /*!< BKP DR11 Register,                  Address offset: 0xAC  */
   __IO uint32_t DR12;             /*!< BKP DR12 Register,                  Address offset: 0xB0  */
   __IO uint32_t DR13;             /*!< BKP DR13 Register,                  Address offset: 0xB4  */
   __IO uint32_t DR14;             /*!< BKP DR14 Register,                  Address offset: 0xB8  */
   __IO uint32_t DR15;             /*!< BKP DR15 Register,                  Address offset: 0xBC  */
   __IO uint32_t DR16;             /*!< BKP DR16 Register,                  Address offset: 0xC0  */
   __IO uint32_t DR17;             /*!< BKP DR17 Register,                  Address offset: 0xC4  */
   __IO uint32_t DR18;             /*!< BKP DR18 Register,                  Address offset: 0xC8  */
   __IO uint32_t DR19;             /*!< BKP DR19 Register,                  Address offset: 0xCC  */
   __IO uint32_t DR20;             /*!< BKP DR20 Register,                  Address offset: 0xD0  */
   __IO uint32_t DR21;             /*!< BKP DR21 Register,                  Address offset: 0xD4  */
   __IO uint32_t DR22;             /*!< BKP DR22 Register,                  Address offset: 0xD8  */
   __IO uint32_t DR23;             /*!< BKP DR23 Register,                  Address offset: 0xDC  */
   __IO uint32_t DR24;             /*!< BKP DR24 Register,                  Address offset: 0xE0  */
   __IO uint32_t DR25;             /*!< BKP DR25 Register,                  Address offset: 0xE4  */
   __IO uint32_t DR26;             /*!< BKP DR26 Register,                  Address offset: 0xE8  */
   __IO uint32_t DR27;             /*!< BKP DR27 Register,                  Address offset: 0xEC  */
   __IO uint32_t DR28;             /*!< BKP DR28 Register,                  Address offset: 0xF0  */
   __IO uint32_t DR29;             /*!< BKP DR29 Register,                  Address offset: 0xF4  */
   __IO uint32_t DR30;             /*!< BKP DR30 Register,                  Address offset: 0xF8  */
   __IO uint32_t DR31;             /*!< BKP DR31 Register,                  Address offset: 0xFC  */
}BKP_TypeDef;

/**
* @brief FDCAN Registers
*/
typedef struct
{
   __IO uint32_t RESERVED1;          
   __IO uint32_t ENDN;             /*!< FDCAN ENDN Register,                Address offset: 0x04  */
   __IO uint32_t RESERVED2;         
   __IO uint32_t DBTP;             /*!< FDCAN DBTP Register,                Address offset: 0x0C  */
   __IO uint32_t TEST;             /*!< FDCAN TEST Register,                Address offset: 0x010  */
   __IO uint32_t RWD;              /*!< FDCAN RWD Register,                 Address offset: 0x14  */
   __IO uint32_t CCCR;             /*!< FDCAN CCCR Register,                Address offset: 0x18  */
   __IO uint32_t NBTP;             /*!< FDCAN NBTP Register,                Address offset: 0x1C  */
   __IO uint32_t TSCC;             /*!< FDCAN TSCC Register,                Address offset: 0x20  */
   __IO uint32_t TSCV;             /*!< FDCAN TSCV Register,                Address offset: 0x24  */
   __IO uint32_t TOCC;             /*!< FDCAN TOCC Register,                Address offset: 0x28  */
   __IO uint32_t TOCV;             /*!< FDCAN TOCV Register,                Address offset: 0x2C  */
   __IO uint32_t RESERVED3[4];      
   __IO uint32_t ECR;              /*!< FDCAN ECR Register,                 Address offset: 0x40  */
   __IO uint32_t PSR;              /*!< FDCAN PSR Register,                 Address offset: 0x44  */
   __IO uint32_t TDCR;             /*!< FDCAN TDCR Register,                Address offset: 0x48  */
   __IO uint32_t RESERVED4;         
   __IO uint32_t IR;               /*!< FDCAN IR Register,                  Address offset: 0x50  */
   __IO uint32_t IE;               /*!< FDCAN IE Register,                  Address offset: 0x54  */
   __IO uint32_t ILS;              /*!< FDCAN ILS Register,                 Address offset: 0x58  */
   __IO uint32_t ILE;              /*!< FDCAN ILE Register,                 Address offset: 0x5C  */
   __IO uint32_t RESERVED5[8];      
   __IO uint32_t GFC;              /*!< FDCAN GFC Register,                 Address offset: 0x80  */
   __IO uint32_t SIDFC;            /*!< FDCAN SIDFC Register,               Address offset: 0x84  */
   __IO uint32_t XIDFC;            /*!< FDCAN XIDFC Register,               Address offset: 0x88  */
   __IO uint32_t RESERVED6;         
   __IO uint32_t XIDAM;            /*!< FDCAN XIDAM Register,               Address offset: 0x90  */
   __IO uint32_t HPMS;             /*!< FDCAN HPMS Register,                Address offset: 0x94  */
   __IO uint32_t NDAT1;            /*!< FDCAN NDAT1 Register,               Address offset: 0x98  */
   __IO uint32_t NDAT2;            /*!< FDCAN NDAT2 Register,               Address offset: 0x9C  */
   __IO uint32_t RXF0C;            /*!< FDCAN RXF0C Register,               Address offset: 0xA0  */
   __IO uint32_t RXF0S;            /*!< FDCAN RXF0S Register,               Address offset: 0xA4  */
   __IO uint32_t RXF0A;            /*!< FDCAN RXF0A Register,               Address offset: 0xA8  */
   __IO uint32_t RXBC;             /*!< FDCAN RXBC Register,                Address offset: 0xAC  */
   __IO uint32_t RXF1C;            /*!< FDCAN RXF1C Register,               Address offset: 0xB0  */
   __IO uint32_t RXF1S;            /*!< FDCAN RXF1S Register,               Address offset: 0xB4  */
   __IO uint32_t RXF1A;            /*!< FDCAN RXF1A Register,               Address offset: 0xB8  */
   __IO uint32_t RXESC;            /*!< FDCAN RXESC Register,               Address offset: 0xBC  */
   __IO uint32_t TXBC;             /*!< FDCAN TXBC Register,                Address offset: 0xC0  */
   __IO uint32_t TXFQS;            /*!< FDCAN TXFQS Register,               Address offset: 0xC4  */
   __IO uint32_t TXESC;            /*!< FDCAN TXESC Register,               Address offset: 0xC8  */
   __IO uint32_t TXBRP;            /*!< FDCAN TXBRP Register,               Address offset: 0xCC  */
   __IO uint32_t TXBAR;            /*!< FDCAN TXBAR Register,               Address offset: 0xD0  */
   __IO uint32_t TXBCR;            /*!< FDCAN TXBCR Register,               Address offset: 0xD4  */
   __IO uint32_t TXBTO;            /*!< FDCAN TXBTO Register,               Address offset: 0xD8  */
   __IO uint32_t TXBCF;            /*!< FDCAN TXBCF Register,               Address offset: 0xDC  */
   __IO uint32_t TXBTIE;           /*!< FDCAN TXBTIE Register,              Address offset: 0xE0  */
   __IO uint32_t TXBCIE;           /*!< FDCAN TXBCIE Register,              Address offset: 0xE4  */
   __IO uint32_t RESERVED7[2];      
   __IO uint32_t TXEFC;            /*!< FDCAN TXEFC Register,               Address offset: 0xF0  */
   __IO uint32_t TXEFS;            /*!< FDCAN TXEFS Register,               Address offset: 0xF4  */
   __IO uint32_t TXEFA;            /*!< FDCAN TXEFA Register,               Address offset: 0xF8  */
} FDCAN_GlobalTypeDef;



/**
  * @brief Comparator
  */
typedef struct
{
  __IO uint32_t CSR;              /*!< COMP control and status register,           Address offset: 0x00 */
  __IO uint32_t FR;               /*!< COMP filter register,                       Address offset: 0x04 */
} COMP_TypeDef;

typedef struct
{
  __IO uint32_t CSR_ODD;       /*!< COMP control and status register located in register of comparator instance 1, used for bits common to several COMP instances,  Address offset: 0x00 */
  __IO uint32_t FR_ODD;
  uint32_t RESERVED0[2];        /*Reserved*/
  __IO uint32_t CSR_EVEN;      /*!< COMP control and status register located in register of comparator instance 2, used for bits common to several COMP instances, Address offset: 0x010 */
  __IO uint32_t FR_EVEN;
} COMP_Common_TypeDef;

/**
* @brief CRC Registers
*/
typedef struct
{
   __IO uint32_t DR;               /*!< CRC DR Register,                    Address offset: 0x00  */
   __IO uint32_t IDR;              /*!< CRC IDR Register,                   Address offset: 0x04  */
   __IO uint32_t CR;               /*!< CRC CR Register,                    Address offset: 0x08  */
   __IO uint32_t RESERVED1;          
   __IO uint32_t INIT;             /*!< CRC INIT Register,                  Address offset: 0x10  */
   __IO uint32_t POL;              /*!< CRC POL Register,                   Address offset: 0x14  */
} CRC_TypeDef;


/**
* @brief CTC Registers
*/
typedef struct
{
   __IO uint32_t CTL0;             /*!< CTC CTL0 Register,                  Address offset: 0x00  */
   __IO uint32_t CTL1;             /*!< CTC CTL1 Register,                  Address offset: 0x04  */
   __IO uint32_t SR;               /*!< CTC SR Register,                    Address offset: 0x08  */
   __IO uint32_t INTC;             /*!< CTC INTC Register,                  Address offset: 0x0C  */
}CTC_TypeDef;

/**
* @brief CORDIC Registers
*/
typedef struct
{
   __IO uint32_t CSR;              /*!< CORDIC CSR Register,                Address offset: 0x00  */
   __IO uint32_t WDATA;            /*!< CORDIC WDATA Register,              Address offset: 0x04  */
   __IO uint32_t RDATA;            /*!< CORDIC RDATA Register,              Address offset: 0x08  */
} CORDIC_TypeDef;

/**
* @brief DAC Registers
*/
typedef struct
{
   __IO uint32_t CR;               /*!< DAC CR Register,                    Address offset: 0x00  */
   __IO uint32_t SWTRIGR;          /*!< DAC SWTRIGR Register,               Address offset: 0x04  */
   __IO uint32_t DHR12R1;          /*!< DAC DHR12R1 Register,               Address offset: 0x08  */
   __IO uint32_t DHR12L1;          /*!< DAC DHR12L1 Register,               Address offset: 0x0C  */
   __IO uint32_t DHR8R1;           /*!< DAC DHR8R1 Register,                Address offset: 0x10  */
   __IO uint32_t DHR12R2;          /*!< DAC DHR12R2 Register,               Address offset: 0x14  */
   __IO uint32_t DHR12L2;          /*!< DAC DHR12L2 Register,               Address offset: 0x18  */
   __IO uint32_t DHR8R2;           /*!< DAC DHR8R2 Register,                Address offset: 0x1C  */
   __IO uint32_t DHR12RD;          /*!< DAC DHR12RD Register,               Address offset: 0x20  */
   __IO uint32_t DHR12LD;          /*!< DAC DHR12LD Register,               Address offset: 0x24  */
   __IO uint32_t DHR8RD;           /*!< DAC DHR8RD Register,                Address offset: 0x28  */
   __IO uint32_t DOR1;             /*!< DAC DOR1 Register,                  Address offset: 0x2C  */
   __IO uint32_t DOR2;             /*!< DAC DOR2 Register,                  Address offset: 0x30  */
   __IO uint32_t SR;               /*!< DAC SR Register,                    Address offset: 0x34  */
   __IO uint32_t OC;               /*!< DAC OC Register,                    Address offset: 0x38  */
} DAC_TypeDef;


/**
* @brief DBGMCU Registers
*/
typedef struct
{
    __IO uint32_t IDCODE;      /*!< DBGMCU desc IDCODE, Address offset: 0x00 */
    __IO uint32_t CR1;         /*!< DBGMCU desc CR1,    Address offset: 0x04 */
    __IO uint32_t CR2;         /*!< DBGMCU desc CR2,    Address offset: 0x04 */
}DBGMCU_TypeDef;

/**
* @brief DMA Controller Registers
*/
typedef struct
{
   __IO uint32_t EN;               /*!< DMA EN Register,                    Address offset: 0x00  */
   __IO uint32_t RESERVED1;         
   __IO uint32_t CH_EN;            /*!< DMA CH_EN Register,                 Address offset: 0x08  */
   __IO uint32_t RESERVED2[167];    
   __IO uint32_t STATUSHALFBLOCK;  /*!< DMA STATUSHALFBLOCK Register,       Address offset: 0x2A8  */
   __IO uint32_t RESERVED3;        
   __IO uint32_t MASKHALFBLOCK;    /*!< DMA MASKHALFBLOCK Register,         Address offset: 0x2B0  */
   __IO uint32_t RESERVED4;        
   __IO uint32_t CLEARHALFBLOCK;   /*!< DMA CLEARHALFBLOCK Register,        Address offset: 0x2B8  */
   __IO uint32_t RESERVED5[11];
   __IO uint32_t STATUSTFR;        /*!< DMA STATUSTFR Register,             Address offset: 0x2E8  */
   __IO uint32_t RESERVED6;        
   __IO uint32_t STATUSBLOCK;      /*!< DMA STATUSBLOCK Register,           Address offset: 0x2F0  */
   __IO uint32_t RESERVED7;        
   __IO uint32_t STATUSSRCTRAN;    /*!< DMA STATUSSRCTRAN Register,         Address offset: 0x2F8  */
   __IO uint32_t RESERVED8;        
   __IO uint32_t STATUSDSTTRAN;    /*!< DMA STATUSDSTTRAN Register,         Address offset: 0x300  */
   __IO uint32_t RESERVED9;        
   __IO uint32_t STATUSERR;        /*!< DMA STATUSERR Register,             Address offset: 0x308  */
   __IO uint32_t RESERVED10;        
   __IO uint32_t MASKTFR;          /*!< DMA MASKTFR Register,               Address offset: 0x310  */
   __IO uint32_t RESERVED11;        
   __IO uint32_t MASKBLOCK;        /*!< DMA MASKBLOCK Register,             Address offset: 0x318  */
   __IO uint32_t RESERVED12;        
   __IO uint32_t MASKSRCTRAN;      /*!< DMA MASKSRCTRAN Register,           Address offset: 0x320  */
   __IO uint32_t RESERVED13;        
   __IO uint32_t MASKDSTTRAN;      /*!< DMA MASKDSTTRAN Register,           Address offset: 0x328  */
   __IO uint32_t RESERVED14;        
   __IO uint32_t MASKERR;          /*!< DMA MASKERR Register,               Address offset: 0x330  */
   __IO uint32_t RESERVED15;        
   __IO uint32_t CLEARTFR;         /*!< DMA CLEARTFR Register,              Address offset: 0x338  */
   __IO uint32_t RESERVED16;        
   __IO uint32_t CLEARBLOCK;       /*!< DMA CLEARBLOCK Register,            Address offset: 0x340  */
   __IO uint32_t RESERVED17;        
   __IO uint32_t CLEARSRCTRAN;     /*!< DMA CLEARSRCTRAN Register,          Address offset: 0x348  */
   __IO uint32_t RESERVED18;        
   __IO uint32_t CLEARDSTTRAN;     /*!< DMA CLEARDSTTRAN Register,          Address offset: 0x350  */
   __IO uint32_t RESERVED19;        
   __IO uint32_t CLEARERR;         /*!< DMA CLEARERR Register,              Address offset: 0x358  */
   __IO uint32_t RESERVED20;        
   __IO uint32_t STATUSINT;        /*!< DMA STATUSINT Register,             Address offset: 0x360  */
   __IO uint32_t RESERVED21;        
   __IO uint32_t REQSRC;           /*!< DMA REQSRC Register,                Address offset: 0x368  */
   __IO uint32_t RESERVED22;        
   __IO uint32_t REQDST;           /*!< DMA REQDST Register,                Address offset: 0x370  */
   __IO uint32_t RESERVED23;        
   __IO uint32_t SGLRQSRC;         /*!< DMA SGLRQSRC Register,              Address offset: 0x378  */
   __IO uint32_t RESERVED24;        
   __IO uint32_t SGLRQDST;         /*!< DMA SGLRQDST Register,              Address offset: 0x380  */
} DMA_TypeDef;

typedef struct
{
   __IO uint32_t CH_CTRLL;        /*!< DMA CH_CTRLLx Register,             Address offset: 0x10  */
   __IO uint32_t CH_CTRLH;        /*!< DMA CH_CTRLHx Register,             Address offset: 0x14  */
   __IO uint32_t CH_CFGL;         /*!< DMA CH_CFGLx Register,              Address offset: 0x18  */
   __IO uint32_t CH_CFGH;         /*!< DMA CH_CFGHx Register,              Address offset: 0x1C  */
   __IO uint32_t SA;              /*!< DMA SAx Register,                   Address offset: 0x20  */
   __IO uint32_t RESERVED1;         
   __IO uint32_t DA;              /*!< DMA DAx Register,                   Address offset: 0x28  */
} DMA_Channel_TypeDef;

/**
* @brief ETH Registers
*/

