Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xE.h
/********************************* Bit definition for ADC_CCR register *********************************************/
#define ADC_CCR_DUAL_Pos                         (0U)
#define ADC_CCR_DUAL_Msk                         (0x1FUL<<ADC_CCR_DUAL_Pos)                       /*!< 0x0000001F */
#define ADC_CCR_DUAL                             ADC_CCR_DUAL_Msk
#define ADC_CCR_DUAL_0                           (0x1UL<<ADC_CCR_DUAL_Pos)                        /*!< 0x00000001 */
#define ADC_CCR_DUAL_1                           (0x2UL<<ADC_CCR_DUAL_Pos)                        /*!< 0x00000002 */
#define ADC_CCR_DUAL_2                           (0x4UL<<ADC_CCR_DUAL_Pos)                        /*!< 0x00000004 */
#define ADC_CCR_DUAL_3                           (0x8UL<<ADC_CCR_DUAL_Pos)                        /*!< 0x00000008 */
#define ADC_CCR_DUAL_4                           (0x10UL<<ADC_CCR_DUAL_Pos)                       /*!< 0x00000010 */
#define ADC_CCR_VREFBUFEN_Pos                    (5U)
#define ADC_CCR_VREFBUFEN_Msk                    (0x1UL<<ADC_CCR_VREFBUFEN_Pos)                   /*!< 0x00000020 */
#define ADC_CCR_VREFBUFEN                        ADC_CCR_VREFBUFEN_Msk                            
#define ADC_CCR_VREFBUFSEL_Pos                   (6U)
#define ADC_CCR_VREFBUFSEL_Msk                   (0x3UL<<ADC_CCR_VREFBUFSEL_Pos)                  /*!< 0x000000C0 */
#define ADC_CCR_VREFBUFSEL                       ADC_CCR_VREFBUFSEL_Msk
#define ADC_CCR_VREFBUFSEL_0                     (0x1UL<<ADC_CCR_VREFBUFSEL_Pos)                  /*!< 0x00000040 */
#define ADC_CCR_VREFBUFSEL_1                     (0x2UL<<ADC_CCR_VREFBUFSEL_Pos)                  /*!< 0x00000080 */
#define ADC_CCR_VREFEN_Pos                       (22U)
#define ADC_CCR_VREFEN_Msk                       (0x1UL<<ADC_CCR_VREFEN_Pos)                      /*!< 0x00400000 */
#define ADC_CCR_VREFEN                           ADC_CCR_VREFEN_Msk                               
#define ADC_CCR_VSENSESEL_Pos                    (23U)
#define ADC_CCR_VSENSESEL_Msk                    (0x1UL<<ADC_CCR_VSENSESEL_Pos)                   /*!< 0x00800000 */
#define ADC_CCR_VSENSESEL                        ADC_CCR_VSENSESEL_Msk                            
#define ADC_CCR_VBATSEL_Pos                      (24U)
#define ADC_CCR_VBATSEL_Msk                      (0x1UL<<ADC_CCR_VBATSEL_Pos)                     /*!< 0x01000000 */
#define ADC_CCR_VBATSEL                          ADC_CCR_VBATSEL_Msk                              
#define ADC_CCR_PWRMODE_Pos                      (25U)
#define ADC_CCR_PWRMODE_Msk                      (0x7UL<<ADC_CCR_PWRMODE_Pos)                     /*!< 0x0E000000 */
#define ADC_CCR_PWRMODE                          ADC_CCR_PWRMODE_Msk
#define ADC_CCR_PWRMODE_0                        (0x1UL<<ADC_CCR_PWRMODE_Pos)                     /*!< 0x02000000 */
#define ADC_CCR_PWRMODE_1                        (0x2UL<<ADC_CCR_PWRMODE_Pos)                     /*!< 0x04000000 */
#define ADC_CCR_PWRMODE_2                        (0x4UL<<ADC_CCR_PWRMODE_Pos)                     /*!< 0x08000000 */
#define ADC_CCR_VREFSEL_Pos                      (28U)
#define ADC_CCR_VREFSEL_Msk                      (0x1UL<<ADC_CCR_VREFSEL_Pos)                     /*!< 0x10000000 */
#define ADC_CCR_VREFSEL                          ADC_CCR_VREFSEL_Msk                              

/********************************************************************************************************************/
/********************************* AES ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for AES_MSG_CFG register ******************************************/
#define AES_MSG_CFG_AES_GO_Pos                    (0U)
#define AES_MSG_CFG_AES_GO_Msk                    (0x1UL<<AES_MSG_CFG_AES_GO_Pos)                   /*!< 0x00000001 */
#define AES_MSG_CFG_AES_GO                        AES_MSG_CFG_AES_GO_Msk                            
#define AES_MSG_CFG_MSG_END_Pos                   (1U)
#define AES_MSG_CFG_MSG_END_Msk                   (0x1UL<<AES_MSG_CFG_MSG_END_Pos)                  /*!< 0x00000002 */
#define AES_MSG_CFG_MSG_END                       AES_MSG_CFG_MSG_END_Msk                           
#define AES_MSG_CFG_MSG_BEGIN_Pos                 (2U)
#define AES_MSG_CFG_MSG_BEGIN_Msk                 (0x1UL<<AES_MSG_CFG_MSG_BEGIN_Pos)                /*!< 0x00000004 */
#define AES_MSG_CFG_MSG_BEGIN                     AES_MSG_CFG_MSG_BEGIN_Msk                         
#define AES_MSG_CFG_ALGODIR_Pos                   (3U)
#define AES_MSG_CFG_ALGODIR_Msk                   (0x1UL<<AES_MSG_CFG_ALGODIR_Pos)                  /*!< 0x00000008 */
#define AES_MSG_CFG_ALGODIR                       AES_MSG_CFG_ALGODIR_Msk                           
#define AES_MSG_CFG_ALG_MODE_Pos                  (4U)
#define AES_MSG_CFG_ALG_MODE_Msk                  (0xFUL<<AES_MSG_CFG_ALG_MODE_Pos)                 /*!< 0x000000F0 */
#define AES_MSG_CFG_ALG_MODE                      AES_MSG_CFG_ALG_MODE_Msk
#define AES_MSG_CFG_ALG_MODE_0                    (0x1UL<<AES_MSG_CFG_ALG_MODE_Pos)                 /*!< 0x00000010 */
#define AES_MSG_CFG_ALG_MODE_1                    (0x2UL<<AES_MSG_CFG_ALG_MODE_Pos)                 /*!< 0x00000020 */
#define AES_MSG_CFG_ALG_MODE_2                    (0x4UL<<AES_MSG_CFG_ALG_MODE_Pos)                 /*!< 0x00000040 */
#define AES_MSG_CFG_ALG_MODE_3                    (0x8UL<<AES_MSG_CFG_ALG_MODE_Pos)                 /*!< 0x00000080 */
#define AES_MSG_CFG_MAC_LEN_Pos                   (8U)
#define AES_MSG_CFG_MAC_LEN_Msk                   (0xFUL<<AES_MSG_CFG_MAC_LEN_Pos)                  /*!< 0x00000F00 */
#define AES_MSG_CFG_MAC_LEN                       AES_MSG_CFG_MAC_LEN_Msk
#define AES_MSG_CFG_MAC_LEN_0                     (0x1UL<<AES_MSG_CFG_MAC_LEN_Pos)                  /*!< 0x00000100 */
#define AES_MSG_CFG_MAC_LEN_1                     (0x2UL<<AES_MSG_CFG_MAC_LEN_Pos)                  /*!< 0x00000200 */
#define AES_MSG_CFG_MAC_LEN_2                     (0x4UL<<AES_MSG_CFG_MAC_LEN_Pos)                  /*!< 0x00000400 */
#define AES_MSG_CFG_MAC_LEN_3                     (0x8UL<<AES_MSG_CFG_MAC_LEN_Pos)                  /*!< 0x00000800 */
#define AES_MSG_CFG_KEY_SIZE_Pos                  (12U)
#define AES_MSG_CFG_KEY_SIZE_Msk                  (0x3UL<<AES_MSG_CFG_KEY_SIZE_Pos)                 /*!< 0x00003000 */
#define AES_MSG_CFG_KEY_SIZE                      AES_MSG_CFG_KEY_SIZE_Msk
#define AES_MSG_CFG_KEY_SIZE_0                    (0x1UL<<AES_MSG_CFG_KEY_SIZE_Pos)                 /*!< 0x00001000 */
#define AES_MSG_CFG_KEY_SIZE_1                    (0x2UL<<AES_MSG_CFG_KEY_SIZE_Pos)                 /*!< 0x00002000 */

/********************************* Bit definition for AES_CTX_CFG register ******************************************/
#define AES_CTX_CFG_CTX_RET_Pos                   (0U)
#define AES_CTX_CFG_CTX_RET_Msk                   (0x1UL<<AES_CTX_CFG_CTX_RET_Pos)                  /*!< 0x00000001 */
#define AES_CTX_CFG_CTX_RET                       AES_CTX_CFG_CTX_RET_Msk                           
#define AES_CTX_CFG_CTX_STR_Pos                   (1U)
#define AES_CTX_CFG_CTX_STR_Msk                   (0x1UL<<AES_CTX_CFG_CTX_STR_Pos)                  /*!< 0x00000002 */
#define AES_CTX_CFG_CTX_STR                       AES_CTX_CFG_CTX_STR_Msk                           
#define AES_CTX_CFG_INV_KEY_RET_Pos               (2U)
#define AES_CTX_CFG_INV_KEY_RET_Msk               (0x1UL<<AES_CTX_CFG_INV_KEY_RET_Pos)              /*!< 0x00000004 */
#define AES_CTX_CFG_INV_KEY_RET                   AES_CTX_CFG_INV_KEY_RET_Msk                       
#define AES_CTX_CFG_INV_KEY_STR_Pos               (3U)
#define AES_CTX_CFG_INV_KEY_STR_Msk               (0x1UL<<AES_CTX_CFG_INV_KEY_STR_Pos)              /*!< 0x00000008 */
#define AES_CTX_CFG_INV_KEY_STR                   AES_CTX_CFG_INV_KEY_STR_Msk                       
#define AES_CTX_CFG_CTX_INDEX_Pos                 (4U)
#define AES_CTX_CFG_CTX_INDEX_Msk                 (0xFFFUL<<AES_CTX_CFG_CTX_INDEX_Pos)              /*!< 0x0000FFF0 */
#define AES_CTX_CFG_CTX_INDEX                     AES_CTX_CFG_CTX_INDEX_Msk

/********************************* Bit definition for AES_MSG_TOTAL_BYTES register **********************************/
#define AES_MSG_TOTAL_BYTES_TOTAL_BYTES_Pos       (0U)
#define AES_MSG_TOTAL_BYTES_TOTAL_BYTES_Msk       (0xFFFFFFFUL<<AES_MSG_TOTAL_BYTES_TOTAL_BYTES_Pos)/*!< 0x0FFFFFFF */
#define AES_MSG_TOTAL_BYTES_TOTAL_BYTES           AES_MSG_TOTAL_BYTES_TOTAL_BYTES_Msk

/********************************* Bit definition for AES_MSG_AAD_BYTES register ************************************/
#define AES_MSG_AAD_BYTES_MSG_LEN_Pos             (0U)
#define AES_MSG_AAD_BYTES_MSG_LEN_Msk             (0xFFFFUL<<AES_MSG_AAD_BYTES_MSG_LEN_Pos)         /*!< 0x0000FFFF */
#define AES_MSG_AAD_BYTES_MSG_LEN                 AES_MSG_AAD_BYTES_MSG_LEN_Msk
#define AES_MSG_AAD_BYTES_ADD_LEN_Pos             (16U)
#define AES_MSG_AAD_BYTES_ADD_LEN_Msk             (0xFFFFUL<<AES_MSG_AAD_BYTES_ADD_LEN_Pos)         /*!< 0xFFFF0000 */
#define AES_MSG_AAD_BYTES_ADD_LEN                 AES_MSG_AAD_BYTES_ADD_LEN_Msk

/********************************* Bit definition for AES_GCM_AAD_INFO register *************************************/
#define AES_GCM_AAD_INFO_ADD_LEN_TOT_Pos          (0U)
#define AES_GCM_AAD_INFO_ADD_LEN_TOT_Msk          (0xFFFFFFFUL<<AES_GCM_AAD_INFO_ADD_LEN_TOT_Pos)   /*!< 0x0FFFFFFF */
#define AES_GCM_AAD_INFO_ADD_LEN_TOT              AES_GCM_AAD_INFO_ADD_LEN_TOT_Msk

