Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xE.h
/********************************* Bit definition for AES_CTX_KEY0 register *****************************************/
#define AES_CTX_KEY0_KEY0_Pos                     (0U)
#define AES_CTX_KEY0_KEY0_Msk                     (0xFFFFFFFFUL<<AES_CTX_KEY0_KEY0_Pos)             /*!< 0xFFFFFFFF */
#define AES_CTX_KEY0_KEY0                         AES_CTX_KEY0_KEY0_Msk

/********************************* Bit definition for AES_CTX_KEY1 register *****************************************/
#define AES_CTX_KEY1_KEY1_Pos                     (0U)
#define AES_CTX_KEY1_KEY1_Msk                     (0xFFFFFFFFUL<<AES_CTX_KEY1_KEY1_Pos)             /*!< 0xFFFFFFFF */
#define AES_CTX_KEY1_KEY1                         AES_CTX_KEY1_KEY1_Msk

/********************************* Bit definition for AES_CTX_KEY2 register *****************************************/
#define AES_CTX_KEY2_KEY2_Pos                     (0U)
#define AES_CTX_KEY2_KEY2_Msk                     (0xFFFFFFFFUL<<AES_CTX_KEY2_KEY2_Pos)             /*!< 0xFFFFFFFF */
#define AES_CTX_KEY2_KEY2                         AES_CTX_KEY2_KEY2_Msk

/********************************* Bit definition for AES_CTX_KEY3 register *****************************************/
#define AES_CTX_KEY3_KEY3_Pos                     (0U)
#define AES_CTX_KEY3_KEY3_Msk                     (0xFFFFFFFFUL<<AES_CTX_KEY3_KEY3_Pos)             /*!< 0xFFFFFFFF */
#define AES_CTX_KEY3_KEY3                         AES_CTX_KEY3_KEY3_Msk

/********************************* Bit definition for AES_CTX_KEY4 register *****************************************/
#define AES_CTX_KEY4_KEY4_Pos                     (0U)
#define AES_CTX_KEY4_KEY4_Msk                     (0xFFFFFFFFUL<<AES_CTX_KEY4_KEY4_Pos)             /*!< 0xFFFFFFFF */
#define AES_CTX_KEY4_KEY4                         AES_CTX_KEY4_KEY4_Msk

/********************************* Bit definition for AES_CTX_KEY5 register *****************************************/
#define AES_CTX_KEY5_KEY5_Pos                     (0U)
#define AES_CTX_KEY5_KEY5_Msk                     (0xFFFFFFFFUL<<AES_CTX_KEY5_KEY5_Pos)             /*!< 0xFFFFFFFF */
#define AES_CTX_KEY5_KEY5                         AES_CTX_KEY5_KEY5_Msk

/********************************* Bit definition for AES_CTX_KEY6 register *****************************************/
#define AES_CTX_KEY6_KEY6_Pos                     (0U)
#define AES_CTX_KEY6_KEY6_Msk                     (0xFFFFFFFFUL<<AES_CTX_KEY6_KEY6_Pos)             /*!< 0xFFFFFFFF */
#define AES_CTX_KEY6_KEY6                         AES_CTX_KEY6_KEY6_Msk

/********************************* Bit definition for AES_CTX_KEY7 register *****************************************/
#define AES_CTX_KEY7_KEY7_Pos                     (0U)
#define AES_CTX_KEY7_KEY7_Msk                     (0xFFFFFFFFUL<<AES_CTX_KEY7_KEY7_Pos)             /*!< 0xFFFFFFFF */
#define AES_CTX_KEY7_KEY7                         AES_CTX_KEY7_KEY7_Msk

/********************************* Bit definition for AES_CTX_CBC_KEY0 register *************************************/
#define AES_CTX_CBC_KEY0_CBC_KEY0_Pos             (0U)
#define AES_CTX_CBC_KEY0_CBC_KEY0_Msk             (0xFFFFFFFFUL<<AES_CTX_CBC_KEY0_CBC_KEY0_Pos)     /*!< 0xFFFFFFFF */
#define AES_CTX_CBC_KEY0_CBC_KEY0                 AES_CTX_CBC_KEY0_CBC_KEY0_Msk

/********************************* Bit definition for AES_CTX_CBC_KEY1 register *************************************/
#define AES_CTX_CBC_KEY1_CBC_KEY1_Pos             (0U)
#define AES_CTX_CBC_KEY1_CBC_KEY1_Msk             (0xFFFFFFFFUL<<AES_CTX_CBC_KEY1_CBC_KEY1_Pos)     /*!< 0xFFFFFFFF */
#define AES_CTX_CBC_KEY1_CBC_KEY1                 AES_CTX_CBC_KEY1_CBC_KEY1_Msk

/********************************* Bit definition for AES_CTX_CBC_KEY2 register *************************************/
#define AES_CTX_CBC_KEY2_CBC_KEY2_Pos             (0U)
#define AES_CTX_CBC_KEY2_CBC_KEY2_Msk             (0xFFFFFFFFUL<<AES_CTX_CBC_KEY2_CBC_KEY2_Pos)     /*!< 0xFFFFFFFF */
#define AES_CTX_CBC_KEY2_CBC_KEY2                 AES_CTX_CBC_KEY2_CBC_KEY2_Msk

/********************************* Bit definition for AES_CTX_CBC_KEY3 register *************************************/
#define AES_CTX_CBC_KEY3_CBC_KEY3_Pos             (0U)
#define AES_CTX_CBC_KEY3_CBC_KEY3_Msk             (0xFFFFFFFFUL<<AES_CTX_CBC_KEY3_CBC_KEY3_Pos)     /*!< 0xFFFFFFFF */
#define AES_CTX_CBC_KEY3_CBC_KEY3                 AES_CTX_CBC_KEY3_CBC_KEY3_Msk

/********************************* Bit definition for AES_CTX_CTR0 register *****************************************/
#define AES_CTX_CTR0_CCM_CTR0_Pos                 (0U)
#define AES_CTX_CTR0_CCM_CTR0_Msk                 (0xFFFFFFFFUL<<AES_CTX_CTR0_CCM_CTR0_Pos)         /*!< 0xFFFFFFFF */
#define AES_CTX_CTR0_CCM_CTR0                     AES_CTX_CTR0_CCM_CTR0_Msk

/********************************* Bit definition for AES_CTX_CTR1 register *****************************************/
#define AES_CTX_CTR1_CCM_CTR1_Pos                 (0U)
#define AES_CTX_CTR1_CCM_CTR1_Msk                 (0xFFFFFFFFUL<<AES_CTX_CTR1_CCM_CTR1_Pos)         /*!< 0xFFFFFFFF */
#define AES_CTX_CTR1_CCM_CTR1                     AES_CTX_CTR1_CCM_CTR1_Msk

/********************************* Bit definition for AES_CTX_CTR2 register *****************************************/
#define AES_CTX_CTR2_CCM_CTR2_Pos                 (0U)
#define AES_CTX_CTR2_CCM_CTR2_Msk                 (0xFFFFFFFFUL<<AES_CTX_CTR2_CCM_CTR2_Pos)         /*!< 0xFFFFFFFF */
#define AES_CTX_CTR2_CCM_CTR2                     AES_CTX_CTR2_CCM_CTR2_Msk

/********************************* Bit definition for AES_CTX_CTR3 register *****************************************/
#define AES_CTX_CTR3_CCM_CTR3_Pos                 (0U)
#define AES_CTX_CTR3_CCM_CTR3_Msk                 (0xFFFFFFFFUL<<AES_CTX_CTR3_CCM_CTR3_Pos)         /*!< 0xFFFFFFFF */
#define AES_CTX_CTR3_CCM_CTR3                     AES_CTX_CTR3_CCM_CTR3_Msk

/********************************* Bit definition for AES_CTX_IV0 register ******************************************/
#define AES_CTX_IV0_IV0_Pos                       (0U)
#define AES_CTX_IV0_IV0_Msk                       (0xFFFFFFFFUL<<AES_CTX_IV0_IV0_Pos)               /*!< 0xFFFFFFFF */
#define AES_CTX_IV0_IV0                           AES_CTX_IV0_IV0_Msk

