Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xE.h
/********************************* Bit definition for AES_CTX_IV1 register ******************************************/
#define AES_CTX_IV1_IV1_Pos                       (0U)
#define AES_CTX_IV1_IV1_Msk                       (0xFFFFFFFFUL<<AES_CTX_IV1_IV1_Pos)               /*!< 0xFFFFFFFF */
#define AES_CTX_IV1_IV1                           AES_CTX_IV1_IV1_Msk

/********************************* Bit definition for AES_CTX_IV2 register ******************************************/
#define AES_CTX_IV2_IV2_Pos                       (0U)
#define AES_CTX_IV2_IV2_Msk                       (0xFFFFFFFFUL<<AES_CTX_IV2_IV2_Pos)               /*!< 0xFFFFFFFF */
#define AES_CTX_IV2_IV2                           AES_CTX_IV2_IV2_Msk

/********************************* Bit definition for AES_CTX_IV3 register ******************************************/
#define AES_CTX_IV3_IV3_Pos                       (0U)
#define AES_CTX_IV3_IV3_Msk                       (0xFFFFFFFFUL<<AES_CTX_IV3_IV3_Pos)               /*!< 0xFFFFFFFF */
#define AES_CTX_IV3_IV3                           AES_CTX_IV3_IV3_Msk

/********************************* Bit definition for AES_CTX_MAC0 register *****************************************/
#define AES_CTX_MAC0_MAC0_Pos                     (0U)
#define AES_CTX_MAC0_MAC0_Msk                     (0xFFFFFFFFUL<<AES_CTX_MAC0_MAC0_Pos)             /*!< 0xFFFFFFFF */
#define AES_CTX_MAC0_MAC0                         AES_CTX_MAC0_MAC0_Msk

/********************************* Bit definition for AES_CTX_MAC1 register *****************************************/
#define AES_CTX_MAC1_MAC1_Pos                     (0U)
#define AES_CTX_MAC1_MAC1_Msk                     (0xFFFFFFFFUL<<AES_CTX_MAC1_MAC1_Pos)             /*!< 0xFFFFFFFF */
#define AES_CTX_MAC1_MAC1                         AES_CTX_MAC1_MAC1_Msk

/********************************* Bit definition for AES_CTX_MAC2 register *****************************************/
#define AES_CTX_MAC2_MAC2_Pos                     (0U)
#define AES_CTX_MAC2_MAC2_Msk                     (0xFFFFFFFFUL<<AES_CTX_MAC2_MAC2_Pos)             /*!< 0xFFFFFFFF */
#define AES_CTX_MAC2_MAC2                         AES_CTX_MAC2_MAC2_Msk

/********************************* Bit definition for AES_CTX_MAC3 register *****************************************/
#define AES_CTX_MAC3_MAC3_Pos                     (0U)
#define AES_CTX_MAC3_MAC3_Msk                     (0xFFFFFFFFUL<<AES_CTX_MAC3_MAC3_Pos)             /*!< 0xFFFFFFFF */
#define AES_CTX_MAC3_MAC3                         AES_CTX_MAC3_MAC3_Msk

/********************************* Bit definition for AES_INGRESS_FIFO register *************************************/
#define AES_INGRESS_FIFO_INGRESS_FIFO_Pos         (0U)
#define AES_INGRESS_FIFO_INGRESS_FIFO_Msk         (0xFFFFFFFFUL<<AES_INGRESS_FIFO_INGRESS_FIFO_Pos) /*!< 0xFFFFFFFF */
#define AES_INGRESS_FIFO_INGRESS_FIFO             AES_INGRESS_FIFO_INGRESS_FIFO_Msk

/********************************* Bit definition for AES_ING_DBCFG register ****************************************/
#define AES_ING_DBCFG_DST_TR_WIDTH_Pos            (0U)
#define AES_ING_DBCFG_DST_TR_WIDTH_Msk            (0x7UL<<AES_ING_DBCFG_DST_TR_WIDTH_Pos)           /*!< 0x00000007 */
#define AES_ING_DBCFG_DST_TR_WIDTH                AES_ING_DBCFG_DST_TR_WIDTH_Msk
#define AES_ING_DBCFG_DST_TR_WIDTH_0              (0x1UL<<AES_ING_DBCFG_DST_TR_WIDTH_Pos)           /*!< 0x00000001 */
#define AES_ING_DBCFG_DST_TR_WIDTH_1              (0x2UL<<AES_ING_DBCFG_DST_TR_WIDTH_Pos)           /*!< 0x00000002 */
#define AES_ING_DBCFG_DST_TR_WIDTH_2              (0x4UL<<AES_ING_DBCFG_DST_TR_WIDTH_Pos)           /*!< 0x00000004 */
#define AES_ING_DBCFG_DST_MSIZE_Pos               (3U)
#define AES_ING_DBCFG_DST_MSIZE_Msk               (0x7UL<<AES_ING_DBCFG_DST_MSIZE_Pos)              /*!< 0x00000038 */
#define AES_ING_DBCFG_DST_MSIZE                   AES_ING_DBCFG_DST_MSIZE_Msk
#define AES_ING_DBCFG_DST_MSIZE_0                 (0x1UL<<AES_ING_DBCFG_DST_MSIZE_Pos)              /*!< 0x00000008 */
#define AES_ING_DBCFG_DST_MSIZE_1                 (0x2UL<<AES_ING_DBCFG_DST_MSIZE_Pos)              /*!< 0x00000010 */
#define AES_ING_DBCFG_DST_MSIZE_2                 (0x4UL<<AES_ING_DBCFG_DST_MSIZE_Pos)              /*!< 0x00000020 */
#define AES_ING_DBCFG_DMA_EN_Pos                  (30U)
#define AES_ING_DBCFG_DMA_EN_Msk                  (0x1UL<<AES_ING_DBCFG_DMA_EN_Pos)                 /*!< 0x40000000 */
#define AES_ING_DBCFG_DMA_EN                      AES_ING_DBCFG_DMA_EN_Msk                          
#define AES_ING_DBCFG_PLAINTEXT_REQ_Pos           (31U)
#define AES_ING_DBCFG_PLAINTEXT_REQ_Msk           (0x1UL<<AES_ING_DBCFG_PLAINTEXT_REQ_Pos)          /*!< 0x80000000 */
#define AES_ING_DBCFG_PLAINTEXT_REQ               AES_ING_DBCFG_PLAINTEXT_REQ_Msk                   

/********************************* Bit definition for AES_DMA_ENG_LEN register **************************************/
#define AES_DMA_ENG_LEN_ENGRESS_DMA_DATA_LENGTH_Pos  (0U)
#define AES_DMA_ENG_LEN_ENGRESS_DMA_DATA_LENGTH_Msk  (0xFFFFFFFFUL<<AES_DMA_ENG_LEN_ENGRESS_DMA_DATA_LENGTH_Pos)/*!< 0xFFFFFFFF */
#define AES_DMA_ENG_LEN_ENGRESS_DMA_DATA_LENGTH       AES_DMA_ENG_LEN_ENGRESS_DMA_DATA_LENGTH_Msk

/********************************* Bit definition for AES_ENG_DBCFG register ****************************************/
#define AES_ENG_DBCFG_SRC_TR_WIDTH_Pos            (0U)
#define AES_ENG_DBCFG_SRC_TR_WIDTH_Msk            (0x7UL<<AES_ENG_DBCFG_SRC_TR_WIDTH_Pos)           /*!< 0x00000007 */
#define AES_ENG_DBCFG_SRC_TR_WIDTH                AES_ENG_DBCFG_SRC_TR_WIDTH_Msk
#define AES_ENG_DBCFG_SRC_TR_WIDTH_0              (0x1UL<<AES_ENG_DBCFG_SRC_TR_WIDTH_Pos)           /*!< 0x00000001 */
#define AES_ENG_DBCFG_SRC_TR_WIDTH_1              (0x2UL<<AES_ENG_DBCFG_SRC_TR_WIDTH_Pos)           /*!< 0x00000002 */
#define AES_ENG_DBCFG_SRC_TR_WIDTH_2              (0x4UL<<AES_ENG_DBCFG_SRC_TR_WIDTH_Pos)           /*!< 0x00000004 */
#define AES_ENG_DBCFG_SRC_MSIZE_Pos               (3U)
#define AES_ENG_DBCFG_SRC_MSIZE_Msk               (0x7UL<<AES_ENG_DBCFG_SRC_MSIZE_Pos)              /*!< 0x00000038 */
#define AES_ENG_DBCFG_SRC_MSIZE                   AES_ENG_DBCFG_SRC_MSIZE_Msk
#define AES_ENG_DBCFG_SRC_MSIZE_0                 (0x1UL<<AES_ENG_DBCFG_SRC_MSIZE_Pos)              /*!< 0x00000008 */
#define AES_ENG_DBCFG_SRC_MSIZE_1                 (0x2UL<<AES_ENG_DBCFG_SRC_MSIZE_Pos)              /*!< 0x00000010 */
#define AES_ENG_DBCFG_SRC_MSIZE_2                 (0x4UL<<AES_ENG_DBCFG_SRC_MSIZE_Pos)              /*!< 0x00000020 */
#define AES_ENG_DBCFG_DMA_EN_Pos                  (30U)
#define AES_ENG_DBCFG_DMA_EN_Msk                  (0x1UL<<AES_ENG_DBCFG_DMA_EN_Pos)                 /*!< 0x40000000 */
#define AES_ENG_DBCFG_DMA_EN                      AES_ENG_DBCFG_DMA_EN_Msk                          
#define AES_ENG_DBCFG_CIPERTEXT_REQ_Pos           (31U)
#define AES_ENG_DBCFG_CIPERTEXT_REQ_Msk           (0x1UL<<AES_ENG_DBCFG_CIPERTEXT_REQ_Pos)          /*!< 0x80000000 */
#define AES_ENG_DBCFG_CIPERTEXT_REQ               AES_ENG_DBCFG_CIPERTEXT_REQ_Msk                   

/********************************* Bit definition for AES_DMA_ING_LEN register **************************************/
#define AES_DMA_ING_LEN_INGRESS_DMA_DATA_LENGTH_Pos (0U)
#define AES_DMA_ING_LEN_INGRESS_DMA_DATA_LENGTH_Msk (0xFFFFFFFFUL<<AES_DMA_ING_LEN_INGRESS_DMA_DATA_LENGTH_Pos)/*!< 0xFFFFFFFF */
#define AES_DMA_ING_LEN_INGRESS_DMA_DATA_LENGTH      AES_DMA_ING_LEN_INGRESS_DMA_DATA_LENGTH_Msk

