Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xE.h
/********************************* Bit definition for DMA_STATUSHALFBLOCK register **********************************/
#define DMA_STATUSHALFBLOCK_STATUS_Pos            (0U)
#define DMA_STATUSHALFBLOCK_STATUS_Msk            (0x3FUL<<DMA_STATUSHALFBLOCK_STATUS_Pos)          /*!< 0x0000003F */
#define DMA_STATUSHALFBLOCK_STATUS                DMA_STATUSHALFBLOCK_STATUS_Msk                    /*!< Status for IntHalfBlock Interrupt */
#define DMA_STATUSHALFBLOCK_STATUS_0              (0x1UL<<DMA_STATUSHALFBLOCK_STATUS_Pos)           /*!< 0x00000001 */
#define DMA_STATUSHALFBLOCK_STATUS_1              (0x2UL<<DMA_STATUSHALFBLOCK_STATUS_Pos)           /*!< 0x00000002 */
#define DMA_STATUSHALFBLOCK_STATUS_2              (0x4UL<<DMA_STATUSHALFBLOCK_STATUS_Pos)           /*!< 0x00000004 */
#define DMA_STATUSHALFBLOCK_STATUS_3              (0x8UL<<DMA_STATUSHALFBLOCK_STATUS_Pos)           /*!< 0x00000008 */
#define DMA_STATUSHALFBLOCK_STATUS_4              (0x10UL<<DMA_STATUSHALFBLOCK_STATUS_Pos)          /*!< 0x00000010 */
#define DMA_STATUSHALFBLOCK_STATUS_5              (0x20UL<<DMA_STATUSHALFBLOCK_STATUS_Pos)          /*!< 0x00000020 */

/********************************* Bit definition for DMA_MASKHALFBLOCK register ************************************/
#define DMA_MASKHALFBLOCK_INT_MASK_Pos            (0U)
#define DMA_MASKHALFBLOCK_INT_MASK_Msk            (0x3FUL<<DMA_MASKHALFBLOCK_INT_MASK_Pos)          /*!< 0x0000003F */
#define DMA_MASKHALFBLOCK_INT_MASK                DMA_MASKHALFBLOCK_INT_MASK_Msk                    /*!< Mask for IntHalfBlock Interrupt */
#define DMA_MASKHALFBLOCK_INT_MASK_0              (0x1UL<<DMA_MASKHALFBLOCK_INT_MASK_Pos)           /*!< 0x00000001 */
#define DMA_MASKHALFBLOCK_INT_MASK_1              (0x2UL<<DMA_MASKHALFBLOCK_INT_MASK_Pos)           /*!< 0x00000002 */
#define DMA_MASKHALFBLOCK_INT_MASK_2              (0x4UL<<DMA_MASKHALFBLOCK_INT_MASK_Pos)           /*!< 0x00000004 */
#define DMA_MASKHALFBLOCK_INT_MASK_3              (0x8UL<<DMA_MASKHALFBLOCK_INT_MASK_Pos)           /*!< 0x00000008 */
#define DMA_MASKHALFBLOCK_INT_MASK_4              (0x10UL<<DMA_MASKHALFBLOCK_INT_MASK_Pos)          /*!< 0x00000010 */
#define DMA_MASKHALFBLOCK_INT_MASK_5              (0x20UL<<DMA_MASKHALFBLOCK_INT_MASK_Pos)          /*!< 0x00000020 */
#define DMA_MASKHALFBLOCK_INT_MASK_WE_Pos         (8U)
#define DMA_MASKHALFBLOCK_INT_MASK_WE_Msk         (0x3FUL<<DMA_MASKHALFBLOCK_INT_MASK_WE_Pos)       /*!< 0x00003F00 */
#define DMA_MASKHALFBLOCK_INT_MASK_WE             DMA_MASKHALFBLOCK_INT_MASK_WE_Msk                 /*!< Interrupt Mask Write Enable */
#define DMA_MASKHALFBLOCK_INT_MASK_WE_0           (0x1UL<<DMA_MASKHALFBLOCK_INT_MASK_WE_Pos)        /*!< 0x00000100 */
#define DMA_MASKHALFBLOCK_INT_MASK_WE_1           (0x2UL<<DMA_MASKHALFBLOCK_INT_MASK_WE_Pos)        /*!< 0x00000200 */
#define DMA_MASKHALFBLOCK_INT_MASK_WE_2           (0x4UL<<DMA_MASKHALFBLOCK_INT_MASK_WE_Pos)        /*!< 0x00000400 */
#define DMA_MASKHALFBLOCK_INT_MASK_WE_3           (0x8UL<<DMA_MASKHALFBLOCK_INT_MASK_WE_Pos)        /*!< 0x00000800 */
#define DMA_MASKHALFBLOCK_INT_MASK_WE_4           (0x10UL<<DMA_MASKHALFBLOCK_INT_MASK_WE_Pos)       /*!< 0x00001000 */
#define DMA_MASKHALFBLOCK_INT_MASK_WE_5           (0x20UL<<DMA_MASKHALFBLOCK_INT_MASK_WE_Pos)       /*!< 0x00002000 */

/********************************* Bit definition for DMA_CLEARHALFBLOCK register ***********************************/
#define DMA_CLEARHALFBLOCK_CLEAR_Pos              (0U)
#define DMA_CLEARHALFBLOCK_CLEAR_Msk              (0x3FUL<<DMA_CLEARHALFBLOCK_CLEAR_Pos)            /*!< 0x0000003F */
#define DMA_CLEARHALFBLOCK_CLEAR                  DMA_CLEARHALFBLOCK_CLEAR_Msk                      /*!< Clear for IntHalfBlock Interrupt */
#define DMA_CLEARHALFBLOCK_CLEAR_0                (0x1UL<<DMA_CLEARHALFBLOCK_CLEAR_Pos)             /*!< 0x00000001 */
#define DMA_CLEARHALFBLOCK_CLEAR_1                (0x2UL<<DMA_CLEARHALFBLOCK_CLEAR_Pos)             /*!< 0x00000002 */
#define DMA_CLEARHALFBLOCK_CLEAR_2                (0x4UL<<DMA_CLEARHALFBLOCK_CLEAR_Pos)             /*!< 0x00000004 */
#define DMA_CLEARHALFBLOCK_CLEAR_3                (0x8UL<<DMA_CLEARHALFBLOCK_CLEAR_Pos)             /*!< 0x00000008 */
#define DMA_CLEARHALFBLOCK_CLEAR_4                (0x10UL<<DMA_CLEARHALFBLOCK_CLEAR_Pos)            /*!< 0x00000010 */
#define DMA_CLEARHALFBLOCK_CLEAR_5                (0x20UL<<DMA_CLEARHALFBLOCK_CLEAR_Pos)            /*!< 0x00000020 */

/********************************* Bit definition for DMA_STATUSTFR register ****************************************/
#define DMA_STATUSTFR_STATUS_Pos                  (0U)
#define DMA_STATUSTFR_STATUS_Msk                  (0x3FUL<<DMA_STATUSTFR_STATUS_Pos)                /*!< 0x0000003F */
#define DMA_STATUSTFR_STATUS                      DMA_STATUSTFR_STATUS_Msk                          /*!< Status for IntTfr Interrupt */
#define DMA_STATUSTFR_STATUS_0                    (0x1UL<<DMA_STATUSTFR_STATUS_Pos)                 /*!< 0x00000001 */
#define DMA_STATUSTFR_STATUS_1                    (0x2UL<<DMA_STATUSTFR_STATUS_Pos)                 /*!< 0x00000002 */
#define DMA_STATUSTFR_STATUS_2                    (0x4UL<<DMA_STATUSTFR_STATUS_Pos)                 /*!< 0x00000004 */
#define DMA_STATUSTFR_STATUS_3                    (0x8UL<<DMA_STATUSTFR_STATUS_Pos)                 /*!< 0x00000008 */
#define DMA_STATUSTFR_STATUS_4                    (0x10UL<<DMA_STATUSTFR_STATUS_Pos)                /*!< 0x00000010 */
#define DMA_STATUSTFR_STATUS_5                    (0x20UL<<DMA_STATUSTFR_STATUS_Pos)                /*!< 0x00000020 */

/********************************* Bit definition for DMA_STATUSBLOCK register **************************************/
#define DMA_STATUSBLOCK_STATUS_Pos                (0U)
#define DMA_STATUSBLOCK_STATUS_Msk                (0x3FUL<<DMA_STATUSBLOCK_STATUS_Pos)              /*!< 0x0000003F */
#define DMA_STATUSBLOCK_STATUS                    DMA_STATUSBLOCK_STATUS_Msk                        /*!< Status for IntBlock Interrupt */
#define DMA_STATUSBLOCK_STATUS_0                  (0x1UL<<DMA_STATUSBLOCK_STATUS_Pos)               /*!< 0x00000001 */
#define DMA_STATUSBLOCK_STATUS_1                  (0x2UL<<DMA_STATUSBLOCK_STATUS_Pos)               /*!< 0x00000002 */
#define DMA_STATUSBLOCK_STATUS_2                  (0x4UL<<DMA_STATUSBLOCK_STATUS_Pos)               /*!< 0x00000004 */
#define DMA_STATUSBLOCK_STATUS_3                  (0x8UL<<DMA_STATUSBLOCK_STATUS_Pos)               /*!< 0x00000008 */
#define DMA_STATUSBLOCK_STATUS_4                  (0x10UL<<DMA_STATUSBLOCK_STATUS_Pos)              /*!< 0x00000010 */
#define DMA_STATUSBLOCK_STATUS_5                  (0x20UL<<DMA_STATUSBLOCK_STATUS_Pos)              /*!< 0x00000020 */

/********************************* Bit definition for DMA_STATUSSRCTRAN register ************************************/
#define DMA_STATUSSRCTRAN_STATUS_Pos              (0U)
#define DMA_STATUSSRCTRAN_STATUS_Msk              (0x3FUL<<DMA_STATUSSRCTRAN_STATUS_Pos)            /*!< 0x0000003F */
#define DMA_STATUSSRCTRAN_STATUS                  DMA_STATUSSRCTRAN_STATUS_Msk                      /*!< Status for IntSrcTran Interrupt */
#define DMA_STATUSSRCTRAN_STATUS_0                (0x1UL<<DMA_STATUSSRCTRAN_STATUS_Pos)             /*!< 0x00000001 */
#define DMA_STATUSSRCTRAN_STATUS_1                (0x2UL<<DMA_STATUSSRCTRAN_STATUS_Pos)             /*!< 0x00000002 */
#define DMA_STATUSSRCTRAN_STATUS_2                (0x4UL<<DMA_STATUSSRCTRAN_STATUS_Pos)             /*!< 0x00000004 */
#define DMA_STATUSSRCTRAN_STATUS_3                (0x8UL<<DMA_STATUSSRCTRAN_STATUS_Pos)             /*!< 0x00000008 */
#define DMA_STATUSSRCTRAN_STATUS_4                (0x10UL<<DMA_STATUSSRCTRAN_STATUS_Pos)            /*!< 0x00000010 */
#define DMA_STATUSSRCTRAN_STATUS_5                (0x20UL<<DMA_STATUSSRCTRAN_STATUS_Pos)            /*!< 0x00000020 */

/********************************* Bit definition for DMA_STATUSDSTTRAN register ************************************/
#define DMA_STATUSDSTTRAN_STATUS_Pos              (0U)
#define DMA_STATUSDSTTRAN_STATUS_Msk              (0x3FUL<<DMA_STATUSDSTTRAN_STATUS_Pos)            /*!< 0x0000003F */
#define DMA_STATUSDSTTRAN_STATUS                  DMA_STATUSDSTTRAN_STATUS_Msk                      /*!< Status for IntDstTran Interrupt */
#define DMA_STATUSDSTTRAN_STATUS_0                (0x1UL<<DMA_STATUSDSTTRAN_STATUS_Pos)             /*!< 0x00000001 */
#define DMA_STATUSDSTTRAN_STATUS_1                (0x2UL<<DMA_STATUSDSTTRAN_STATUS_Pos)             /*!< 0x00000002 */
#define DMA_STATUSDSTTRAN_STATUS_2                (0x4UL<<DMA_STATUSDSTTRAN_STATUS_Pos)             /*!< 0x00000004 */
#define DMA_STATUSDSTTRAN_STATUS_3                (0x8UL<<DMA_STATUSDSTTRAN_STATUS_Pos)             /*!< 0x00000008 */
#define DMA_STATUSDSTTRAN_STATUS_4                (0x10UL<<DMA_STATUSDSTTRAN_STATUS_Pos)            /*!< 0x00000010 */
#define DMA_STATUSDSTTRAN_STATUS_5                (0x20UL<<DMA_STATUSDSTTRAN_STATUS_Pos)            /*!< 0x00000020 */

/********************************* Bit definition for DMA_STATUSERR register ****************************************/
#define DMA_STATUSERR_STATUS_Pos                  (0U)
#define DMA_STATUSERR_STATUS_Msk                  (0x3FUL<<DMA_STATUSERR_STATUS_Pos)                /*!< 0x0000003F */
#define DMA_STATUSERR_STATUS                      DMA_STATUSERR_STATUS_Msk                          /*!< Status for IntErr Interrupt */
#define DMA_STATUSERR_STATUS_0                    (0x1UL<<DMA_STATUSERR_STATUS_Pos)                 /*!< 0x00000001 */
#define DMA_STATUSERR_STATUS_1                    (0x2UL<<DMA_STATUSERR_STATUS_Pos)                 /*!< 0x00000002 */
#define DMA_STATUSERR_STATUS_2                    (0x4UL<<DMA_STATUSERR_STATUS_Pos)                 /*!< 0x00000004 */
#define DMA_STATUSERR_STATUS_3                    (0x8UL<<DMA_STATUSERR_STATUS_Pos)                 /*!< 0x00000008 */
#define DMA_STATUSERR_STATUS_4                    (0x10UL<<DMA_STATUSERR_STATUS_Pos)                /*!< 0x00000010 */
#define DMA_STATUSERR_STATUS_5                    (0x20UL<<DMA_STATUSERR_STATUS_Pos)                /*!< 0x00000020 */

/********************************* Bit definition for DMA_MASKTFR register ******************************************/
#define DMA_MASKTFR_INT_MASK_Pos                  (0U)
#define DMA_MASKTFR_INT_MASK_Msk                  (0x3FUL<<DMA_MASKTFR_INT_MASK_Pos)                /*!< 0x0000003F */
#define DMA_MASKTFR_INT_MASK                      DMA_MASKTFR_INT_MASK_Msk                          /*!< Mask for IntTfr Interrupt */
#define DMA_MASKTFR_INT_MASK_0                    (0x1UL<<DMA_MASKTFR_INT_MASK_Pos)                 /*!< 0x00000001 */
#define DMA_MASKTFR_INT_MASK_1                    (0x2UL<<DMA_MASKTFR_INT_MASK_Pos)                 /*!< 0x00000002 */
#define DMA_MASKTFR_INT_MASK_2                    (0x4UL<<DMA_MASKTFR_INT_MASK_Pos)                 /*!< 0x00000004 */
#define DMA_MASKTFR_INT_MASK_3                    (0x8UL<<DMA_MASKTFR_INT_MASK_Pos)                 /*!< 0x00000008 */
#define DMA_MASKTFR_INT_MASK_4                    (0x10UL<<DMA_MASKTFR_INT_MASK_Pos)                /*!< 0x00000010 */
#define DMA_MASKTFR_INT_MASK_5                    (0x20UL<<DMA_MASKTFR_INT_MASK_Pos)                /*!< 0x00000020 */
#define DMA_MASKTFR_INT_MASK_WE_Pos               (8U)
#define DMA_MASKTFR_INT_MASK_WE_Msk               (0x3FUL<<DMA_MASKTFR_INT_MASK_WE_Pos)             /*!< 0x00003F00 */
#define DMA_MASKTFR_INT_MASK_WE                   DMA_MASKTFR_INT_MASK_WE_Msk                       /*!< Interrupt Mask Write Enable */
#define DMA_MASKTFR_INT_MASK_WE_0                 (0x1UL<<DMA_MASKTFR_INT_MASK_WE_Pos)              /*!< 0x00000100 */
#define DMA_MASKTFR_INT_MASK_WE_1                 (0x2UL<<DMA_MASKTFR_INT_MASK_WE_Pos)              /*!< 0x00000200 */
#define DMA_MASKTFR_INT_MASK_WE_2                 (0x4UL<<DMA_MASKTFR_INT_MASK_WE_Pos)              /*!< 0x00000400 */
#define DMA_MASKTFR_INT_MASK_WE_3                 (0x8UL<<DMA_MASKTFR_INT_MASK_WE_Pos)              /*!< 0x00000800 */
#define DMA_MASKTFR_INT_MASK_WE_4                 (0x10UL<<DMA_MASKTFR_INT_MASK_WE_Pos)             /*!< 0x00001000 */
#define DMA_MASKTFR_INT_MASK_WE_5                 (0x20UL<<DMA_MASKTFR_INT_MASK_WE_Pos)             /*!< 0x00002000 */

