Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xE.h
/********************************************************************************************************************/
/********************************* ETH ******************************************************************************/
/********************************************************************************************************************/
/* Bit definition for Ethernet MAC Control Register register */
#define ETH_MACCR_WD_Pos                       (23U)                           
#define ETH_MACCR_WD_Msk                       (0x1UL << ETH_MACCR_WD_Pos)      /*!< 0x00800000 */
#define ETH_MACCR_WD                           ETH_MACCR_WD_Msk                /* Watchdog disable */
#define ETH_MACCR_JD_Pos                       (22U)                           
#define ETH_MACCR_JD_Msk                       (0x1UL << ETH_MACCR_JD_Pos)      /*!< 0x00400000 */
#define ETH_MACCR_JD                           ETH_MACCR_JD_Msk                /* Jabber disable */
#define ETH_MACCR_IFG_Pos                      (17U)                           
#define ETH_MACCR_IFG_Msk                      (0x7UL << ETH_MACCR_IFG_Pos)     /*!< 0x000E0000 */
#define ETH_MACCR_IFG                          ETH_MACCR_IFG_Msk               /* Inter-frame gap */
#define ETH_MACCR_IFG_96Bit                    0x00000000U                     /* Minimum IFG between frames during transmission is 96Bit */
#define ETH_MACCR_IFG_88Bit                    0x00020000U                     /* Minimum IFG between frames during transmission is 88Bit */
#define ETH_MACCR_IFG_80Bit                    0x00040000U                     /* Minimum IFG between frames during transmission is 80Bit */
#define ETH_MACCR_IFG_72Bit                    0x00060000U                     /* Minimum IFG between frames during transmission is 72Bit */
#define ETH_MACCR_IFG_64Bit                    0x00080000U                     /* Minimum IFG between frames during transmission is 64Bit */        
#define ETH_MACCR_IFG_56Bit                    0x000A0000U                     /* Minimum IFG between frames during transmission is 56Bit */
#define ETH_MACCR_IFG_48Bit                    0x000C0000U                     /* Minimum IFG between frames during transmission is 48Bit */
#define ETH_MACCR_IFG_40Bit                    0x000E0000U                     /* Minimum IFG between frames during transmission is 40Bit */              
#define ETH_MACCR_CSD_Pos                      (16U)                           
#define ETH_MACCR_CSD_Msk                      (0x1UL << ETH_MACCR_CSD_Pos)     /*!< 0x00010000 */
#define ETH_MACCR_CSD                          ETH_MACCR_CSD_Msk               /* Carrier sense disable (during transmission) */
#define ETH_MACCR_FES_Pos                      (14U)                           
#define ETH_MACCR_FES_Msk                      (0x1UL << ETH_MACCR_FES_Pos)     /*!< 0x00004000 */
#define ETH_MACCR_FES                          ETH_MACCR_FES_Msk               /* Fast ethernet speed */
#define ETH_MACCR_ROD_Pos                      (13U)                           
#define ETH_MACCR_ROD_Msk                      (0x1UL << ETH_MACCR_ROD_Pos)     /*!< 0x00002000 */
#define ETH_MACCR_ROD                          ETH_MACCR_ROD_Msk               /* Receive own disable */
#define ETH_MACCR_LM_Pos                       (12U)                           
#define ETH_MACCR_LM_Msk                       (0x1UL << ETH_MACCR_LM_Pos)      /*!< 0x00001000 */
#define ETH_MACCR_LM                           ETH_MACCR_LM_Msk                /* loopback mode */
#define ETH_MACCR_DM_Pos                       (11U)                           
#define ETH_MACCR_DM_Msk                       (0x1UL << ETH_MACCR_DM_Pos)      /*!< 0x00000800 */
#define ETH_MACCR_DM                           ETH_MACCR_DM_Msk                /* Duplex mode */
#define ETH_MACCR_IPCO_Pos                     (10U)                           
#define ETH_MACCR_IPCO_Msk                     (0x1UL << ETH_MACCR_IPCO_Pos)    /*!< 0x00000400 */
#define ETH_MACCR_IPCO                         ETH_MACCR_IPCO_Msk              /* IP Checksum offload */
#define ETH_MACCR_RD_Pos                       (9U)                            
#define ETH_MACCR_RD_Msk                       (0x1UL << ETH_MACCR_RD_Pos)      /*!< 0x00000200 */
#define ETH_MACCR_RD                           ETH_MACCR_RD_Msk                /* Retry disable */
#define ETH_MACCR_APCS_Pos                     (7U)                            
#define ETH_MACCR_APCS_Msk                     (0x1UL << ETH_MACCR_APCS_Pos)    /*!< 0x00000080 */
#define ETH_MACCR_APCS                         ETH_MACCR_APCS_Msk              /* Automatic Pad/CRC stripping */
#define ETH_MACCR_BL_Pos                       (5U)                            
#define ETH_MACCR_BL_Msk                       (0x3UL << ETH_MACCR_BL_Pos)      /*!< 0x00000060 */
#define ETH_MACCR_BL                           ETH_MACCR_BL_Msk                /* Back-off limit: random integer number (r) of slot time delays before rescheduling
                                                       a transmission attempt during retries after a collision: 0 =< r <2^k */
#define ETH_MACCR_BL_10                        0x00000000U                     /* k = min (n, 10) */
#define ETH_MACCR_BL_8                         0x00000020U                     /* k = min (n, 8) */
#define ETH_MACCR_BL_4                         0x00000040U                     /* k = min (n, 4) */
#define ETH_MACCR_BL_1                         0x00000060U                     /* k = min (n, 1) */ 
#define ETH_MACCR_DC_Pos                       (4U)                            
#define ETH_MACCR_DC_Msk                       (0x1UL << ETH_MACCR_DC_Pos)      /*!< 0x00000010 */
#define ETH_MACCR_DC                           ETH_MACCR_DC_Msk                /* Defferal check */
#define ETH_MACCR_TE_Pos                       (3U)                            
#define ETH_MACCR_TE_Msk                       (0x1UL << ETH_MACCR_TE_Pos)      /*!< 0x00000008 */
#define ETH_MACCR_TE                           ETH_MACCR_TE_Msk                /* Transmitter enable */
#define ETH_MACCR_RE_Pos                       (2U)                            
#define ETH_MACCR_RE_Msk                       (0x1UL << ETH_MACCR_RE_Pos)      /*!< 0x00000004 */
#define ETH_MACCR_RE                           ETH_MACCR_RE_Msk                /* Receiver enable */
#define ETH_MACCR_PRELEN_Pos                   (0U)                            
#define ETH_MACCR_PRELEN_Msk                   (0x3UL << ETH_MACCR_PRELEN_Pos)  /*!< 0x00000003 */
#define ETH_MACCR_PRELEN                       ETH_MACCR_PRELEN_Msk            /* Preamble Length for Transmit frames */
#define ETH_MACCR_PRELEN_0                     (0x1UL << ETH_MACCR_PRELEN_Pos)  /*!< 0x00000001 */
#define ETH_MACCR_PRELEN_1                     (0x2UL << ETH_MACCR_PRELEN_Pos)  /*!< 0x00000002 */

