Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xE.h
/* Bit definition for Ethernet MAC Frame Filter Register */
#define ETH_MACFFR_RA_Pos                      (31U)                           
#define ETH_MACFFR_RA_Msk                      (0x1UL << ETH_MACFFR_RA_Pos)     /*!< 0x80000000 */
#define ETH_MACFFR_RA                          ETH_MACFFR_RA_Msk               /* Receive all */ 
#define ETH_MACFFR_VTFE_Pos                    (16U)                           
#define ETH_MACFFR_VTFE_Msk                    (0x1UL << ETH_MACFFR_VTFE_Pos)   /*!< 0x00010000 */
#define ETH_MACFFR_VTFE                        ETH_MACFFR_VTFE_Msk             /* VLAN Tag Filter Enable */ 
#define ETH_MACFFR_HPF_Pos                     (10U)                           
#define ETH_MACFFR_HPF_Msk                     (0x1UL << ETH_MACFFR_HPF_Pos)    /*!< 0x00000400 */
#define ETH_MACFFR_HPF                         ETH_MACFFR_HPF_Msk              /* Hash or perfect filter */ 
#define ETH_MACFFR_SAF_Pos                     (9U)                            
#define ETH_MACFFR_SAF_Msk                     (0x1UL << ETH_MACFFR_SAF_Pos)    /*!< 0x00000200 */
#define ETH_MACFFR_SAF                         ETH_MACFFR_SAF_Msk              /* Source address filter enable */ 
#define ETH_MACFFR_SAIF_Pos                    (8U)                            
#define ETH_MACFFR_SAIF_Msk                    (0x1UL << ETH_MACFFR_SAIF_Pos)   /*!< 0x00000100 */
#define ETH_MACFFR_SAIF                        ETH_MACFFR_SAIF_Msk             /* SA inverse filtering */ 
#define ETH_MACFFR_PCF_Pos                     (6U)                            
#define ETH_MACFFR_PCF_Msk                     (0x3UL << ETH_MACFFR_PCF_Pos)    /*!< 0x000000C0 */
#define ETH_MACFFR_PCF                         ETH_MACFFR_PCF_Msk              /* Pass control frames: 3 cases */
#define ETH_MACFFR_PCF_BlockAll_Pos            (6U)                            
#define ETH_MACFFR_PCF_BlockAll_Msk            (0x1UL << ETH_MACFFR_PCF_BlockAll_Pos) /*!< 0x00000040 */
#define ETH_MACFFR_PCF_BlockAll                ETH_MACFFR_PCF_BlockAll_Msk     /* MAC filters all control frames from reaching the application */
#define ETH_MACFFR_PCF_ForwardAll_Pos          (7U)                            
#define ETH_MACFFR_PCF_ForwardAll_Msk          (0x1UL << ETH_MACFFR_PCF_ForwardAll_Pos) /*!< 0x00000080 */
#define ETH_MACFFR_PCF_ForwardAll              ETH_MACFFR_PCF_ForwardAll_Msk   /* MAC forwards all control frames to application even if they fail the Address Filter */
#define ETH_MACFFR_PCF_ForwardPassedAddrFilter_Pos (6U)                        
#define ETH_MACFFR_PCF_ForwardPassedAddrFilter_Msk (0x3UL << ETH_MACFFR_PCF_ForwardPassedAddrFilter_Pos) /*!< 0x000000C0 */
#define ETH_MACFFR_PCF_ForwardPassedAddrFilter ETH_MACFFR_PCF_ForwardPassedAddrFilter_Msk /* MAC forwards control frames that pass the Address Filter. */ 
#define ETH_MACFFR_BFD_Pos                     (5U)                            
#define ETH_MACFFR_BFD_Msk                     (0x1UL << ETH_MACFFR_BFD_Pos)    /*!< 0x00000020 */
#define ETH_MACFFR_BFD                         ETH_MACFFR_BFD_Msk              /* Broadcast frame disable */ 
#define ETH_MACFFR_PAM_Pos                     (4U)                            
#define ETH_MACFFR_PAM_Msk                     (0x1UL << ETH_MACFFR_PAM_Pos)    /*!< 0x00000010 */
#define ETH_MACFFR_PAM                         ETH_MACFFR_PAM_Msk              /* Pass all mutlicast */ 
#define ETH_MACFFR_DAIF_Pos                    (3U)                            
#define ETH_MACFFR_DAIF_Msk                    (0x1UL << ETH_MACFFR_DAIF_Pos)   /*!< 0x00000008 */
#define ETH_MACFFR_DAIF                        ETH_MACFFR_DAIF_Msk             /* DA Inverse filtering */ 
#define ETH_MACFFR_HM_Pos                      (2U)                            
#define ETH_MACFFR_HM_Msk                      (0x1UL << ETH_MACFFR_HM_Pos)     /*!< 0x00000004 */
#define ETH_MACFFR_HM                          ETH_MACFFR_HM_Msk               /* Hash multicast */ 
#define ETH_MACFFR_HU_Pos                      (1U)                            
#define ETH_MACFFR_HU_Msk                      (0x1UL << ETH_MACFFR_HU_Pos)     /*!< 0x00000002 */
#define ETH_MACFFR_HU                          ETH_MACFFR_HU_Msk               /* Hash unicast */
#define ETH_MACFFR_PM_Pos                      (0U)                            
#define ETH_MACFFR_PM_Msk                      (0x1UL << ETH_MACFFR_PM_Pos)     /*!< 0x00000001 */
#define ETH_MACFFR_PM                          ETH_MACFFR_PM_Msk               /* Promiscuous mode */

/* Bit definition for Ethernet MAC Hash Table High Register */
#define ETH_MACHTHR_HTH_Pos                    (0U)                            
#define ETH_MACHTHR_HTH_Msk                    (0xFFFFFFFFUL << ETH_MACHTHR_HTH_Pos) /*!< 0xFFFFFFFF */
#define ETH_MACHTHR_HTH                        ETH_MACHTHR_HTH_Msk             /* Hash table high */

/* Bit definition for Ethernet MAC Hash Table Low Register */
#define ETH_MACHTLR_HTL_Pos                    (0U)                            
#define ETH_MACHTLR_HTL_Msk                    (0xFFFFFFFFUL << ETH_MACHTLR_HTL_Pos) /*!< 0xFFFFFFFF */
#define ETH_MACHTLR_HTL                        ETH_MACHTLR_HTL_Msk             /* Hash table low */

/* Bit definition for Ethernet MAC MII Address Register */
#define ETH_MACMIIAR_PA_Pos                    (11U)                           
#define ETH_MACMIIAR_PA_Msk                    (0x1FUL << ETH_MACMIIAR_PA_Pos)  /*!< 0x0000F800 */
#define ETH_MACMIIAR_PA                        ETH_MACMIIAR_PA_Msk             /* Physical layer address */ 
#define ETH_MACMIIAR_MR_Pos                    (6U)                            
#define ETH_MACMIIAR_MR_Msk                    (0x1FUL << ETH_MACMIIAR_MR_Pos)  /*!< 0x000007C0 */
#define ETH_MACMIIAR_MR                        ETH_MACMIIAR_MR_Msk             /* MII register in the selected PHY */ 
#define ETH_MACMIIAR_CR_Pos                    (2U)                            
#define ETH_MACMIIAR_CR_Msk                    (0xFUL << ETH_MACMIIAR_CR_Pos)   /*!< 0x0000003C */
#define ETH_MACMIIAR_CR                        ETH_MACMIIAR_CR_Msk             /* CR clock range: 14 cases */
#define ETH_MACMIIAR_CR_0                      (0x1UL << ETH_MACMIIAR_CR_Pos)   /*!< 0x00000004 */
#define ETH_MACMIIAR_CR_1                      (0x2UL << ETH_MACMIIAR_CR_Pos)   /*!< 0x00000008 */
#define ETH_MACMIIAR_CR_2                      (0x4UL << ETH_MACMIIAR_CR_Pos)   /*!< 0x00000010 */
#define ETH_MACMIIAR_CR_3                      (0x8UL << ETH_MACMIIAR_CR_Pos)   /*!< 0x00000020 */ 

#define ETH_MACMIIAR_CR_DIV42                  0x00000000U                     /* HCLK:60-100 MHz; MDC clock= HCLK/42 */
#define ETH_MACMIIAR_CR_DIV62_Pos              (2U)
#define ETH_MACMIIAR_CR_DIV62_Msk              (0x1UL << ETH_MACMIIAR_CR_DIV62_Pos) /*!< 0x00000004 */
#define ETH_MACMIIAR_CR_DIV62                  ETH_MACMIIAR_CR_DIV62_Msk       /* HCLK:100-150 MHz; MDC clock= HCLK/62 */
#define ETH_MACMIIAR_CR_DIV16_Pos              (3U)                            
#define ETH_MACMIIAR_CR_DIV16_Msk              (0x1UL << ETH_MACMIIAR_CR_DIV16_Pos) /*!< 0x00000008 */
#define ETH_MACMIIAR_CR_DIV16                  ETH_MACMIIAR_CR_DIV16_Msk       /* HCLK:20-35 MHz; MDC clock= HCLK/16 */
#define ETH_MACMIIAR_CR_DIV26_Pos              (2U)                            
#define ETH_MACMIIAR_CR_DIV26_Msk              (0x3UL << ETH_MACMIIAR_CR_DIV26_Pos) /*!< 0x0000000C */
#define ETH_MACMIIAR_CR_DIV26                  ETH_MACMIIAR_CR_DIV26_Msk       /* HCLK:35-60 MHz; MDC clock= HCLK/26 */
#define ETH_MACMIIAR_CR_DIV102_Pos             (4U)
#define ETH_MACMIIAR_CR_DIV102_Msk             (0x1UL << ETH_MACMIIAR_CR_DIV102_Pos) /*!< 0x00000010 */
#define ETH_MACMIIAR_CR_DIV102                 ETH_MACMIIAR_CR_DIV102_Msk       /* HCLK:150-250 MHz; MDC clock= HCLK/102 */
#define ETH_MACMIIAR_CR_DIV104_Pos             (2U)
#define ETH_MACMIIAR_CR_DIV104_Msk             (0x5UL << ETH_MACMIIAR_CR_DIV104_Pos) /*!< 0x00000014 */
#define ETH_MACMIIAR_CR_DIV104                 ETH_MACMIIAR_CR_DIV104_Msk       /* HCLK:250-300 MHz; MDC clock= HCLK/104 */
#define ETH_MACMIIAR_CR_DIV4                   ETH_MACMIIAR_CR_3                                                                   /* MDC clock= HCLK/4  */
#define ETH_MACMIIAR_CR_DIV6                   (ETH_MACMIIAR_CR_3|ETH_MACMIIAR_CR_0)                                               /* MDC clock= HCLK/6  */
#define ETH_MACMIIAR_CR_DIV8                   (ETH_MACMIIAR_CR_3|ETH_MACMIIAR_CR_1)                                               /* MDC clock= HCLK/8  */
#define ETH_MACMIIAR_CR_DIV10                  (ETH_MACMIIAR_CR_3|ETH_MACMIIAR_CR_1|ETH_MACMIIAR_CR_0)                             /* MDC clock= HCLK/10 */
#define ETH_MACMIIAR_CR_DIV12                  (ETH_MACMIIAR_CR_3|ETH_MACMIIAR_CR_2)                                               /* MDC clock= HCLK/12 */
#define ETH_MACMIIAR_CR_DIV14                  (ETH_MACMIIAR_CR_3|ETH_MACMIIAR_CR_2|ETH_MACMIIAR_CR_0)                             /* MDC clock= HCLK/14 */
//#define ETH_MACMIIAR_CR_DIV16                  (ETH_MACMIIAR_CR_3|ETH_MACMIIAR_CR_2|ETH_MACMIIAR_CR_1)                             /* MDC clock= HCLK/16 */
#define ETH_MACMIIAR_CR_DIV18                  (ETH_MACMIIAR_CR_3|ETH_MACMIIAR_CR_2|ETH_MACMIIAR_CR_1|ETH_MACMIIAR_CR_0)           /* MDC clock= HCLK/18 */

