Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xE.h
/********************************* Bit definition for ESMC_RXSTAT register ******************************************/
#define ESMC_RXSTAT_RXSTAT_Pos                    (0U)
#define ESMC_RXSTAT_RXSTAT_Msk                    (0xFFUL<<ESMC_RXSTAT_RXSTAT_Pos)                  /*!< 0x000000FF */
#define ESMC_RXSTAT_RXSTAT                        ESMC_RXSTAT_RXSTAT_Msk                            /*!< rx state */

/********************************* Bit definition for ESMC_IFR1 register ********************************************/
#define ESMC_IFR1_CMDIF_Pos                       (0U)
#define ESMC_IFR1_CMDIF_Msk                       (0x1UL<<ESMC_IFR1_CMDIF_Pos)                      /*!< 0x00000001 */
#define ESMC_IFR1_CMDIF                           ESMC_IFR1_CMDIF_Msk                               /*!< command done  interrupt flag */
#define ESMC_IFR1_RXFIFONEIF_Pos                  (1U)
#define ESMC_IFR1_RXFIFONEIF_Msk                  (0x1UL<<ESMC_IFR1_RXFIFONEIF_Pos)                 /*!< 0x00000002 */
#define ESMC_IFR1_RXFIFONEIF                      ESMC_IFR1_RXFIFONEIF_Msk                          /*!< rxfifo not empty  interrupt flag */
#define ESMC_IFR1_RXFIFOHFIF_Pos                  (2U)
#define ESMC_IFR1_RXFIFOHFIF_Msk                  (0x1UL<<ESMC_IFR1_RXFIFOHFIF_Pos)                 /*!< 0x00000004 */
#define ESMC_IFR1_RXFIFOHFIF                      ESMC_IFR1_RXFIFOHFIF_Msk                          /*!< rxfifo half full  interrupt flag */
#define ESMC_IFR1_RXFIFOFIF_Pos                   (3U)
#define ESMC_IFR1_RXFIFOFIF_Msk                   (0x1UL<<ESMC_IFR1_RXFIFOFIF_Pos)                  /*!< 0x00000008 */
#define ESMC_IFR1_RXFIFOFIF                       ESMC_IFR1_RXFIFOFIF_Msk                           /*!< rxfifo full  interrupt flag */
#define ESMC_IFR1_IDLEDONEIF_Pos                  (4U)
#define ESMC_IFR1_IDLEDONEIF_Msk                  (0x1UL<<ESMC_IFR1_IDLEDONEIF_Pos)                 /*!< 0x00000010 */
#define ESMC_IFR1_IDLEDONEIF                      ESMC_IFR1_IDLEDONEIF_Msk                          /*!< idle  interrupt flag */
#define ESMC_IFR1_DATAWAITIF_Pos                  (5U)
#define ESMC_IFR1_DATAWAITIF_Msk                  (0x1UL<<ESMC_IFR1_DATAWAITIF_Pos)                 /*!< 0x00000020 */
#define ESMC_IFR1_DATAWAITIF                      ESMC_IFR1_DATAWAITIF_Msk                          /*!< data wait  interrupt flag */
#define ESMC_IFR1_RXFIFOWIF_Pos                   (6U)
#define ESMC_IFR1_RXFIFOWIF_Msk                   (0x1UL<<ESMC_IFR1_RXFIFOWIF_Pos)                  /*!< 0x00000040 */
#define ESMC_IFR1_RXFIFOWIF                       ESMC_IFR1_RXFIFOWIF_Msk                           /*!< rx fifo word  interrupt flag */
#define ESMC_IFR1_ADDRDONEIF_Pos                  (7U)
#define ESMC_IFR1_ADDRDONEIF_Msk                  (0x1UL<<ESMC_IFR1_ADDRDONEIF_Pos)                 /*!< 0x00000080 */
#define ESMC_IFR1_ADDRDONEIF                      ESMC_IFR1_ADDRDONEIF_Msk                          /*!< address done interrupt flag */

/********************************* Bit definition for ESMC_IER1 register ********************************************/
#define ESMC_IER1_CMDIE_Pos                       (0U)
#define ESMC_IER1_CMDIE_Msk                       (0x1UL<<ESMC_IER1_CMDIE_Pos)                      /*!< 0x00000001 */
#define ESMC_IER1_CMDIE                           ESMC_IER1_CMDIE_Msk                               /*!< command done interrupt enable */
#define ESMC_IER1_RXFIFONEIE_Pos                  (1U)
#define ESMC_IER1_RXFIFONEIE_Msk                  (0x1UL<<ESMC_IER1_RXFIFONEIE_Pos)                 /*!< 0x00000002 */
#define ESMC_IER1_RXFIFONEIE                      ESMC_IER1_RXFIFONEIE_Msk                          /*!< rx fifo not empty interrupt enable */
#define ESMC_IER1_RXFIFOHFIE_Pos                  (2U)
#define ESMC_IER1_RXFIFOHFIE_Msk                  (0x1UL<<ESMC_IER1_RXFIFOHFIE_Pos)                 /*!< 0x00000004 */
#define ESMC_IER1_RXFIFOHFIE                      ESMC_IER1_RXFIFOHFIE_Msk                          /*!< rx fifo half interrupt enable */
#define ESMC_IER1_RXFIFOFIE_Pos                   (3U)
#define ESMC_IER1_RXFIFOFIE_Msk                   (0x1UL<<ESMC_IER1_RXFIFOFIE_Pos)                  /*!< 0x00000008 */
#define ESMC_IER1_RXFIFOFIE                       ESMC_IER1_RXFIFOFIE_Msk                           /*!< rx fifo full interrupt enable */
#define ESMC_IER1_IDLEDONEIE_Pos                  (4U)
#define ESMC_IER1_IDLEDONEIE_Msk                  (0x1UL<<ESMC_IER1_IDLEDONEIE_Pos)                 /*!< 0x00000010 */
#define ESMC_IER1_IDLEDONEIE                      ESMC_IER1_IDLEDONEIE_Msk                          /*!< idle interrupt enable */
#define ESMC_IER1_DATAWAITIE_Pos                  (5U)
#define ESMC_IER1_DATAWAITIE_Msk                  (0x1UL<<ESMC_IER1_DATAWAITIE_Pos)                 /*!< 0x00000020 */
#define ESMC_IER1_DATAWAITIE                      ESMC_IER1_DATAWAITIE_Msk                          /*!< busy interrupt enable */
#define ESMC_IER1_RXFIFOWIE_Pos                   (6U)
#define ESMC_IER1_RXFIFOWIE_Msk                   (0x1UL<<ESMC_IER1_RXFIFOWIE_Pos)                  /*!< 0x00000040 */
#define ESMC_IER1_RXFIFOWIE                       ESMC_IER1_RXFIFOWIE_Msk                           /*!< rx fifo word  interrupt enable */
#define ESMC_IER1_ADDRDONEIE_Pos                  (7U)
#define ESMC_IER1_ADDRDONEIE_Msk                  (0x1UL<<ESMC_IER1_ADDRDONEIE_Pos)                 /*!< 0x00000080 */
#define ESMC_IER1_ADDRDONEIE                      ESMC_IER1_ADDRDONEIE_Msk                          /*!< address done  interrupt enable */

/********************************* Bit definition for ESMC_IFR2 register ********************************************/
#define ESMC_IFR2_XIPRDINSTRSETIF_Pos             (0U)
#define ESMC_IFR2_XIPRDINSTRSETIF_Msk             (0x1UL<<ESMC_IFR2_XIPRDINSTRSETIF_Pos)            /*!< 0x00000001 */
#define ESMC_IFR2_XIPRDINSTRSETIF                 ESMC_IFR2_XIPRDINSTRSETIF_Msk                     /*!< xip read  instr set interrupt flag */
#define ESMC_IFR2_TXFIFOEIF_Pos                   (1U)
#define ESMC_IFR2_TXFIFOEIF_Msk                   (0x1UL<<ESMC_IFR2_TXFIFOEIF_Pos)                  /*!< 0x00000002 */
#define ESMC_IFR2_TXFIFOEIF                       ESMC_IFR2_TXFIFOEIF_Msk                           /*!< tx fifo empty  interrupt flag */
#define ESMC_IFR2_TXFIFOHEIF_Pos                  (2U)
#define ESMC_IFR2_TXFIFOHEIF_Msk                  (0x1UL<<ESMC_IFR2_TXFIFOHEIF_Pos)                 /*!< 0x00000004 */
#define ESMC_IFR2_TXFIFOHEIF                      ESMC_IFR2_TXFIFOHEIF_Msk                          /*!< tx fifo half empty interrupt flag */
#define ESMC_IFR2_TXFIFOFIF_Pos                   (3U)
#define ESMC_IFR2_TXFIFOFIF_Msk                   (0x1UL<<ESMC_IFR2_TXFIFOFIF_Pos)                  /*!< 0x00000008 */
#define ESMC_IFR2_TXFIFOFIF                       ESMC_IFR2_TXFIFOFIF_Msk                           /*!< tx fifo full interrupt flag */
#define ESMC_IFR2_TXFIFOOVIF_Pos                  (4U)
#define ESMC_IFR2_TXFIFOOVIF_Msk                  (0x1UL<<ESMC_IFR2_TXFIFOOVIF_Pos)                 /*!< 0x00000010 */
#define ESMC_IFR2_TXFIFOOVIF                      ESMC_IFR2_TXFIFOOVIF_Msk                          /*!< tx fifo overflow interrupt flag */
#define ESMC_IFR2_TXWORDOVIF_Pos                  (5U)
#define ESMC_IFR2_TXWORDOVIF_Msk                  (0x1UL<<ESMC_IFR2_TXWORDOVIF_Pos)                 /*!< 0x00000020 */
#define ESMC_IFR2_TXWORDOVIF                      ESMC_IFR2_TXWORDOVIF_Msk                          /*!< txfifo word interrupt flag */
#define ESMC_IFR2_XIPWEINSTRSETIF_Pos             (6U)
#define ESMC_IFR2_XIPWEINSTRSETIF_Msk             (0x1UL<<ESMC_IFR2_XIPWEINSTRSETIF_Pos)            /*!< 0x00000040 */
#define ESMC_IFR2_XIPWEINSTRSETIF                 ESMC_IFR2_XIPWEINSTRSETIF_Msk                     /*!< xip write instr set interrupt flag */
#define ESMC_IFR2_RXTOUTIF_Pos                    (7U)
#define ESMC_IFR2_RXTOUTIF_Msk                    (0x1UL<<ESMC_IFR2_RXTOUTIF_Pos)                   /*!< 0x00000080 */
#define ESMC_IFR2_RXTOUTIF                        ESMC_IFR2_RXTOUTIF_Msk                            /*!< rx timeout interrupt flag */

