Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xE.h
/********************************* Bit definition for RCC_APB2RSTR register *****************************************/
#define RCC_APB2RSTR_SYSCFGRST_Pos                (0U)
#define RCC_APB2RSTR_SYSCFGRST_Msk                (0x1UL<<RCC_APB2RSTR_SYSCFGRST_Pos)               /*!< 0x00000001 */
#define RCC_APB2RSTR_SYSCFGRST                    RCC_APB2RSTR_SYSCFGRST_Msk                        
#define RCC_APB2RSTR_ADC1RST_Pos                  (9U)
#define RCC_APB2RSTR_ADC1RST_Msk                  (0x1UL<<RCC_APB2RSTR_ADC1RST_Pos)                 /*!< 0x00000200 */
#define RCC_APB2RSTR_ADC1RST                      RCC_APB2RSTR_ADC1RST_Msk                          
#define RCC_APB2RSTR_ADC2RST_Pos                  (10U)
#define RCC_APB2RSTR_ADC2RST_Msk                  (0x1UL<<RCC_APB2RSTR_ADC2RST_Pos)                 /*!< 0x00000400 */
#define RCC_APB2RSTR_ADC2RST                      RCC_APB2RSTR_ADC2RST_Msk                          
#define RCC_APB2RSTR_TIM1RST_Pos                  (11U)
#define RCC_APB2RSTR_TIM1RST_Msk                  (0x1UL<<RCC_APB2RSTR_TIM1RST_Pos)                 /*!< 0x00000800 */
#define RCC_APB2RSTR_TIM1RST                      RCC_APB2RSTR_TIM1RST_Msk                          
#define RCC_APB2RSTR_SPI1RST_Pos                  (12U)
#define RCC_APB2RSTR_SPI1RST_Msk                  (0x1UL<<RCC_APB2RSTR_SPI1RST_Pos)                 /*!< 0x00001000 */
#define RCC_APB2RSTR_SPI1RST                      RCC_APB2RSTR_SPI1RST_Msk                          
#define RCC_APB2RSTR_TIM8RST_Pos                  (13U)
#define RCC_APB2RSTR_TIM8RST_Msk                  (0x1UL<<RCC_APB2RSTR_TIM8RST_Pos)                 /*!< 0x00002000 */
#define RCC_APB2RSTR_TIM8RST                      RCC_APB2RSTR_TIM8RST_Msk                          
#define RCC_APB2RSTR_USART1RST_Pos                (14U)
#define RCC_APB2RSTR_USART1RST_Msk                (0x1UL<<RCC_APB2RSTR_USART1RST_Pos)               /*!< 0x00004000 */
#define RCC_APB2RSTR_USART1RST                    RCC_APB2RSTR_USART1RST_Msk                        
#define RCC_APB2RSTR_ADC3RST_Pos                  (15U)
#define RCC_APB2RSTR_ADC3RST_Msk                  (0x1UL<<RCC_APB2RSTR_ADC3RST_Pos)                 /*!< 0x00008000 */
#define RCC_APB2RSTR_ADC3RST                      RCC_APB2RSTR_ADC3RST_Msk                          
#define RCC_APB2RSTR_TIM9RST_Pos                  (19U)
#define RCC_APB2RSTR_TIM9RST_Msk                  (0x1UL<<RCC_APB2RSTR_TIM9RST_Pos)                 /*!< 0x00080000 */
#define RCC_APB2RSTR_TIM9RST                      RCC_APB2RSTR_TIM9RST_Msk                          
#define RCC_APB2RSTR_TIM10RST_Pos                 (20U)
#define RCC_APB2RSTR_TIM10RST_Msk                 (0x1UL<<RCC_APB2RSTR_TIM10RST_Pos)                /*!< 0x00100000 */
#define RCC_APB2RSTR_TIM10RST                     RCC_APB2RSTR_TIM10RST_Msk                         
#define RCC_APB2RSTR_TIM11RST_Pos                 (21U)
#define RCC_APB2RSTR_TIM11RST_Msk                 (0x1UL<<RCC_APB2RSTR_TIM11RST_Pos)                /*!< 0x00200000 */
#define RCC_APB2RSTR_TIM11RST                     RCC_APB2RSTR_TIM11RST_Msk                         
#define RCC_APB2RSTR_TIM15RST_Pos                 (22U)
#define RCC_APB2RSTR_TIM15RST_Msk                 (0x1UL<<RCC_APB2RSTR_TIM15RST_Pos)                /*!< 0x00400000 */
#define RCC_APB2RSTR_TIM15RST                     RCC_APB2RSTR_TIM15RST_Msk                         
#define RCC_APB2RSTR_TIM16RST_Pos                 (23U)
#define RCC_APB2RSTR_TIM16RST_Msk                 (0x1UL<<RCC_APB2RSTR_TIM16RST_Pos)                /*!< 0x00800000 */
#define RCC_APB2RSTR_TIM16RST                     RCC_APB2RSTR_TIM16RST_Msk                         
#define RCC_APB2RSTR_TIM17RST_Pos                 (24U)
#define RCC_APB2RSTR_TIM17RST_Msk                 (0x1UL<<RCC_APB2RSTR_TIM17RST_Pos)                /*!< 0x01000000 */
#define RCC_APB2RSTR_TIM17RST                     RCC_APB2RSTR_TIM17RST_Msk                         
#define RCC_APB2RSTR_TIM19RST_Pos                 (25U)
#define RCC_APB2RSTR_TIM19RST_Msk                 (0x1UL<<RCC_APB2RSTR_TIM19RST_Pos)                /*!< 0x02000000 */
#define RCC_APB2RSTR_TIM19RST                     RCC_APB2RSTR_TIM19RST_Msk                         
#define RCC_APB2RSTR_RNGRST_Pos                   (26U)
#define RCC_APB2RSTR_RNGRST_Msk                   (0x1UL<<RCC_APB2RSTR_RNGRST_Pos)                  /*!< 0x04000000 */
#define RCC_APB2RSTR_RNGRST                       RCC_APB2RSTR_RNGRST_Msk                           
#define RCC_APB2RSTR_COMPRST_Pos                  (27U)
#define RCC_APB2RSTR_COMPRST_Msk                  (0x1UL<<RCC_APB2RSTR_COMPRST_Pos)                 /*!< 0x08000000 */
#define RCC_APB2RSTR_COMPRST                      RCC_APB2RSTR_COMPRST_Msk                          
#define RCC_APB2RSTR_OPARST_Pos                   (28U)
#define RCC_APB2RSTR_OPARST_Msk                   (0x1UL<<RCC_APB2RSTR_OPARST_Pos)                /*!< 0x10000000 */
#define RCC_APB2RSTR_OPARST                       RCC_APB2RSTR_OPARST_Msk                         
#define RCC_APB2RSTR_LCDCRST_Pos                  (29U)
#define RCC_APB2RSTR_LCDCRST_Msk                  (0x1UL<<RCC_APB2RSTR_LCDCRST_Pos)                 /*!< 0x20000000 */
#define RCC_APB2RSTR_LCDCRST                      RCC_APB2RSTR_LCDCRST_Msk                          

/********************************* Bit definition for RCC_AHB1ENR register ******************************************/
#define RCC_AHB1ENR_DMA1EN_Pos                    (0U)
#define RCC_AHB1ENR_DMA1EN_Msk                    (0x1UL<<RCC_AHB1ENR_DMA1EN_Pos)                   /*!< 0x00000001 */
#define RCC_AHB1ENR_DMA1EN                        RCC_AHB1ENR_DMA1EN_Msk                            
#define RCC_AHB1ENR_DMA2EN_Pos                    (1U)
#define RCC_AHB1ENR_DMA2EN_Msk                    (0x1UL<<RCC_AHB1ENR_DMA2EN_Pos)                   /*!< 0x00000002 */
#define RCC_AHB1ENR_DMA2EN                        RCC_AHB1ENR_DMA2EN_Msk                            
#define RCC_AHB1ENR_SRAMEN_Pos                    (2U)
#define RCC_AHB1ENR_SRAMEN_Msk                    (0x1UL<<RCC_AHB1ENR_SRAMEN_Pos)                   /*!< 0x00000004 */
#define RCC_AHB1ENR_SRAMEN                        RCC_AHB1ENR_SRAMEN_Msk                            
#define RCC_AHB1ENR_FMCEN_Pos                     (4U)
#define RCC_AHB1ENR_FMCEN_Msk                     (0x1UL<<RCC_AHB1ENR_FMCEN_Pos)                    /*!< 0x00000010 */
#define RCC_AHB1ENR_FMCEN                         RCC_AHB1ENR_FMCEN_Msk                             
#define RCC_AHB1ENR_CORDICEN_Pos                  (5U)
#define RCC_AHB1ENR_CORDICEN_Msk                  (0x1UL<<RCC_AHB1ENR_CORDICEN_Pos)                 /*!< 0x00000020 */
#define RCC_AHB1ENR_CORDICEN                      RCC_AHB1ENR_CORDICEN_Msk                          
#define RCC_AHB1ENR_CRCEN_Pos                     (6U)
#define RCC_AHB1ENR_CRCEN_Msk                     (0x1UL<<RCC_AHB1ENR_CRCEN_Pos)                    /*!< 0x00000040 */
#define RCC_AHB1ENR_CRCEN                         RCC_AHB1ENR_CRCEN_Msk                             
#define RCC_AHB1ENR_ESMCEN_Pos                    (12U)
#define RCC_AHB1ENR_ESMCEN_Msk                    (0x1UL<<RCC_AHB1ENR_ESMCEN_Pos)                   /*!< 0x00001000 */
#define RCC_AHB1ENR_ESMCEN                        RCC_AHB1ENR_ESMCEN_Msk                            

