Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xE.h
/********************************* Bit definition for RCC_CFGR3 register ********************************************/
#define RCC_CFGR3_PLLSRC_Pos                      (0U)
#define RCC_CFGR3_PLLSRC_Msk                      (0x1UL<<RCC_CFGR3_PLLSRC_Pos)                     /*!< 0x00000001 */
#define RCC_CFGR3_PLLSRC                          RCC_CFGR3_PLLSRC_Msk                              
#define RCC_CFGR3_PLLXTPRE_Pos                    (1U)
#define RCC_CFGR3_PLLXTPRE_Msk                    (0x1UL<<RCC_CFGR3_PLLXTPRE_Pos)                   /*!< 0x00000002 */
#define RCC_CFGR3_PLLXTPRE                        RCC_CFGR3_PLLXTPRE_Msk                            
#define RCC_CFGR3_PLLPREDIV_Pos                   (2U)
#define RCC_CFGR3_PLLPREDIV_Msk                   (0x3UL<<RCC_CFGR3_PLLPREDIV_Pos)                  /*!< 0x0000000C */
#define RCC_CFGR3_PLLPREDIV                       RCC_CFGR3_PLLPREDIV_Msk
#define RCC_CFGR3_PLLPREDIV_0                     (0x1UL<<RCC_CFGR3_PLLPREDIV_Pos)                  /*!< 0x00000004 */
#define RCC_CFGR3_PLLPREDIV_1                     (0x2UL<<RCC_CFGR3_PLLPREDIV_Pos)                  /*!< 0x00000008 */

#define RCC_CFGR3_PLLPREDIV1                      0x00000000U
#define RCC_CFGR3_PLLPREDIV2                      0x00000004U
#define RCC_CFGR3_PLLPREDIV4                      0x00000008U
#define RCC_CFGR3_PLLPREDIV8                      0x0000000CU

#define RCC_CFGR3_PLLPOSTDIV_Pos                  (4U)
#define RCC_CFGR3_PLLPOSTDIV_Msk                  (0x3UL<<RCC_CFGR3_PLLPOSTDIV_Pos)                 /*!< 0x00000030 */
#define RCC_CFGR3_PLLPOSTDIV                      RCC_CFGR3_PLLPOSTDIV_Msk
#define RCC_CFGR3_PLLPOSTDIV_0                    (0x1UL<<RCC_CFGR3_PLLPOSTDIV_Pos)                 /*!< 0x00000010 */
#define RCC_CFGR3_PLLPOSTDIV_1                    (0x2UL<<RCC_CFGR3_PLLPOSTDIV_Pos)                 /*!< 0x00000020 */

#define RCC_CFGR3_PLLPOSTDIV1                     0x00000000U
#define RCC_CFGR3_PLLPOSTDIV2                     0x00000010U
#define RCC_CFGR3_PLLPOSTDIV4                     0x00000020U
#define RCC_CFGR3_PLLPOSTDIV8                     0x00000030U

#define RCC_CFGR3_PLLFBDIV_Pos                    (8U)
#define RCC_CFGR3_PLLFBDIV_Msk                    (0xFFUL<<RCC_CFGR3_PLLFBDIV_Pos)                  /*!< 0x0000FF00 */
#define RCC_CFGR3_PLLFBDIV                        RCC_CFGR3_PLLFBDIV_Msk

/********************************************************************************************************************/
/********************************* RTC ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for RTC_CRH register **********************************************/
#define RTC_CRH_SECIE_Pos                         (0U)
#define RTC_CRH_SECIE_Msk                         (0x1UL<<RTC_CRH_SECIE_Pos)                        /*!< 0x00000001 */
#define RTC_CRH_SECIE                             RTC_CRH_SECIE_Msk                                 /*!< Second interrupt enable */
#define RTC_CRH_ALRIE_Pos                         (1U)
#define RTC_CRH_ALRIE_Msk                         (0x1UL<<RTC_CRH_ALRIE_Pos)                        /*!< 0x00000002 */
#define RTC_CRH_ALRIE                             RTC_CRH_ALRIE_Msk                                 /*!< Alarm interrupt enable */
#define RTC_CRH_OWIE_Pos                          (2U)
#define RTC_CRH_OWIE_Msk                          (0x1UL<<RTC_CRH_OWIE_Pos)                         /*!< 0x00000004 */
#define RTC_CRH_OWIE                              RTC_CRH_OWIE_Msk                                  /*!< Overflow interrupt enable */

/********************************* Bit definition for RTC_CRL register **********************************************/
#define RTC_CRL_SECF_Pos                          (0U)
#define RTC_CRL_SECF_Msk                          (0x1UL<<RTC_CRL_SECF_Pos)                         /*!< 0x00000001 */
#define RTC_CRL_SECF                              RTC_CRL_SECF_Msk                                  /*!< Second flag */
#define RTC_CRL_ALRF_Pos                          (1U)
#define RTC_CRL_ALRF_Msk                          (0x1UL<<RTC_CRL_ALRF_Pos)                         /*!< 0x00000002 */
#define RTC_CRL_ALRF                              RTC_CRL_ALRF_Msk                                  /*!< Alarm flag */
#define RTC_CRL_OWF_Pos                           (2U)
#define RTC_CRL_OWF_Msk                           (0x1UL<<RTC_CRL_OWF_Pos)                          /*!< 0x00000004 */
#define RTC_CRL_OWF                               RTC_CRL_OWF_Msk                                   /*!< Overflow flag */
#define RTC_CRL_RSF_Pos                           (3U)
#define RTC_CRL_RSF_Msk                           (0x1UL<<RTC_CRL_RSF_Pos)                          /*!< 0x00000008 */
#define RTC_CRL_RSF                               RTC_CRL_RSF_Msk                                   /*!< Registers synchronized flag */
#define RTC_CRL_CNF_Pos                           (4U)
#define RTC_CRL_CNF_Msk                           (0x1UL<<RTC_CRL_CNF_Pos)                          /*!< 0x00000010 */
#define RTC_CRL_CNF                               RTC_CRL_CNF_Msk                                   /*!< Configuration flag */
#define RTC_CRL_RTOFF_Pos                         (5U)
#define RTC_CRL_RTOFF_Msk                         (0x1UL<<RTC_CRL_RTOFF_Pos)                        /*!< 0x00000020 */
#define RTC_CRL_RTOFF                             RTC_CRL_RTOFF_Msk                                 /*!< RTC operation OFF */

/********************************* Bit definition for RTC_PRLH register *********************************************/
#define RTC_PRLH_PRL_Pos                          (0U)
#define RTC_PRLH_PRL_Msk                          (0xFUL<<RTC_PRLH_PRL_Pos)                         /*!< 0x0000000F */
#define RTC_PRLH_PRL                              RTC_PRLH_PRL_Msk                                  /*!< RTC pre-scaler reload value high part */
#define RTC_PRLH_PRL_0                            (0x1UL<<RTC_PRLH_PRL_Pos)                         /*!< 0x00000001 */
#define RTC_PRLH_PRL_1                            (0x2UL<<RTC_PRLH_PRL_Pos)                         /*!< 0x00000002 */
#define RTC_PRLH_PRL_2                            (0x4UL<<RTC_PRLH_PRL_Pos)                         /*!< 0x00000004 */
#define RTC_PRLH_PRL_3                            (0x8UL<<RTC_PRLH_PRL_Pos)                         /*!< 0x00000008 */

/********************************* Bit definition for RTC_PRLL register *********************************************/
#define RTC_PRLL_PRL_Pos                          (0U)
#define RTC_PRLL_PRL_Msk                          (0xFFFFUL<<RTC_PRLL_PRL_Pos)                      /*!< 0x0000FFFF */
#define RTC_PRLL_PRL                              RTC_PRLL_PRL_Msk                                  /*!< RTC pre-scaler reload value low part */

