Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xE.h
/********************************* Bit definition for SYSCFG_CFGR3 register *****************************************/
#define SYSCFG_CFGR3_DMA1_MAP1_Pos                 (0U)
#define SYSCFG_CFGR3_DMA1_MAP1_Msk                 (0x7FUL << SYSCFG_CFGR3_DMA1_MAP1_Pos)             /*!< 0x0000007F */
#define SYSCFG_CFGR3_DMA1_MAP1                     SYSCFG_CFGR3_DMA1_MAP1_Msk                         /*!< DMA1 ch1 mapping */
#define SYSCFG_CFGR3_DMA1_MAP1_0                   (0x1UL << SYSCFG_CFGR3_DMA1_MAP1_Pos)              /*!< 0x00000001 */
#define SYSCFG_CFGR3_DMA1_MAP1_1                   (0x2UL << SYSCFG_CFGR3_DMA1_MAP1_Pos)              /*!< 0x00000002 */
#define SYSCFG_CFGR3_DMA1_MAP1_2                   (0x4UL << SYSCFG_CFGR3_DMA1_MAP1_Pos)              /*!< 0x00000004 */
#define SYSCFG_CFGR3_DMA1_MAP1_3                   (0x8UL << SYSCFG_CFGR3_DMA1_MAP1_Pos)              /*!< 0x00000008 */
#define SYSCFG_CFGR3_DMA1_MAP1_4                   (0x10UL << SYSCFG_CFGR3_DMA1_MAP1_Pos)             /*!< 0x00000010 */
#define SYSCFG_CFGR3_DMA1_MAP1_5                   (0x20UL << SYSCFG_CFGR3_DMA1_MAP1_Pos)             /*!< 0x00000020 */
#define SYSCFG_CFGR3_DMA1_MAP1_6                   (0x40UL << SYSCFG_CFGR3_DMA1_MAP1_Pos)             /*!< 0x00000040 */

#define SYSCFG_CFGR3_DMA1_MAP2_Pos                 (8U)
#define SYSCFG_CFGR3_DMA1_MAP2_Msk                 (0x7FUL << SYSCFG_CFGR3_DMA1_MAP2_Pos)             /*!< 0x00007F00 */
#define SYSCFG_CFGR3_DMA1_MAP2                     SYSCFG_CFGR3_DMA1_MAP2_Msk                         /*!< DMA1 ch2 mapping */
#define SYSCFG_CFGR3_DMA1_MAP2_0                   (0x1UL << SYSCFG_CFGR3_DMA1_MAP2_Pos)              /*!< 0x00000100 */
#define SYSCFG_CFGR3_DMA1_MAP2_1                   (0x2UL << SYSCFG_CFGR3_DMA1_MAP2_Pos)              /*!< 0x00000200 */
#define SYSCFG_CFGR3_DMA1_MAP2_2                   (0x4UL << SYSCFG_CFGR3_DMA1_MAP2_Pos)              /*!< 0x00000400 */
#define SYSCFG_CFGR3_DMA1_MAP2_3                   (0x8UL << SYSCFG_CFGR3_DMA1_MAP2_Pos)              /*!< 0x00000800 */
#define SYSCFG_CFGR3_DMA1_MAP2_4                   (0x10UL << SYSCFG_CFGR3_DMA1_MAP2_Pos)             /*!< 0x00001000 */
#define SYSCFG_CFGR3_DMA1_MAP2_5                   (0x20UL << SYSCFG_CFGR3_DMA1_MAP2_Pos)             /*!< 0x00002000 */
#define SYSCFG_CFGR3_DMA1_MAP2_6                   (0x40UL << SYSCFG_CFGR3_DMA1_MAP2_Pos)             /*!< 0x00004000 */

#define SYSCFG_CFGR3_DMA1_MAP3_Pos                 (16U)
#define SYSCFG_CFGR3_DMA1_MAP3_Msk                 (0x7FUL << SYSCFG_CFGR3_DMA1_MAP3_Pos)             /*!< 0x007F0000 */
#define SYSCFG_CFGR3_DMA1_MAP3                     SYSCFG_CFGR3_DMA1_MAP3_Msk                         /*!< DMA1 ch3 mapping */
#define SYSCFG_CFGR3_DMA1_MAP3_0                   (0x1UL << SYSCFG_CFGR3_DMA1_MAP3_Pos)              /*!< 0x00010000 */
#define SYSCFG_CFGR3_DMA1_MAP3_1                   (0x2UL << SYSCFG_CFGR3_DMA1_MAP3_Pos)              /*!< 0x00020000 */
#define SYSCFG_CFGR3_DMA1_MAP3_2                   (0x4UL << SYSCFG_CFGR3_DMA1_MAP3_Pos)              /*!< 0x00040000 */
#define SYSCFG_CFGR3_DMA1_MAP3_3                   (0x8UL << SYSCFG_CFGR3_DMA1_MAP3_Pos)              /*!< 0x00080000 */
#define SYSCFG_CFGR3_DMA1_MAP3_4                   (0x10UL << SYSCFG_CFGR3_DMA1_MAP3_Pos)             /*!< 0x00100000 */
#define SYSCFG_CFGR3_DMA1_MAP3_5                   (0x20UL << SYSCFG_CFGR3_DMA1_MAP3_Pos)             /*!< 0x00200000 */
#define SYSCFG_CFGR3_DMA1_MAP3_6                   (0x40UL << SYSCFG_CFGR3_DMA1_MAP3_Pos)             /*!< 0x00400000 */

#define SYSCFG_CFGR3_DMA1_MAP4_Pos                 (24U)
#define SYSCFG_CFGR3_DMA1_MAP4_Msk                 (0x7FUL << SYSCFG_CFGR3_DMA1_MAP4_Pos)             /*!< 0x7F000000 */
#define SYSCFG_CFGR3_DMA1_MAP4                     SYSCFG_CFGR3_DMA1_MAP4_Msk                         /*!< DMA1 ch4 mapping */
#define SYSCFG_CFGR3_DMA1_MAP4_0                   (0x1UL << SYSCFG_CFGR3_DMA1_MAP4_Pos)              /*!< 0x01000000 */
#define SYSCFG_CFGR3_DMA1_MAP4_1                   (0x2UL << SYSCFG_CFGR3_DMA1_MAP4_Pos)              /*!< 0x02000000 */
#define SYSCFG_CFGR3_DMA1_MAP4_2                   (0x4UL << SYSCFG_CFGR3_DMA1_MAP4_Pos)              /*!< 0x04000000 */
#define SYSCFG_CFGR3_DMA1_MAP4_3                   (0x8UL << SYSCFG_CFGR3_DMA1_MAP4_Pos)              /*!< 0x08000000 */
#define SYSCFG_CFGR3_DMA1_MAP4_4                   (0x10UL << SYSCFG_CFGR3_DMA1_MAP4_Pos)             /*!< 0x10000000 */
#define SYSCFG_CFGR3_DMA1_MAP4_5                   (0x20UL << SYSCFG_CFGR3_DMA1_MAP4_Pos)             /*!< 0x20000000 */
#define SYSCFG_CFGR3_DMA1_MAP4_6                   (0x40UL << SYSCFG_CFGR3_DMA1_MAP4_Pos)             /*!< 0x40000000 */

/********************************* Bit definition for SYSCFG_CFGR4 register *****************************************/
#define SYSCFG_CFGR4_DMA1_MAP5_Pos                 (0U)
#define SYSCFG_CFGR4_DMA1_MAP5_Msk                 (0x7FUL << SYSCFG_CFGR4_DMA1_MAP5_Pos)             /*!< 0x0000007F */
#define SYSCFG_CFGR4_DMA1_MAP5                     SYSCFG_CFGR4_DMA1_MAP5_Msk                         /*!< DMA1 ch5 mapping */
#define SYSCFG_CFGR4_DMA1_MAP5_0                   (0x1UL << SYSCFG_CFGR4_DMA1_MAP5_Pos)              /*!< 0x00000001 */
#define SYSCFG_CFGR4_DMA1_MAP5_1                   (0x2UL << SYSCFG_CFGR4_DMA1_MAP5_Pos)              /*!< 0x00000002 */
#define SYSCFG_CFGR4_DMA1_MAP5_2                   (0x4UL << SYSCFG_CFGR4_DMA1_MAP5_Pos)              /*!< 0x00000004 */
#define SYSCFG_CFGR4_DMA1_MAP5_3                   (0x8UL << SYSCFG_CFGR4_DMA1_MAP5_Pos)              /*!< 0x00000008 */
#define SYSCFG_CFGR4_DMA1_MAP5_4                   (0x10UL << SYSCFG_CFGR4_DMA1_MAP5_Pos)             /*!< 0x00000010 */
#define SYSCFG_CFGR4_DMA1_MAP5_5                   (0x20UL << SYSCFG_CFGR4_DMA1_MAP5_Pos)             /*!< 0x00000020 */
#define SYSCFG_CFGR4_DMA1_MAP5_6                   (0x40UL << SYSCFG_CFGR4_DMA1_MAP5_Pos)             /*!< 0x00000040 */

#define SYSCFG_CFGR4_DMA1_MAP6_Pos                 (8U)
#define SYSCFG_CFGR4_DMA1_MAP6_Msk                 (0x7FUL << SYSCFG_CFGR4_DMA1_MAP6_Pos)             /*!< 0x00007F00 */
#define SYSCFG_CFGR4_DMA1_MAP6                     SYSCFG_CFGR4_DMA1_MAP6_Msk                         /*!< DMA1 ch6 mapping */
#define SYSCFG_CFGR4_DMA1_MAP6_0                   (0x1UL << SYSCFG_CFGR4_DMA1_MAP6_Pos)              /*!< 0x00000100 */
#define SYSCFG_CFGR4_DMA1_MAP6_1                   (0x2UL << SYSCFG_CFGR4_DMA1_MAP6_Pos)              /*!< 0x00000200 */
#define SYSCFG_CFGR4_DMA1_MAP6_2                   (0x4UL << SYSCFG_CFGR4_DMA1_MAP6_Pos)              /*!< 0x00000400 */
#define SYSCFG_CFGR4_DMA1_MAP6_3                   (0x8UL << SYSCFG_CFGR4_DMA1_MAP6_Pos)              /*!< 0x00000800 */
#define SYSCFG_CFGR4_DMA1_MAP6_4                   (0x10UL << SYSCFG_CFGR4_DMA1_MAP6_Pos)             /*!< 0x00001000 */
#define SYSCFG_CFGR4_DMA1_MAP6_5                   (0x20UL << SYSCFG_CFGR4_DMA1_MAP6_Pos)             /*!< 0x00002000 */
#define SYSCFG_CFGR4_DMA1_MAP6_6                   (0x40UL << SYSCFG_CFGR4_DMA1_MAP6_Pos)             /*!< 0x00004000 */

#define SYSCFG_CFGR4_DMA2_MAP1_Pos                 (16U)
#define SYSCFG_CFGR4_DMA2_MAP1_Msk                 (0x7FUL << SYSCFG_CFGR4_DMA2_MAP1_Pos)             /*!< 0x007F0000 */
#define SYSCFG_CFGR4_DMA2_MAP1                     SYSCFG_CFGR4_DMA2_MAP1_Msk                         /*!< DMA2 ch1 mapping */
#define SYSCFG_CFGR4_DMA2_MAP1_0                   (0x1UL << SYSCFG_CFGR4_DMA2_MAP1_Pos)              /*!< 0x00010000 */
#define SYSCFG_CFGR4_DMA2_MAP1_1                   (0x2UL << SYSCFG_CFGR4_DMA2_MAP1_Pos)              /*!< 0x00020000 */
#define SYSCFG_CFGR4_DMA2_MAP1_2                   (0x4UL << SYSCFG_CFGR4_DMA2_MAP1_Pos)              /*!< 0x00040000 */
#define SYSCFG_CFGR4_DMA2_MAP1_3                   (0x8UL << SYSCFG_CFGR4_DMA2_MAP1_Pos)              /*!< 0x00080000 */
#define SYSCFG_CFGR4_DMA2_MAP1_4                   (0x10UL << SYSCFG_CFGR4_DMA2_MAP1_Pos)             /*!< 0x00100000 */
#define SYSCFG_CFGR4_DMA2_MAP1_5                   (0x20UL << SYSCFG_CFGR4_DMA2_MAP1_Pos)             /*!< 0x00200000 */
#define SYSCFG_CFGR4_DMA2_MAP1_6                   (0x40UL << SYSCFG_CFGR4_DMA2_MAP1_Pos)             /*!< 0x00400000 */

#define SYSCFG_CFGR4_DMA2_MAP2_Pos                 (24U)
#define SYSCFG_CFGR4_DMA2_MAP2_Msk                 (0x7FUL << SYSCFG_CFGR4_DMA2_MAP2_Pos)             /*!< 0x7F000000 */
#define SYSCFG_CFGR4_DMA2_MAP2                     SYSCFG_CFGR4_DMA2_MAP2_Msk                         /*!< DMA2 ch2 mapping */
#define SYSCFG_CFGR4_DMA2_MAP2_0                   (0x1UL << SYSCFG_CFGR4_DMA2_MAP2_Pos)              /*!< 0x01000000 */
#define SYSCFG_CFGR4_DMA2_MAP2_1                   (0x2UL << SYSCFG_CFGR4_DMA2_MAP2_Pos)              /*!< 0x02000000 */
#define SYSCFG_CFGR4_DMA2_MAP2_2                   (0x4UL << SYSCFG_CFGR4_DMA2_MAP2_Pos)              /*!< 0x04000000 */
#define SYSCFG_CFGR4_DMA2_MAP2_3                   (0x8UL << SYSCFG_CFGR4_DMA2_MAP2_Pos)              /*!< 0x08000000 */
#define SYSCFG_CFGR4_DMA2_MAP2_4                   (0x10UL << SYSCFG_CFGR4_DMA2_MAP2_Pos)             /*!< 0x10000000 */
#define SYSCFG_CFGR4_DMA2_MAP2_5                   (0x20UL << SYSCFG_CFGR4_DMA2_MAP2_Pos)             /*!< 0x20000000 */
#define SYSCFG_CFGR4_DMA2_MAP2_6                   (0x40UL << SYSCFG_CFGR4_DMA2_MAP2_Pos)             /*!< 0x40000000 */

/********************************* Bit definition for SYSCFG_CFGR5 register *****************************************/
#define SYSCFG_CFGR5_DMA2_MAP3_Pos                 (0U)
#define SYSCFG_CFGR5_DMA2_MAP3_Msk                 (0x7FUL << SYSCFG_CFGR5_DMA2_MAP3_Pos)             /*!< 0x0000007F */
#define SYSCFG_CFGR5_DMA2_MAP3                     SYSCFG_CFGR5_DMA2_MAP3_Msk                         /*!< DMA2 ch3 mapping */
#define SYSCFG_CFGR5_DMA2_MAP3_0                   (0x1UL << SYSCFG_CFGR5_DMA2_MAP3_Pos)              /*!< 0x00000001 */
#define SYSCFG_CFGR5_DMA2_MAP3_1                   (0x2UL << SYSCFG_CFGR5_DMA2_MAP3_Pos)              /*!< 0x00000002 */
#define SYSCFG_CFGR5_DMA2_MAP3_2                   (0x4UL << SYSCFG_CFGR5_DMA2_MAP3_Pos)              /*!< 0x00000004 */
#define SYSCFG_CFGR5_DMA2_MAP3_3                   (0x8UL << SYSCFG_CFGR5_DMA2_MAP3_Pos)              /*!< 0x00000008 */
#define SYSCFG_CFGR5_DMA2_MAP3_4                   (0x10UL << SYSCFG_CFGR5_DMA2_MAP3_Pos)             /*!< 0x00000010 */
#define SYSCFG_CFGR5_DMA2_MAP3_5                   (0x20UL << SYSCFG_CFGR5_DMA2_MAP3_Pos)             /*!< 0x00000020 */
#define SYSCFG_CFGR5_DMA2_MAP3_6                   (0x40UL << SYSCFG_CFGR5_DMA2_MAP3_Pos)             /*!< 0x00000040 */

#define SYSCFG_CFGR5_DMA2_MAP4_Pos                 (8U)
#define SYSCFG_CFGR5_DMA2_MAP4_Msk                 (0x7FUL << SYSCFG_CFGR5_DMA2_MAP4_Pos)             /*!< 0x0000007F00 */
#define SYSCFG_CFGR5_DMA2_MAP4                     SYSCFG_CFGR5_DMA2_MAP4_Msk                         /*!< DMA2 ch4 mapping */
#define SYSCFG_CFGR5_DMA2_MAP4_0                   (0x1UL << SYSCFG_CFGR5_DMA2_MAP4_Pos)              /*!< 0x00000100 */
#define SYSCFG_CFGR5_DMA2_MAP4_1                   (0x2UL << SYSCFG_CFGR5_DMA2_MAP4_Pos)              /*!< 0x00000200 */
#define SYSCFG_CFGR5_DMA2_MAP4_2                   (0x4UL << SYSCFG_CFGR5_DMA2_MAP4_Pos)              /*!< 0x00000400 */
#define SYSCFG_CFGR5_DMA2_MAP4_3                   (0x8UL << SYSCFG_CFGR5_DMA2_MAP4_Pos)              /*!< 0x00000800 */
#define SYSCFG_CFGR5_DMA2_MAP4_4                   (0x10UL << SYSCFG_CFGR5_DMA2_MAP4_Pos)             /*!< 0x00001000 */
#define SYSCFG_CFGR5_DMA2_MAP4_5                   (0x20UL << SYSCFG_CFGR5_DMA2_MAP4_Pos)             /*!< 0x00002000 */
#define SYSCFG_CFGR5_DMA2_MAP4_6                   (0x40UL << SYSCFG_CFGR5_DMA2_MAP4_Pos)             /*!< 0x00004000 */

#define SYSCFG_CFGR5_DMA2_MAP5_Pos                 (16U)
#define SYSCFG_CFGR5_DMA2_MAP5_Msk                 (0x7FUL << SYSCFG_CFGR5_DMA2_MAP5_Pos)             /*!< 0x007F0000 */
#define SYSCFG_CFGR5_DMA2_MAP5                     SYSCFG_CFGR5_DMA2_MAP5_Msk                         /*!< DMA2 ch5 mapping */
#define SYSCFG_CFGR5_DMA2_MAP5_0                   (0x1UL << SYSCFG_CFGR5_DMA2_MAP5_Pos)              /*!< 0x00010000 */
#define SYSCFG_CFGR5_DMA2_MAP5_1                   (0x2UL << SYSCFG_CFGR5_DMA2_MAP5_Pos)              /*!< 0x00020000 */
#define SYSCFG_CFGR5_DMA2_MAP5_2                   (0x4UL << SYSCFG_CFGR5_DMA2_MAP5_Pos)              /*!< 0x00040000 */
#define SYSCFG_CFGR5_DMA2_MAP5_3                   (0x8UL << SYSCFG_CFGR5_DMA2_MAP5_Pos)              /*!< 0x00080000 */
#define SYSCFG_CFGR5_DMA2_MAP5_4                   (0x10UL << SYSCFG_CFGR5_DMA2_MAP5_Pos)             /*!< 0x00100000 */
#define SYSCFG_CFGR5_DMA2_MAP5_5                   (0x20UL << SYSCFG_CFGR5_DMA2_MAP5_Pos)             /*!< 0x00200000 */
#define SYSCFG_CFGR5_DMA2_MAP5_6                   (0x40UL << SYSCFG_CFGR5_DMA2_MAP5_Pos)             /*!< 0x00400000 */

