Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xE.h
/********************************* Bit definition for PD_ANA2ENR register *******************************************/
#define SYSCFG_PDANA2ENR_PD10_ENA2_Pos                  (10U)
#define SYSCFG_PDANA2ENR_PD10_ENA2_Msk                  (0x1UL<<SYSCFG_PDANA2ENR_PD10_ENA2_Pos)                 /*!< 0x00000400 */
#define SYSCFG_PDANA2ENR_PD10_ENA2                      SYSCFG_PDANA2ENR_PD10_ENA2_Msk                          /*!< GPIOD10_ANA2 enable */
#define SYSCFG_PDANA2ENR_PD11_ENA2_Pos                  (11U)
#define SYSCFG_PDANA2ENR_PD11_ENA2_Msk                  (0x1UL<<SYSCFG_PDANA2ENR_PD11_ENA2_Pos)                 /*!< 0x00000800 */
#define SYSCFG_PDANA2ENR_PD11_ENA2                      SYSCFG_PDANA2ENR_PD11_ENA2_Msk                          /*!< GPIOD11_ANA2 enable */
#define SYSCFG_PDANA2ENR_PD12_ENA2_Pos                  (12U)
#define SYSCFG_PDANA2ENR_PD12_ENA2_Msk                  (0x1UL<<SYSCFG_PDANA2ENR_PD12_ENA2_Pos)                 /*!< 0x00001000 */
#define SYSCFG_PDANA2ENR_PD12_ENA2                      SYSCFG_PDANA2ENR_PD12_ENA2_Msk                          /*!< GPIOD12_ANA2 enable */
#define SYSCFG_PDANA2ENR_PD13_ENA2_Pos                  (13U)
#define SYSCFG_PDANA2ENR_PD13_ENA2_Msk                  (0x1UL<<SYSCFG_PDANA2ENR_PD13_ENA2_Pos)                 /*!< 0x00002000 */
#define SYSCFG_PDANA2ENR_PD13_ENA2                      SYSCFG_PDANA2ENR_PD13_ENA2_Msk                          /*!< GPIOD13_ANA2 enable */

/********************************* Bit definition for PE_ANA2ENR register *******************************************/
#define SYSCFG_PEANA2ENR_PE7_ENA2_Pos                   (7U)
#define SYSCFG_PEANA2ENR_PE7_ENA2_Msk                   (0x1UL<<SYSCFG_PEANA2ENR_PE7_ENA2_Pos)                  /*!< 0x00000080 */
#define SYSCFG_PEANA2ENR_PE7_ENA2                       SYSCFG_PEANA2ENR_PE7_ENA2_Msk                           /*!< GPIOE7_ANA2 enable */
#define SYSCFG_PEANA2ENR_PE10_ENA2_Pos                  (10U)
#define SYSCFG_PEANA2ENR_PE10_ENA2_Msk                  (0x1UL<<SYSCFG_PEANA2ENR_PE10_ENA2_Pos)                 /*!< 0x00000400 */
#define SYSCFG_PEANA2ENR_PE10_ENA2                      SYSCFG_PEANA2ENR_PE10_ENA2_Msk                          /*!< GPIOE10_ANA2 enable */
#define SYSCFG_PEANA2ENR_PE11_ENA2_Pos                  (11U)
#define SYSCFG_PEANA2ENR_PE11_ENA2_Msk                  (0x1UL<<SYSCFG_PEANA2ENR_PE11_ENA2_Pos)                 /*!< 0x00000800 */
#define SYSCFG_PEANA2ENR_PE11_ENA2                      SYSCFG_PEANA2ENR_PE11_ENA2_Msk                          /*!< GPIOE11_ANA2 enable */
#define SYSCFG_PEANA2ENR_PE12_ENA2_Pos                  (12U)
#define SYSCFG_PEANA2ENR_PE12_ENA2_Msk                  (0x1UL<<SYSCFG_PEANA2ENR_PE12_ENA2_Pos)                 /*!< 0x00001000 */
#define SYSCFG_PEANA2ENR_PE12_ENA2                      SYSCFG_PEANA2ENR_PE12_ENA2_Msk                          /*!< GPIOE12_ANA2 enable */

/********************************* Bit definition for PVDIN_ANA2ENR register *******************************************/
#define SYSCFG_PVDINANA2ENR_PVDIN_ENA2_Pos              (0U)
#define SYSCFG_PVDINANA2ENR_PVDIN_ENA2_Msk              (0x1UL<<SYSCFG_PVDINANA2ENR_PVDIN_ENA2_Pos)             /*!< 0x00000001 */
#define SYSCFG_PVDINANA2ENR_PVDIN_ENA2                  SYSCFG_PVDINANA2ENR_PVDIN_ENA2_Msk                      /*!< PVDIN_ANA2 enable */


/********************************* Bit definition for SYSCFG_SCSR register ******************************************/
#define SYSCFG_SCSR_CCMER_Pos                     (0U)
#define SYSCFG_SCSR_CCMER_Msk                     (0x1UL<<SYSCFG_SCSR_CCMER_Pos)                    /*!< 0x00000001 */
#define SYSCFG_SCSR_CCMER                         SYSCFG_SCSR_CCMER_Msk                             /*!< CCM SRAM erase */
#define SYSCFG_SCSR_CCMBSY_Pos                    (1U)
#define SYSCFG_SCSR_CCMBSY_Msk                    (0x1UL<<SYSCFG_SCSR_CCMBSY_Pos)                   /*!< 0x00000002 */
#define SYSCFG_SCSR_CCMBSY                        SYSCFG_SCSR_CCMBSY_Msk                            /*!< CCM SRAM busy */

/********************************* Bit definition for SYSCFG_SWPR register ******************************************/
#define SYSCFG_SWPR_P0WP_Pos                      (0U)
#define SYSCFG_SWPR_P0WP_Msk                      (0x1UL<<SYSCFG_SWPR_P0WP_Pos)                     /*!< 0x00000001 */
#define SYSCFG_SWPR_P0WP                          SYSCFG_SWPR_P0WP_Msk                              /*!< CCM SRAM page 0 write protection */
#define SYSCFG_SWPR_P1WP_Pos                      (1U)
#define SYSCFG_SWPR_P1WP_Msk                      (0x1UL<<SYSCFG_SWPR_P1WP_Pos)                     /*!< 0x00000002 */
#define SYSCFG_SWPR_P1WP                          SYSCFG_SWPR_P1WP_Msk                              /*!< CCM SRAM page 1 write protection */
#define SYSCFG_SWPR_P2WP_Pos                      (2U)
#define SYSCFG_SWPR_P2WP_Msk                      (0x1UL<<SYSCFG_SWPR_P2WP_Pos)                     /*!< 0x00000004 */
#define SYSCFG_SWPR_P2WP                          SYSCFG_SWPR_P2WP_Msk                              /*!< CCM SRAM page 2 write protection */
#define SYSCFG_SWPR_P3WP_Pos                      (3U)
#define SYSCFG_SWPR_P3WP_Msk                      (0x1UL<<SYSCFG_SWPR_P3WP_Pos)                     /*!< 0x00000008 */
#define SYSCFG_SWPR_P3WP                          SYSCFG_SWPR_P3WP_Msk                              /*!< CCM SRAM page 3 write protection */
#define SYSCFG_SWPR_P4WP_Pos                      (4U)
#define SYSCFG_SWPR_P4WP_Msk                      (0x1UL<<SYSCFG_SWPR_P4WP_Pos)                     /*!< 0x00000010 */
#define SYSCFG_SWPR_P4WP                          SYSCFG_SWPR_P4WP_Msk                              /*!< CCM SRAM page 4 write protection */
#define SYSCFG_SWPR_P5WP_Pos                      (5U)
#define SYSCFG_SWPR_P5WP_Msk                      (0x1UL<<SYSCFG_SWPR_P5WP_Pos)                     /*!< 0x00000020 */
#define SYSCFG_SWPR_P5WP                          SYSCFG_SWPR_P5WP_Msk                              /*!< CCM SRAM page 5 write protection */
#define SYSCFG_SWPR_P6WP_Pos                      (6U)
#define SYSCFG_SWPR_P6WP_Msk                      (0x1UL<<SYSCFG_SWPR_P6WP_Pos)                     /*!< 0x00000040 */
#define SYSCFG_SWPR_P6WP                          SYSCFG_SWPR_P6WP_Msk                              /*!< CCM SRAM page 6 write protection */
#define SYSCFG_SWPR_P7WP_Pos                      (7U)
#define SYSCFG_SWPR_P7WP_Msk                      (0x1UL<<SYSCFG_SWPR_P7WP_Pos)                     /*!< 0x00000080 */
#define SYSCFG_SWPR_P7WP                          SYSCFG_SWPR_P7WP_Msk                              /*!< CCM SRAM page 7 write protection */
#define SYSCFG_SWPR_P8WP_Pos                      (8U)
#define SYSCFG_SWPR_P8WP_Msk                      (0x1UL<<SYSCFG_SWPR_P8WP_Pos)                     /*!< 0x00000100 */
#define SYSCFG_SWPR_P8WP                          SYSCFG_SWPR_P8WP_Msk                              /*!< CCM SRAM page 8 write protection */
#define SYSCFG_SWPR_P9WP_Pos                      (9U)
#define SYSCFG_SWPR_P9WP_Msk                      (0x1UL<<SYSCFG_SWPR_P9WP_Pos)                     /*!< 0x00000200 */
#define SYSCFG_SWPR_P9WP                          SYSCFG_SWPR_P9WP_Msk                              /*!< CCM SRAM page 9 write protection */
#define SYSCFG_SWPR_P10WP_Pos                     (10U)
#define SYSCFG_SWPR_P10WP_Msk                     (0x1UL<<SYSCFG_SWPR_P10WP_Pos)                    /*!< 0x00000400 */
#define SYSCFG_SWPR_P10WP                         SYSCFG_SWPR_P10WP_Msk                             /*!< CCM SRAM page 10 write protection */
#define SYSCFG_SWPR_P11WP_Pos                     (11U)
#define SYSCFG_SWPR_P11WP_Msk                     (0x1UL<<SYSCFG_SWPR_P11WP_Pos)                    /*!< 0x00000800 */
#define SYSCFG_SWPR_P11WP                         SYSCFG_SWPR_P11WP_Msk                             /*!< CCM SRAM page 11 write protection */
#define SYSCFG_SWPR_P12WP_Pos                     (12U)
#define SYSCFG_SWPR_P12WP_Msk                     (0x1UL<<SYSCFG_SWPR_P12WP_Pos)                    /*!< 0x00001000 */
#define SYSCFG_SWPR_P12WP                         SYSCFG_SWPR_P12WP_Msk                             /*!< CCM SRAM page 12 write protection */
#define SYSCFG_SWPR_P13WP_Pos                     (13U)
#define SYSCFG_SWPR_P13WP_Msk                     (0x1UL<<SYSCFG_SWPR_P13WP_Pos)                    /*!< 0x00002000 */
#define SYSCFG_SWPR_P13WP                         SYSCFG_SWPR_P13WP_Msk                             /*!< CCM SRAM page 13 write protection */
#define SYSCFG_SWPR_P14WP_Pos                     (14U)
#define SYSCFG_SWPR_P14WP_Msk                     (0x1UL<<SYSCFG_SWPR_P14WP_Pos)                    /*!< 0x00004000 */
#define SYSCFG_SWPR_P14WP                         SYSCFG_SWPR_P14WP_Msk                             /*!< CCM SRAM page 14 write protection */
#define SYSCFG_SWPR_P15WP_Pos                     (15U)
#define SYSCFG_SWPR_P15WP_Msk                     (0x1UL<<SYSCFG_SWPR_P15WP_Pos)                    /*!< 0x00008000 */
#define SYSCFG_SWPR_P15WP                         SYSCFG_SWPR_P15WP_Msk                             /*!< CCM SRAM page 15 write protection */
#define SYSCFG_SWPR_P16WP_Pos                     (16U)
#define SYSCFG_SWPR_P16WP_Msk                     (0x1UL<<SYSCFG_SWPR_P16WP_Pos)                    /*!< 0x00010000 */
#define SYSCFG_SWPR_P16WP                         SYSCFG_SWPR_P16WP_Msk                             /*!< CCM SRAM page 16 write protection */
#define SYSCFG_SWPR_P17WP_Pos                     (17U)
#define SYSCFG_SWPR_P17WP_Msk                     (0x1UL<<SYSCFG_SWPR_P17WP_Pos)                    /*!< 0x00020000 */
#define SYSCFG_SWPR_P17WP                         SYSCFG_SWPR_P17WP_Msk                             /*!< CCM SRAM page 17 write protection */
#define SYSCFG_SWPR_P18WP_Pos                     (18U)
#define SYSCFG_SWPR_P18WP_Msk                     (0x1UL<<SYSCFG_SWPR_P18WP_Pos)                    /*!< 0x00040000 */
#define SYSCFG_SWPR_P18WP                         SYSCFG_SWPR_P18WP_Msk                             /*!< CCM SRAM page 18 write protection */
#define SYSCFG_SWPR_P19WP_Pos                     (19U)
#define SYSCFG_SWPR_P19WP_Msk                     (0x1UL<<SYSCFG_SWPR_P19WP_Pos)                    /*!< 0x00080000 */
#define SYSCFG_SWPR_P19WP                         SYSCFG_SWPR_P19WP_Msk                             /*!< CCM SRAM page 19 write protection */
#define SYSCFG_SWPR_P20WP_Pos                     (20U)
#define SYSCFG_SWPR_P20WP_Msk                     (0x1UL<<SYSCFG_SWPR_P20WP_Pos)                    /*!< 0x00100000 */
#define SYSCFG_SWPR_P20WP                         SYSCFG_SWPR_P20WP_Msk                             /*!< CCM SRAM page 20 write protection */
#define SYSCFG_SWPR_P21WP_Pos                     (21U)
#define SYSCFG_SWPR_P21WP_Msk                     (0x1UL<<SYSCFG_SWPR_P21WP_Pos)                    /*!< 0x00200000 */
#define SYSCFG_SWPR_P21WP                         SYSCFG_SWPR_P21WP_Msk                             /*!< CCM SRAM page 21 write protection */
#define SYSCFG_SWPR_P22WP_Pos                     (22U)
#define SYSCFG_SWPR_P22WP_Msk                     (0x1UL<<SYSCFG_SWPR_P22WP_Pos)                    /*!< 0x00400000 */
#define SYSCFG_SWPR_P22WP                         SYSCFG_SWPR_P22WP_Msk                             /*!< CCM SRAM page 22 write protection */
#define SYSCFG_SWPR_P23WP_Pos                     (23U)
#define SYSCFG_SWPR_P23WP_Msk                     (0x1UL<<SYSCFG_SWPR_P23WP_Pos)                    /*!< 0x00800000 */
#define SYSCFG_SWPR_P23WP                         SYSCFG_SWPR_P23WP_Msk                             /*!< CCM SRAM page 23 write protection */
#define SYSCFG_SWPR_P24WP_Pos                     (24U)
#define SYSCFG_SWPR_P24WP_Msk                     (0x1UL<<SYSCFG_SWPR_P24WP_Pos)                    /*!< 0x01000000 */
#define SYSCFG_SWPR_P24WP                         SYSCFG_SWPR_P24WP_Msk                             /*!< CCM SRAM page 24 write protection */
#define SYSCFG_SWPR_P25WP_Pos                     (25U)
#define SYSCFG_SWPR_P25WP_Msk                     (0x1UL<<SYSCFG_SWPR_P25WP_Pos)                    /*!< 0x02000000 */
#define SYSCFG_SWPR_P25WP                         SYSCFG_SWPR_P25WP_Msk                             /*!< CCM SRAM page 25 write protection */
#define SYSCFG_SWPR_P26WP_Pos                     (26U)
#define SYSCFG_SWPR_P26WP_Msk                     (0x1UL<<SYSCFG_SWPR_P26WP_Pos)                    /*!< 0x04000000 */
#define SYSCFG_SWPR_P26WP                         SYSCFG_SWPR_P26WP_Msk                             /*!< CCM SRAM page 26 write protection */
#define SYSCFG_SWPR_P27WP_Pos                     (27U)
#define SYSCFG_SWPR_P27WP_Msk                     (0x1UL<<SYSCFG_SWPR_P27WP_Pos)                    /*!< 0x08000000 */
#define SYSCFG_SWPR_P27WP                         SYSCFG_SWPR_P27WP_Msk                             /*!< CCM SRAM page 27 write protection */
#define SYSCFG_SWPR_P28WP_Pos                     (28U)
#define SYSCFG_SWPR_P28WP_Msk                     (0x1UL<<SYSCFG_SWPR_P28WP_Pos)                    /*!< 0x10000000 */
#define SYSCFG_SWPR_P28WP                         SYSCFG_SWPR_P28WP_Msk                             /*!< CCM SRAM page 28 write protection */
#define SYSCFG_SWPR_P29WP_Pos                     (29U)
#define SYSCFG_SWPR_P29WP_Msk                     (0x1UL<<SYSCFG_SWPR_P29WP_Pos)                    /*!< 0x20000000 */
#define SYSCFG_SWPR_P29WP                         SYSCFG_SWPR_P29WP_Msk                             /*!< CCM SRAM page 29 write protection */
#define SYSCFG_SWPR_P30WP_Pos                     (30U)
#define SYSCFG_SWPR_P30WP_Msk                     (0x1UL<<SYSCFG_SWPR_P30WP_Pos)                    /*!< 0x40000000 */
#define SYSCFG_SWPR_P30WP                         SYSCFG_SWPR_P30WP_Msk                             /*!< CCM SRAM page 30 write protection */
#define SYSCFG_SWPR_P31WP_Pos                     (31U)
#define SYSCFG_SWPR_P31WP_Msk                     (0x1UL<<SYSCFG_SWPR_P31WP_Pos)                    /*!< 0x80000000 */
#define SYSCFG_SWPR_P31WP                         SYSCFG_SWPR_P31WP_Msk                             /*!< CCM SRAM page 31 write protection */

/********************************* Bit definition for SYSCFG_SKR register *******************************************/
#define SYSCFG_SKR_KEY_Pos                        (0U)
#define SYSCFG_SKR_KEY_Msk                        (0xFFUL<<SYSCFG_SKR_KEY_Pos)                      /*!< 0x000000FF */
#define SYSCFG_SKR_KEY                            SYSCFG_SKR_KEY_Msk                                /*!< protective key of SYSCFG_SCSR  */

