Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xE.h
/********************************* Bit definition for TIM_DIER register ********************************************/
#define TIM_DIER_UIE_Pos                         (0U)
#define TIM_DIER_UIE_Msk                         (0x1UL<<TIM_DIER_UIE_Pos)                        /*!< 0x00000001 */
#define TIM_DIER_UIE                             TIM_DIER_UIE_Msk                                 
#define TIM_DIER_CC1IE_Pos                       (1U)
#define TIM_DIER_CC1IE_Msk                       (0x1UL<<TIM_DIER_CC1IE_Pos)                      /*!< 0x00000002 */
#define TIM_DIER_CC1IE                           TIM_DIER_CC1IE_Msk                               
#define TIM_DIER_CC2IE_Pos                       (2U)
#define TIM_DIER_CC2IE_Msk                       (0x1UL<<TIM_DIER_CC2IE_Pos)                      /*!< 0x00000004 */
#define TIM_DIER_CC2IE                           TIM_DIER_CC2IE_Msk                               
#define TIM_DIER_CC3IE_Pos                       (3U)
#define TIM_DIER_CC3IE_Msk                       (0x1UL<<TIM_DIER_CC3IE_Pos)                      /*!< 0x00000008 */
#define TIM_DIER_CC3IE                           TIM_DIER_CC3IE_Msk                               
#define TIM_DIER_CC4IE_Pos                       (4U)
#define TIM_DIER_CC4IE_Msk                       (0x1UL<<TIM_DIER_CC4IE_Pos)                      /*!< 0x00000010 */
#define TIM_DIER_CC4IE                           TIM_DIER_CC4IE_Msk                               
#define TIM_DIER_COMIE_Pos                       (5U)
#define TIM_DIER_COMIE_Msk                       (0x1UL<<TIM_DIER_COMIE_Pos)                      /*!< 0x00000020 */
#define TIM_DIER_COMIE                           TIM_DIER_COMIE_Msk                               
#define TIM_DIER_TIE_Pos                         (6U)
#define TIM_DIER_TIE_Msk                         (0x1UL<<TIM_DIER_TIE_Pos)                        /*!< 0x00000040 */
#define TIM_DIER_TIE                             TIM_DIER_TIE_Msk                                 
#define TIM_DIER_BIE_Pos                         (7U)
#define TIM_DIER_BIE_Msk                         (0x1UL<<TIM_DIER_BIE_Pos)                        /*!< 0x00000080 */
#define TIM_DIER_BIE                             TIM_DIER_BIE_Msk                                 
#define TIM_DIER_UDE_Pos                         (8U)
#define TIM_DIER_UDE_Msk                         (0x1UL<<TIM_DIER_UDE_Pos)                        /*!< 0x00000100 */
#define TIM_DIER_UDE                             TIM_DIER_UDE_Msk                                 
#define TIM_DIER_CC1DE_Pos                       (9U)
#define TIM_DIER_CC1DE_Msk                       (0x1UL<<TIM_DIER_CC1DE_Pos)                      /*!< 0x00000200 */
#define TIM_DIER_CC1DE                           TIM_DIER_CC1DE_Msk                               
#define TIM_DIER_CC2DE_Pos                       (10U)
#define TIM_DIER_CC2DE_Msk                       (0x1UL<<TIM_DIER_CC2DE_Pos)                      /*!< 0x00000400 */
#define TIM_DIER_CC2DE                           TIM_DIER_CC2DE_Msk                               
#define TIM_DIER_CC3DE_Pos                       (11U)
#define TIM_DIER_CC3DE_Msk                       (0x1UL<<TIM_DIER_CC3DE_Pos)                      /*!< 0x00000800 */
#define TIM_DIER_CC3DE                           TIM_DIER_CC3DE_Msk                               
#define TIM_DIER_CC4DE_Pos                       (12U)
#define TIM_DIER_CC4DE_Msk                       (0x1UL<<TIM_DIER_CC4DE_Pos)                      /*!< 0x00001000 */
#define TIM_DIER_CC4DE                           TIM_DIER_CC4DE_Msk                               
#define TIM_DIER_COMDE_Pos                       (13U)
#define TIM_DIER_COMDE_Msk                       (0x1UL<<TIM_DIER_COMDE_Pos)                      /*!< 0x00002000 */
#define TIM_DIER_COMDE                           TIM_DIER_COMDE_Msk                               
#define TIM_DIER_TDE_Pos                         (14U)
#define TIM_DIER_TDE_Msk                         (0x1UL<<TIM_DIER_TDE_Pos)                        /*!< 0x00004000 */
#define TIM_DIER_TDE                             TIM_DIER_TDE_Msk                                 
#define TIM_DIER_IDXIE_Pos                       (20U)
#define TIM_DIER_IDXIE_Msk                       (0x1UL<<TIM_DIER_IDXIE_Pos)                      /*!< 0x00100000 */
#define TIM_DIER_IDXIE                           TIM_DIER_IDXIE_Msk                               
#define TIM_DIER_DIRIE_Pos                       (21U)
#define TIM_DIER_DIRIE_Msk                       (0x1UL<<TIM_DIER_DIRIE_Pos)                      /*!< 0x00200000 */
#define TIM_DIER_DIRIE                           TIM_DIER_DIRIE_Msk                               
#define TIM_DIER_IERRIE_Pos                      (22U)
#define TIM_DIER_IERRIE_Msk                      (0x1UL<<TIM_DIER_IERRIE_Pos)                     /*!< 0x00400000 */
#define TIM_DIER_IERRIE                          TIM_DIER_IERRIE_Msk                              
#define TIM_DIER_TERRIE_Pos                      (23U)
#define TIM_DIER_TERRIE_Msk                      (0x1UL<<TIM_DIER_TERRIE_Pos)                     /*!< 0x00800000 */
#define TIM_DIER_TERRIE                          TIM_DIER_TERRIE_Msk                              

/********************************* Bit definition for TIM_SR register **********************************************/
#define TIM_SR_UIF_Pos                           (0U)
#define TIM_SR_UIF_Msk                           (0x1UL<<TIM_SR_UIF_Pos)                          /*!< 0x00000001 */
#define TIM_SR_UIF                               TIM_SR_UIF_Msk                                   
#define TIM_SR_CC1IF_Pos                         (1U)
#define TIM_SR_CC1IF_Msk                         (0x1UL<<TIM_SR_CC1IF_Pos)                        /*!< 0x00000002 */
#define TIM_SR_CC1IF                             TIM_SR_CC1IF_Msk                                 
#define TIM_SR_CC2IF_Pos                         (2U)
#define TIM_SR_CC2IF_Msk                         (0x1UL<<TIM_SR_CC2IF_Pos)                        /*!< 0x00000004 */
#define TIM_SR_CC2IF                             TIM_SR_CC2IF_Msk                                 
#define TIM_SR_CC3IF_Pos                         (3U)
#define TIM_SR_CC3IF_Msk                         (0x1UL<<TIM_SR_CC3IF_Pos)                        /*!< 0x00000008 */
#define TIM_SR_CC3IF                             TIM_SR_CC3IF_Msk                                 
#define TIM_SR_CC4IF_Pos                         (4U)
#define TIM_SR_CC4IF_Msk                         (0x1UL<<TIM_SR_CC4IF_Pos)                        /*!< 0x00000010 */
#define TIM_SR_CC4IF                             TIM_SR_CC4IF_Msk                                 
#define TIM_SR_COMIF_Pos                         (5U)
#define TIM_SR_COMIF_Msk                         (0x1UL<<TIM_SR_COMIF_Pos)                        /*!< 0x00000020 */
#define TIM_SR_COMIF                             TIM_SR_COMIF_Msk                                 
#define TIM_SR_TIF_Pos                           (6U)
#define TIM_SR_TIF_Msk                           (0x1UL<<TIM_SR_TIF_Pos)                          /*!< 0x00000040 */
#define TIM_SR_TIF                               TIM_SR_TIF_Msk                                   
#define TIM_SR_BIF_Pos                           (7U)
#define TIM_SR_BIF_Msk                           (0x1UL<<TIM_SR_BIF_Pos)                          /*!< 0x00000080 */
#define TIM_SR_BIF                               TIM_SR_BIF_Msk                                   
#define TIM_SR_B2IF_Pos                          (8U)
#define TIM_SR_B2IF_Msk                          (0x1UL<<TIM_SR_B2IF_Pos)                         /*!< 0x00000100 */
#define TIM_SR_B2IF                              TIM_SR_B2IF_Msk                                  
#define TIM_SR_CC1OF_Pos                         (9U)
#define TIM_SR_CC1OF_Msk                         (0x1UL<<TIM_SR_CC1OF_Pos)                        /*!< 0x00000200 */
#define TIM_SR_CC1OF                             TIM_SR_CC1OF_Msk                                 
#define TIM_SR_CC2OF_Pos                         (10U)
#define TIM_SR_CC2OF_Msk                         (0x1UL<<TIM_SR_CC2OF_Pos)                        /*!< 0x00000400 */
#define TIM_SR_CC2OF                             TIM_SR_CC2OF_Msk                                 
#define TIM_SR_CC3OF_Pos                         (11U)
#define TIM_SR_CC3OF_Msk                         (0x1UL<<TIM_SR_CC3OF_Pos)                        /*!< 0x00000800 */
#define TIM_SR_CC3OF                             TIM_SR_CC3OF_Msk                                 
#define TIM_SR_CC4OF_Pos                         (12U)
#define TIM_SR_CC4OF_Msk                         (0x1UL<<TIM_SR_CC4OF_Pos)                        /*!< 0x00001000 */
#define TIM_SR_CC4OF                             TIM_SR_CC4OF_Msk                                 
#define TIM_SR_SBIF_Pos                          (13U)
#define TIM_SR_SBIF_Msk                          (0x1UL<<TIM_SR_SBIF_Pos)                         /*!< 0x00002000 */
#define TIM_SR_SBIF                              TIM_SR_SBIF_Msk                                  
#define TIM_SR_CC5IF_Pos                         (16U)
#define TIM_SR_CC5IF_Msk                         (0x1UL<<TIM_SR_CC5IF_Pos)                        /*!< 0x00010000 */
#define TIM_SR_CC5IF                             TIM_SR_CC5IF_Msk                                 
#define TIM_SR_CC6IF_Pos                         (17U)
#define TIM_SR_CC6IF_Msk                         (0x1UL<<TIM_SR_CC6IF_Pos)                        /*!< 0x00020000 */
#define TIM_SR_CC6IF                             TIM_SR_CC6IF_Msk                                 
#define TIM_SR_IC1IR_Pos                         (18U)
#define TIM_SR_IC1IR_Msk                         (0x1UL<<TIM_SR_IC1IR_Pos)                        /*!< 0x00040000 */
#define TIM_SR_IC1IR                             TIM_SR_IC1IR_Msk                                 
#define TIM_SR_IC2IR_Pos                         (19U)
#define TIM_SR_IC2IR_Msk                         (0x1UL<<TIM_SR_IC2IR_Pos)                        /*!< 0x00080000 */
#define TIM_SR_IC2IR                             TIM_SR_IC2IR_Msk                                 
#define TIM_SR_IDXF_Pos                          (20U)
#define TIM_SR_IDXF_Msk                          (0x1UL<<TIM_SR_IDXF_Pos)                         /*!< 0x00100000 */
#define TIM_SR_IDXF                              TIM_SR_IDXF_Msk                                  
#define TIM_SR_DIRF_Pos                          (21U)
#define TIM_SR_DIRF_Msk                          (0x1UL<<TIM_SR_DIRF_Pos)                         /*!< 0x00200000 */
#define TIM_SR_DIRF                              TIM_SR_DIRF_Msk                                  
#define TIM_SR_IERRF_Pos                         (22U)
#define TIM_SR_IERRF_Msk                         (0x1UL<<TIM_SR_IERRF_Pos)                        /*!< 0x00400000 */
#define TIM_SR_IERRF                             TIM_SR_IERRF_Msk                                 
#define TIM_SR_TERRF_Pos                         (23U)
#define TIM_SR_TERRF_Msk                         (0x1UL<<TIM_SR_TERRF_Pos)                        /*!< 0x00800000 */
#define TIM_SR_TERRF                             TIM_SR_TERRF_Msk                                 
#define TIM_SR_IC3IR_Pos                         (24U)
#define TIM_SR_IC3IR_Msk                         (0x1UL<<TIM_SR_IC3IR_Pos)                        /*!< 0x01000000 */
#define TIM_SR_IC3IR                             TIM_SR_IC3IR_Msk                                 
#define TIM_SR_IC4IR_Pos                         (25U)
#define TIM_SR_IC4IR_Msk                         (0x1UL<<TIM_SR_IC4IR_Pos)                        /*!< 0x02000000 */
#define TIM_SR_IC4IR                             TIM_SR_IC4IR_Msk                                 
#define TIM_SR_IC1IF_Pos                         (26U)
#define TIM_SR_IC1IF_Msk                         (0x1UL<<TIM_SR_IC1IF_Pos)                        /*!< 0x04000000 */
#define TIM_SR_IC1IF                             TIM_SR_IC1IF_Msk                                 
#define TIM_SR_IC2IF_Pos                         (27U)
#define TIM_SR_IC2IF_Msk                         (0x1UL<<TIM_SR_IC2IF_Pos)                        /*!< 0x08000000 */
#define TIM_SR_IC2IF                             TIM_SR_IC2IF_Msk                                 
#define TIM_SR_IC3IF_Pos                         (28U)
#define TIM_SR_IC3IF_Msk                         (0x1UL<<TIM_SR_IC3IF_Pos)                        /*!< 0x10000000 */
#define TIM_SR_IC3IF                             TIM_SR_IC3IF_Msk                                 
#define TIM_SR_IC4IF_Pos                         (29U)
#define TIM_SR_IC4IF_Msk                         (0x1UL<<TIM_SR_IC4IF_Pos)                        /*!< 0x20000000 */
#define TIM_SR_IC4IF                             TIM_SR_IC4IF_Msk                                 

/********************************* Bit definition for TIM_EGR register *********************************************/
#define TIM_EGR_UG_Pos                           (0U)
#define TIM_EGR_UG_Msk                           (0x1UL<<TIM_EGR_UG_Pos)                          /*!< 0x00000001 */
#define TIM_EGR_UG                               TIM_EGR_UG_Msk                                   
#define TIM_EGR_CC1G_Pos                         (1U)
#define TIM_EGR_CC1G_Msk                         (0x1UL<<TIM_EGR_CC1G_Pos)                        /*!< 0x00000002 */
#define TIM_EGR_CC1G                             TIM_EGR_CC1G_Msk                                 
#define TIM_EGR_CC2G_Pos                         (2U)
#define TIM_EGR_CC2G_Msk                         (0x1UL<<TIM_EGR_CC2G_Pos)                        /*!< 0x00000004 */
#define TIM_EGR_CC2G                             TIM_EGR_CC2G_Msk                                 
#define TIM_EGR_CC3G_Pos                         (3U)
#define TIM_EGR_CC3G_Msk                         (0x1UL<<TIM_EGR_CC3G_Pos)                        /*!< 0x00000008 */
#define TIM_EGR_CC3G                             TIM_EGR_CC3G_Msk                                 
#define TIM_EGR_CC4G_Pos                         (4U)
#define TIM_EGR_CC4G_Msk                         (0x1UL<<TIM_EGR_CC4G_Pos)                        /*!< 0x00000010 */
#define TIM_EGR_CC4G                             TIM_EGR_CC4G_Msk                                 
#define TIM_EGR_COMG_Pos                         (5U)
#define TIM_EGR_COMG_Msk                         (0x1UL<<TIM_EGR_COMG_Pos)                        /*!< 0x00000020 */
#define TIM_EGR_COMG                             TIM_EGR_COMG_Msk                                 
#define TIM_EGR_TG_Pos                           (6U)
#define TIM_EGR_TG_Msk                           (0x1UL<<TIM_EGR_TG_Pos)                          /*!< 0x00000040 */
#define TIM_EGR_TG                               TIM_EGR_TG_Msk                                   
#define TIM_EGR_BG_Pos                           (7U)
#define TIM_EGR_BG_Msk                           (0x1UL<<TIM_EGR_BG_Pos)                          /*!< 0x00000080 */
#define TIM_EGR_BG                               TIM_EGR_BG_Msk                                   
#define TIM_EGR_B2G_Pos                          (8U)
#define TIM_EGR_B2G_Msk                          (0x1UL<<TIM_EGR_B2G_Pos)                         /*!< 0x00000100 */
#define TIM_EGR_B2G                              TIM_EGR_B2G_Msk                                  

/********************************* Bit definition for TIM_CCMR1 register *******************************************/
#define TIM_CCMR1_CC1S_Pos                       (0U)
#define TIM_CCMR1_CC1S_Msk                       (0x3UL<<TIM_CCMR1_CC1S_Pos)                      /*!< 0x00000003 */
#define TIM_CCMR1_CC1S                           TIM_CCMR1_CC1S_Msk
#define TIM_CCMR1_CC1S_0                         (0x1UL<<TIM_CCMR1_CC1S_Pos)                      /*!< 0x00000001 */
#define TIM_CCMR1_CC1S_1                         (0x2UL<<TIM_CCMR1_CC1S_Pos)                      /*!< 0x00000002 */
#define TIM_CCMR1_OC1FE_Pos                      (2U)
#define TIM_CCMR1_OC1FE_Msk                      (0x1UL<<TIM_CCMR1_OC1FE_Pos)                     /*!< 0x00000004 */
#define TIM_CCMR1_OC1FE                          TIM_CCMR1_OC1FE_Msk                              
#define TIM_CCMR1_OC1PE_Pos                      (3U)
#define TIM_CCMR1_OC1PE_Msk                      (0x1UL<<TIM_CCMR1_OC1PE_Pos)                     /*!< 0x00000008 */
#define TIM_CCMR1_OC1PE                          TIM_CCMR1_OC1PE_Msk                              
#define TIM_CCMR1_OC1M_Pos                       (4U)
#define TIM_CCMR1_OC1M_Msk                       (0x1007UL<<TIM_CCMR1_OC1M_Pos)                   /*!< 0x00010070 */
#define TIM_CCMR1_OC1M                           TIM_CCMR1_OC1M_Msk
#define TIM_CCMR1_OC1M_0                         (0x1UL<<TIM_CCMR1_OC1M_Pos)                      /*!< 0x00000010 */
#define TIM_CCMR1_OC1M_1                         (0x2UL<<TIM_CCMR1_OC1M_Pos)                      /*!< 0x00000020 */
#define TIM_CCMR1_OC1M_2                         (0x4UL<<TIM_CCMR1_OC1M_Pos)                      /*!< 0x00000040 */
#define TIM_CCMR1_OC1M_3                         (0x1000UL<<TIM_CCMR1_OC1M_Pos)                   /*!< 0x00010000 */
#define TIM_CCMR1_OC1CE_Pos                      (7U)
#define TIM_CCMR1_OC1CE_Msk                      (0x1UL<<TIM_CCMR1_OC1CE_Pos)                     /*!< 0x00000080 */
#define TIM_CCMR1_OC1CE                          TIM_CCMR1_OC1CE_Msk                              
#define TIM_CCMR1_CC2S_Pos                       (8U)
#define TIM_CCMR1_CC2S_Msk                       (0x3UL<<TIM_CCMR1_CC2S_Pos)                      /*!< 0x00000300 */
#define TIM_CCMR1_CC2S                           TIM_CCMR1_CC2S_Msk
#define TIM_CCMR1_CC2S_0                         (0x1UL<<TIM_CCMR1_CC2S_Pos)                      /*!< 0x00000100 */
#define TIM_CCMR1_CC2S_1                         (0x2UL<<TIM_CCMR1_CC2S_Pos)                      /*!< 0x00000200 */
#define TIM_CCMR1_OC2FE_Pos                      (10U)
#define TIM_CCMR1_OC2FE_Msk                      (0x1UL<<TIM_CCMR1_OC2FE_Pos)                     /*!< 0x00000400 */
#define TIM_CCMR1_OC2FE                          TIM_CCMR1_OC2FE_Msk                              
#define TIM_CCMR1_OC2PE_Pos                      (11U)
#define TIM_CCMR1_OC2PE_Msk                      (0x1UL<<TIM_CCMR1_OC2PE_Pos)                     /*!< 0x00000800 */
#define TIM_CCMR1_OC2PE                          TIM_CCMR1_OC2PE_Msk                              
#define TIM_CCMR1_OC2M_Pos                       (12U)
#define TIM_CCMR1_OC2M_Msk                       (0x1007UL<<TIM_CCMR1_OC2M_Pos)                   /*!< 0x01007000 */
#define TIM_CCMR1_OC2M                           TIM_CCMR1_OC2M_Msk
#define TIM_CCMR1_OC2M_0                         (0x1UL<<TIM_CCMR1_OC2M_Pos)                      /*!< 0x00001000 */
#define TIM_CCMR1_OC2M_1                         (0x2UL<<TIM_CCMR1_OC2M_Pos)                      /*!< 0x00002000 */
#define TIM_CCMR1_OC2M_2                         (0x4UL<<TIM_CCMR1_OC2M_Pos)                      /*!< 0x00004000 */
#define TIM_CCMR1_OC2M_3                         (0x1000UL<<TIM_CCMR1_OC2M_Pos)                   /*!< 0x01000000 */
#define TIM_CCMR1_OC2CE_Pos                      (15U)
#define TIM_CCMR1_OC2CE_Msk                      (0x1UL<<TIM_CCMR1_OC2CE_Pos)                     /*!< 0x00008000 */
#define TIM_CCMR1_OC2CE                          TIM_CCMR1_OC2CE_Msk                              
#define TIM_CCMR1_CC1S_Pos                       (0U)
#define TIM_CCMR1_CC1S_Msk                       (0x3UL<<TIM_CCMR1_CC1S_Pos)                      /*!< 0x00000003 */
#define TIM_CCMR1_CC1S                           TIM_CCMR1_CC1S_Msk
#define TIM_CCMR1_CC1S_0                         (0x1UL<<TIM_CCMR1_CC1S_Pos)                      /*!< 0x00000001 */
#define TIM_CCMR1_CC1S_1                         (0x2UL<<TIM_CCMR1_CC1S_Pos)                      /*!< 0x00000002 */
#define TIM_CCMR1_IC1PSC_Pos                     (2U)
#define TIM_CCMR1_IC1PSC_Msk                     (0x3UL<<TIM_CCMR1_IC1PSC_Pos)                    /*!< 0x0000000C */
#define TIM_CCMR1_IC1PSC                         TIM_CCMR1_IC1PSC_Msk
#define TIM_CCMR1_IC1PSC_0                       (0x1UL<<TIM_CCMR1_IC1PSC_Pos)                    /*!< 0x00000004 */
#define TIM_CCMR1_IC1PSC_1                       (0x2UL<<TIM_CCMR1_IC1PSC_Pos)                    /*!< 0x00000008 */
#define TIM_CCMR1_IC1F_Pos                       (4U)
#define TIM_CCMR1_IC1F_Msk                       (0xFUL<<TIM_CCMR1_IC1F_Pos)                      /*!< 0x000000F0 */
#define TIM_CCMR1_IC1F                           TIM_CCMR1_IC1F_Msk
#define TIM_CCMR1_IC1F_0                         (0x1UL<<TIM_CCMR1_IC1F_Pos)                      /*!< 0x00000010 */
#define TIM_CCMR1_IC1F_1                         (0x2UL<<TIM_CCMR1_IC1F_Pos)                      /*!< 0x00000020 */
#define TIM_CCMR1_IC1F_2                         (0x4UL<<TIM_CCMR1_IC1F_Pos)                      /*!< 0x00000040 */
#define TIM_CCMR1_IC1F_3                         (0x8UL<<TIM_CCMR1_IC1F_Pos)                      /*!< 0x00000080 */
#define TIM_CCMR1_CC2S_Pos                       (8U)
#define TIM_CCMR1_CC2S_Msk                       (0x3UL<<TIM_CCMR1_CC2S_Pos)                      /*!< 0x00000300 */
#define TIM_CCMR1_CC2S                           TIM_CCMR1_CC2S_Msk
#define TIM_CCMR1_CC2S_0                         (0x1UL<<TIM_CCMR1_CC2S_Pos)                      /*!< 0x00000100 */
#define TIM_CCMR1_CC2S_1                         (0x2UL<<TIM_CCMR1_CC2S_Pos)                      /*!< 0x00000200 */
#define TIM_CCMR1_IC2PSC_Pos                     (10U)
#define TIM_CCMR1_IC2PSC_Msk                     (0x3UL<<TIM_CCMR1_IC2PSC_Pos)                    /*!< 0x00000C00 */
#define TIM_CCMR1_IC2PSC                         TIM_CCMR1_IC2PSC_Msk
#define TIM_CCMR1_IC2PSC_0                       (0x1UL<<TIM_CCMR1_IC2PSC_Pos)                    /*!< 0x00000400 */
#define TIM_CCMR1_IC2PSC_1                       (0x2UL<<TIM_CCMR1_IC2PSC_Pos)                    /*!< 0x00000800 */
#define TIM_CCMR1_IC2F_Pos                       (12U)
#define TIM_CCMR1_IC2F_Msk                       (0xFUL<<TIM_CCMR1_IC2F_Pos)                      /*!< 0x0000F000 */
#define TIM_CCMR1_IC2F                           TIM_CCMR1_IC2F_Msk
#define TIM_CCMR1_IC2F_0                         (0x1UL<<TIM_CCMR1_IC2F_Pos)                      /*!< 0x00001000 */
#define TIM_CCMR1_IC2F_1                         (0x2UL<<TIM_CCMR1_IC2F_Pos)                      /*!< 0x00002000 */
#define TIM_CCMR1_IC2F_2                         (0x4UL<<TIM_CCMR1_IC2F_Pos)                      /*!< 0x00004000 */
#define TIM_CCMR1_IC2F_3                         (0x8UL<<TIM_CCMR1_IC2F_Pos)                      /*!< 0x00008000 */

