Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xE.h
/********************************* Bit definition for TIM_ARR register *********************************************/
#define TIM_ARR_ARR_Pos                          (0U)
#define TIM_ARR_ARR_Msk                          (0xFFFFFUL<<TIM_ARR_ARR_Pos)                     /*!< 0x000FFFFF */
#define TIM_ARR_ARR                              TIM_ARR_ARR_Msk

/********************************* Bit definition for TIM_RCR register *********************************************/
#define TIM_RCR_REP_Pos                          (0U)
#define TIM_RCR_REP_Msk                          (0xFFFFUL<<TIM_RCR_REP_Pos)                      /*!< 0x0000FFFF */
#define TIM_RCR_REP                              TIM_RCR_REP_Msk

/********************************* Bit definition for TIM_CCR1 register ********************************************/
#define TIM_CCR1_CCR1_Pos                        (0U)
#define TIM_CCR1_CCR1_Msk                        (0xFFFFFUL<<TIM_CCR1_CCR1_Pos)                   /*!< 0x000FFFFF */
#define TIM_CCR1_CCR1                            TIM_CCR1_CCR1_Msk

/********************************* Bit definition for TIM_CCR2 register ********************************************/
#define TIM_CCR2_CCR2_Pos                        (0U)
#define TIM_CCR2_CCR2_Msk                        (0xFFFFFUL<<TIM_CCR2_CCR2_Pos)                   /*!< 0x000FFFFF */
#define TIM_CCR2_CCR2                            TIM_CCR2_CCR2_Msk

/********************************* Bit definition for TIM_CCR3 register ********************************************/
#define TIM_CCR3_CCR3_Pos                        (0U)
#define TIM_CCR3_CCR3_Msk                        (0xFFFFFUL<<TIM_CCR3_CCR3_Pos)                   /*!< 0x000FFFFF */
#define TIM_CCR3_CCR3                            TIM_CCR3_CCR3_Msk

/********************************* Bit definition for TIM_CCR4 register ********************************************/
#define TIM_CCR4_CCR4_Pos                        (0U)
#define TIM_CCR4_CCR4_Msk                        (0xFFFFFUL<<TIM_CCR4_CCR4_Pos)                   /*!< 0x000FFFFF */
#define TIM_CCR4_CCR4                            TIM_CCR4_CCR4_Msk

/********************************* Bit definition for TIM_BDTR register ********************************************/
#define TIM_BDTR_DTG_Pos                         (0U)
#define TIM_BDTR_DTG_Msk                         (0xFFUL<<TIM_BDTR_DTG_Pos)                       /*!< 0x000000FF */
#define TIM_BDTR_DTG                             TIM_BDTR_DTG_Msk
#define TIM_BDTR_LOCK_Pos                        (8U)
#define TIM_BDTR_LOCK_Msk                        (0x3UL<<TIM_BDTR_LOCK_Pos)                       /*!< 0x00000300 */
#define TIM_BDTR_LOCK                            TIM_BDTR_LOCK_Msk
#define TIM_BDTR_LOCK_0                          (0x1UL<<TIM_BDTR_LOCK_Pos)                       /*!< 0x00000100 */
#define TIM_BDTR_LOCK_1                          (0x2UL<<TIM_BDTR_LOCK_Pos)                       /*!< 0x00000200 */
#define TIM_BDTR_OSSI_Pos                        (10U)
#define TIM_BDTR_OSSI_Msk                        (0x1UL<<TIM_BDTR_OSSI_Pos)                       /*!< 0x00000400 */
#define TIM_BDTR_OSSI                            TIM_BDTR_OSSI_Msk                                
#define TIM_BDTR_OSSR_Pos                        (11U)
#define TIM_BDTR_OSSR_Msk                        (0x1UL<<TIM_BDTR_OSSR_Pos)                       /*!< 0x00000800 */
#define TIM_BDTR_OSSR                            TIM_BDTR_OSSR_Msk                                
#define TIM_BDTR_BKE_Pos                         (12U)
#define TIM_BDTR_BKE_Msk                         (0x1UL<<TIM_BDTR_BKE_Pos)                        /*!< 0x00001000 */
#define TIM_BDTR_BKE                             TIM_BDTR_BKE_Msk                                 
#define TIM_BDTR_BKP_Pos                         (13U)
#define TIM_BDTR_BKP_Msk                         (0x1UL<<TIM_BDTR_BKP_Pos)                        /*!< 0x00002000 */
#define TIM_BDTR_BKP                             TIM_BDTR_BKP_Msk                                 
#define TIM_BDTR_AOE_Pos                         (14U)
#define TIM_BDTR_AOE_Msk                         (0x1UL<<TIM_BDTR_AOE_Pos)                        /*!< 0x00004000 */
#define TIM_BDTR_AOE                             TIM_BDTR_AOE_Msk                                 
#define TIM_BDTR_MOE_Pos                         (15U)
#define TIM_BDTR_MOE_Msk                         (0x1UL<<TIM_BDTR_MOE_Pos)                        /*!< 0x00008000 */
#define TIM_BDTR_MOE                             TIM_BDTR_MOE_Msk                                 
#define TIM_BDTR_BKF_Pos                         (16U)
#define TIM_BDTR_BKF_Msk                         (0xFUL<<TIM_BDTR_BKF_Pos)                        /*!< 0x000F0000 */
#define TIM_BDTR_BKF                             TIM_BDTR_BKF_Msk
#define TIM_BDTR_BKF_0                           (0x1UL<<TIM_BDTR_BKF_Pos)                        /*!< 0x00010000 */
#define TIM_BDTR_BKF_1                           (0x2UL<<TIM_BDTR_BKF_Pos)                        /*!< 0x00020000 */
#define TIM_BDTR_BKF_2                           (0x4UL<<TIM_BDTR_BKF_Pos)                        /*!< 0x00040000 */
#define TIM_BDTR_BKF_3                           (0x8UL<<TIM_BDTR_BKF_Pos)                        /*!< 0x00080000 */
#define TIM_BDTR_BK2F_Pos                        (20U)
#define TIM_BDTR_BK2F_Msk                        (0xFUL<<TIM_BDTR_BK2F_Pos)                       /*!< 0x00F00000 */
#define TIM_BDTR_BK2F                            TIM_BDTR_BK2F_Msk
#define TIM_BDTR_BK2F_0                          (0x1UL<<TIM_BDTR_BK2F_Pos)                       /*!< 0x00100000 */
#define TIM_BDTR_BK2F_1                          (0x2UL<<TIM_BDTR_BK2F_Pos)                       /*!< 0x00200000 */
#define TIM_BDTR_BK2F_2                          (0x4UL<<TIM_BDTR_BK2F_Pos)                       /*!< 0x00400000 */
#define TIM_BDTR_BK2F_3                          (0x8UL<<TIM_BDTR_BK2F_Pos)                       /*!< 0x00800000 */
#define TIM_BDTR_BK2E_Pos                        (24U)
#define TIM_BDTR_BK2E_Msk                        (0x1UL<<TIM_BDTR_BK2E_Pos)                       /*!< 0x01000000 */
#define TIM_BDTR_BK2E                            TIM_BDTR_BK2E_Msk                                
#define TIM_BDTR_BK2P_Pos                        (25U)
#define TIM_BDTR_BK2P_Msk                        (0x1UL<<TIM_BDTR_BK2P_Pos)                       /*!< 0x02000000 */
#define TIM_BDTR_BK2P                            TIM_BDTR_BK2P_Msk                                
#define TIM_BDTR_BKDSRM_Pos                      (26U)
#define TIM_BDTR_BKDSRM_Msk                      (0x1UL<<TIM_BDTR_BKDSRM_Pos)                     /*!< 0x04000000 */
#define TIM_BDTR_BKDSRM                          TIM_BDTR_BKDSRM_Msk                              
#define TIM_BDTR_BK2DSRM_Pos                     (27U)
#define TIM_BDTR_BK2DSRM_Msk                     (0x1UL<<TIM_BDTR_BK2DSRM_Pos)                    /*!< 0x08000000 */
#define TIM_BDTR_BK2DSRM                         TIM_BDTR_BK2DSRM_Msk                             
#define TIM_BDTR_BKBID_Pos                       (28U)
#define TIM_BDTR_BKBID_Msk                       (0x1UL<<TIM_BDTR_BKBID_Pos)                      /*!< 0x10000000 */
#define TIM_BDTR_BKBID                           TIM_BDTR_BKBID_Msk                               
#define TIM_BDTR_BK2BID_Pos                      (29U)
#define TIM_BDTR_BK2BID_Msk                      (0x1UL<<TIM_BDTR_BK2BID_Pos)                     /*!< 0x20000000 */
#define TIM_BDTR_BK2BID                          TIM_BDTR_BK2BID_Msk                              

/********************************* Bit definition for TIM_CCR5 register ********************************************/
#define TIM_CCR5_CCR5_Pos                        (0U)
#define TIM_CCR5_CCR5_Msk                        (0xFFFFFUL<<TIM_CCR5_CCR5_Pos)                   /*!< 0x000FFFFF */
#define TIM_CCR5_CCR5                            TIM_CCR5_CCR5_Msk
#define TIM_CCR5_GC5C1_Pos                       (29U)
#define TIM_CCR5_GC5C1_Msk                       (0x1UL<<TIM_CCR5_GC5C1_Pos)                      /*!< 0x20000000 */
#define TIM_CCR5_GC5C1                           TIM_CCR5_GC5C1_Msk                               
#define TIM_CCR5_GC5C2_Pos                       (30U)
#define TIM_CCR5_GC5C2_Msk                       (0x1UL<<TIM_CCR5_GC5C2_Pos)                      /*!< 0x40000000 */
#define TIM_CCR5_GC5C2                           TIM_CCR5_GC5C2_Msk                               
#define TIM_CCR5_GC5C3_Pos                       (31U)
#define TIM_CCR5_GC5C3_Msk                       (0x1UL<<TIM_CCR5_GC5C3_Pos)                      /*!< 0x80000000 */
#define TIM_CCR5_GC5C3                           TIM_CCR5_GC5C3_Msk                               

