Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/CMSIS/Device/PUYA/PY32E407/Include/py32e407xE.h
/*******************  Bit definition for TIM_OR1 register  *********************/
#define TIM_OR1_HSE32EN_Pos                       (0U)
#define TIM_OR1_HSE32EN_Msk                       (0x1UL << TIM_OR1_HSE32EN_Pos)                    /*!< 0x00000001 */
#define TIM_OR1_HSE32EN                           TIM_OR1_HSE32EN_Msk                               /*!< HSE/32 clock enable */

/********************************* Bit definition for TIM_DCR register **********************************************/
#define TIM_DCR_DBA_Pos                           (0U)
#define TIM_DCR_DBA_Msk                           (0x1FUL<<TIM_DCR_DBA_Pos)                         /*!< 0x0000001F */
#define TIM_DCR_DBA                               TIM_DCR_DBA_Msk
#define TIM_DCR_DBA_0                             (0x1UL<<TIM_DCR_DBA_Pos)                          /*!< 0x00000001 */
#define TIM_DCR_DBA_1                             (0x2UL<<TIM_DCR_DBA_Pos)                          /*!< 0x00000002 */
#define TIM_DCR_DBA_2                             (0x4UL<<TIM_DCR_DBA_Pos)                          /*!< 0x00000004 */
#define TIM_DCR_DBA_3                             (0x8UL<<TIM_DCR_DBA_Pos)                          /*!< 0x00000008 */
#define TIM_DCR_DBA_4                             (0x10UL<<TIM_DCR_DBA_Pos)                         /*!< 0x00000010 */
#define TIM_DCR_DBL_Pos                           (8U)
#define TIM_DCR_DBL_Msk                           (0x1FUL<<TIM_DCR_DBL_Pos)                         /*!< 0x00001F00 */
#define TIM_DCR_DBL                               TIM_DCR_DBL_Msk
#define TIM_DCR_DBL_0                             (0x1UL<<TIM_DCR_DBL_Pos)                          /*!< 0x00000100 */
#define TIM_DCR_DBL_1                             (0x2UL<<TIM_DCR_DBL_Pos)                          /*!< 0x00000200 */
#define TIM_DCR_DBL_2                             (0x4UL<<TIM_DCR_DBL_Pos)                          /*!< 0x00000400 */
#define TIM_DCR_DBL_3                             (0x8UL<<TIM_DCR_DBL_Pos)                          /*!< 0x00000800 */
#define TIM_DCR_DBL_4                             (0x10UL<<TIM_DCR_DBL_Pos)                         /*!< 0x00001000 */

/********************************* Bit definition for TIM_DMAR register ********************************************/
#define TIM_DMAR_DMAB_Pos                        (0U)
#define TIM_DMAR_DMAB_Msk                        (0xFFFFFFFFUL<<TIM_DMAR_DMAB_Pos)                  /*!< 0xFFFFFFFF */
#define TIM_DMAR_DMAB                            TIM_DMAR_DMAB_Msk

/********************************* Bit definition for TIM_OR register **********************************************/
#define TIM_OR_TI1_RMP_Pos                        (0U)
#define TIM_OR_TI1_RMP_Msk                        (0x3UL << TIM_OR_TI1_RMP_Pos)                     /*!< 0x00000003 */
#define TIM_OR_TI1_RMP                            TIM_OR_TI1_RMP_Msk                                /*!< OR[1:0] bits (desc OR) */
#define TIM_OR_TI1_RMP_0                          (0x1UL << TIM_OR_TI1_RMP_Pos)                     /*!< 0x00000001 */
#define TIM_OR_TI1_RMP_1                          (0x2UL << TIM_OR_TI1_RMP_Pos)                     /*!< 0x00000002 */
/********************************************************************************************************************/
/********************************* USART ****************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for USART_SR register *********************************************/
#define USART_SR_PE_Pos                           (0U)
#define USART_SR_PE_Msk                           (0x1UL<<USART_SR_PE_Pos)                          /*!< 0x00000001 */
#define USART_SR_PE                               USART_SR_PE_Msk                                   /*!< Parity error */
#define USART_SR_FE_Pos                           (1U)
#define USART_SR_FE_Msk                           (0x1UL<<USART_SR_FE_Pos)                          /*!< 0x00000002 */
#define USART_SR_FE                               USART_SR_FE_Msk                                   /*!< Framing error */
#define USART_SR_NE_Pos                           (2U)
#define USART_SR_NE_Msk                           (0x1UL<<USART_SR_NE_Pos)                          /*!< 0x00000004 */
#define USART_SR_NE                               USART_SR_NE_Msk                                   /*!< Noise error flag */
#define USART_SR_ORE_Pos                          (3U)
#define USART_SR_ORE_Msk                          (0x1UL<<USART_SR_ORE_Pos)                         /*!< 0x00000008 */
#define USART_SR_ORE                              USART_SR_ORE_Msk                                  /*!< overrun error */
#define USART_SR_IDLE_Pos                         (4U)
#define USART_SR_IDLE_Msk                         (0x1UL<<USART_SR_IDLE_Pos)                        /*!< 0x00000010 */
#define USART_SR_IDLE                             USART_SR_IDLE_Msk                                 /*!< idle */
#define USART_SR_RXNE_Pos                         (5U)
#define USART_SR_RXNE_Msk                         (0x1UL<<USART_SR_RXNE_Pos)                        /*!< 0x00000020 */
#define USART_SR_RXNE                             USART_SR_RXNE_Msk                                 /*!< Read data register not empty */
#define USART_SR_TC_Pos                           (6U)
#define USART_SR_TC_Msk                           (0x1UL<<USART_SR_TC_Pos)                          /*!< 0x00000040 */
#define USART_SR_TC                               USART_SR_TC_Msk                                   /*!< Transmission complete */
#define USART_SR_TXE_Pos                          (7U)
#define USART_SR_TXE_Msk                          (0x1UL<<USART_SR_TXE_Pos)                         /*!< 0x00000080 */
#define USART_SR_TXE                              USART_SR_TXE_Msk                                  /*!< Transmit data register empty */
#define USART_SR_LBD_Pos                          (8U)
#define USART_SR_LBD_Msk                          (0x1UL<<USART_SR_LBD_Pos)                         /*!< 0x00000100 */
#define USART_SR_LBD                              USART_SR_LBD_Msk                                  /*!< LIN break detection flag */
#define USART_SR_CTS_Pos                          (9U)
#define USART_SR_CTS_Msk                          (0x1UL<<USART_SR_CTS_Pos)                         /*!< 0x00000200 */
#define USART_SR_CTS                              USART_SR_CTS_Msk                                  /*!< cts flag */
#define USART_SR_ABRF_Pos                         (10U)
#define USART_SR_ABRF_Msk                         (0x1UL<<USART_SR_ABRF_Pos)                        /*!< 0x00000400 */
#define USART_SR_ABRF                             USART_SR_ABRF_Msk                                 /*!< auto baud rate flag */
#define USART_SR_ABRE_Pos                         (11U)
#define USART_SR_ABRE_Msk                         (0x1UL<<USART_SR_ABRE_Pos)                        /*!< 0x00000800 */
#define USART_SR_ABRE                             USART_SR_ABRE_Msk                                 /*!< auto baud rateerror */
#define USART_SR_ABRRQ_Pos                        (12U)
#define USART_SR_ABRRQ_Msk                        (0x1UL<<USART_SR_ABRRQ_Pos)                       /*!< 0x00001000 */
#define USART_SR_ABRRQ                            USART_SR_ABRRQ_Msk                                /*!< auto baud rate req */
#define USART_SR_TXFT_Pos                         (13U)
#define USART_SR_TXFT_Msk                         (0x1UL<<USART_SR_TXFT_Pos)                        /*!< 0x00002000 */
#define USART_SR_TXFT                             USART_SR_TXFT_Msk                                 /*!< txfifo threshold flag  */
#define USART_SR_RXFT_Pos                         (14U)
#define USART_SR_RXFT_Msk                         (0x1UL<<USART_SR_RXFT_Pos)                        /*!< 0x00004000 */
#define USART_SR_RXFT                             USART_SR_RXFT_Msk                                 /*!< rxfifo threshoold flag  */
#define USART_SR_RXFF_Pos                         (15U)
#define USART_SR_RXFF_Msk                         (0x1UL<<USART_SR_RXFF_Pos)                        /*!< 0x00008000 */
#define USART_SR_RXFF                             USART_SR_RXFF_Msk                                 /*!< rxfifo full */
#define USART_SR_TXFE_Pos                         (16U)
#define USART_SR_TXFE_Msk                         (0x1UL<<USART_SR_TXFE_Pos)                        /*!< 0x00010000 */
#define USART_SR_TXFE                             USART_SR_TXFE_Msk                                 /*!< txfifo empty */
#define USART_SR_EOBF_Pos                         (18U)
#define USART_SR_EOBF_Msk                         (0x1UL<<USART_SR_EOBF_Pos)                        /*!< 0x00040000 */
#define USART_SR_EOBF                             USART_SR_EOBF_Msk                                 /*!< end of block flag */
#define USART_SR_RTOF_Pos                         (19U)
#define USART_SR_RTOF_Msk                         (0x1UL<<USART_SR_RTOF_Pos)                        /*!< 0x00080000 */
#define USART_SR_RTOF                             USART_SR_RTOF_Msk                                 /*!< rto flag */

/********************************* Bit definition for USART_DR register *********************************************/
#define USART_DR_DR_Pos                           (0U)
#define USART_DR_DR_Msk                           (0x1FFUL<<USART_DR_DR_Pos)                        /*!< 0x000001FF */
#define USART_DR_DR                               USART_DR_DR_Msk                                   /*!< dr */

/********************************* Bit definition for USART_BRR register ********************************************/
#define USART_BRR_DIV_F_Pos                       (0U)
#define USART_BRR_DIV_F_Msk                       (0xFUL<<USART_BRR_DIV_F_Pos)                      /*!< 0x0000000F */
#define USART_BRR_DIV_F                           USART_BRR_DIV_F_Msk                               /*!< DIV_Fraction */
#define USART_BRR_DIV_F_0                         (0x1UL<<USART_BRR_DIV_F_Pos)                      /*!< 0x00000001 */
#define USART_BRR_DIV_F_1                         (0x2UL<<USART_BRR_DIV_F_Pos)                      /*!< 0x00000002 */
#define USART_BRR_DIV_F_2                         (0x4UL<<USART_BRR_DIV_F_Pos)                      /*!< 0x00000004 */
#define USART_BRR_DIV_F_3                         (0x8UL<<USART_BRR_DIV_F_Pos)                      /*!< 0x00000008 */
#define USART_BRR_DIV_M_Pos                       (4U)
#define USART_BRR_DIV_M_Msk                       (0xFFFUL<<USART_BRR_DIV_M_Pos)                    /*!< 0x0000FFF0 */
#define USART_BRR_DIV_M                           USART_BRR_DIV_M_Msk                               /*!< DIV_Mantissa */

/********************************* Bit definition for USART_CR1 register ********************************************/
#define USART_CR1_SBK_Pos                         (0U)
#define USART_CR1_SBK_Msk                         (0x1UL<<USART_CR1_SBK_Pos)                        /*!< 0x00000001 */
#define USART_CR1_SBK                             USART_CR1_SBK_Msk                                 /*!< Send break */
#define USART_CR1_RWU_Pos                         (1U)
#define USART_CR1_RWU_Msk                         (0x1UL<<USART_CR1_RWU_Pos)                        /*!< 0x00000002 */
#define USART_CR1_RWU                             USART_CR1_RWU_Msk                                 /*!< Receiver wakeup */
#define USART_CR1_RE_Pos                          (2U)
#define USART_CR1_RE_Msk                          (0x1UL<<USART_CR1_RE_Pos)                         /*!< 0x00000004 */
#define USART_CR1_RE                              USART_CR1_RE_Msk                                  /*!< Receiver enable */
#define USART_CR1_TE_Pos                          (3U)
#define USART_CR1_TE_Msk                          (0x1UL<<USART_CR1_TE_Pos)                         /*!< 0x00000008 */
#define USART_CR1_TE                              USART_CR1_TE_Msk                                  /*!< Transmitter enable */
#define USART_CR1_IDLEIE_Pos                      (4U)
#define USART_CR1_IDLEIE_Msk                      (0x1UL<<USART_CR1_IDLEIE_Pos)                     /*!< 0x00000010 */
#define USART_CR1_IDLEIE                          USART_CR1_IDLEIE_Msk                              /*!< IDLE interrupt enable */
#define USART_CR1_RXNEIE_Pos                      (5U)
#define USART_CR1_RXNEIE_Msk                      (0x1UL<<USART_CR1_RXNEIE_Pos)                     /*!< 0x00000020 */
#define USART_CR1_RXNEIE                          USART_CR1_RXNEIE_Msk                              /*!< RXNE interrupt enable */
#define USART_CR1_TCIE_Pos                        (6U)
#define USART_CR1_TCIE_Msk                        (0x1UL<<USART_CR1_TCIE_Pos)                       /*!< 0x00000040 */
#define USART_CR1_TCIE                            USART_CR1_TCIE_Msk                                /*!< send complete int enable */
#define USART_CR1_TXEIE_Pos                       (7U)
#define USART_CR1_TXEIE_Msk                       (0x1UL<<USART_CR1_TXEIE_Pos)                      /*!< 0x00000080 */
#define USART_CR1_TXEIE                           USART_CR1_TXEIE_Msk                               /*!< txe  */
#define USART_CR1_PEIE_Pos                        (8U)
#define USART_CR1_PEIE_Msk                        (0x1UL<<USART_CR1_PEIE_Pos)                       /*!< 0x00000100 */
#define USART_CR1_PEIE                            USART_CR1_PEIE_Msk                                /*!< PE interrupt enable */
#define USART_CR1_PS_Pos                          (9U)
#define USART_CR1_PS_Msk                          (0x1UL<<USART_CR1_PS_Pos)                         /*!< 0x00000200 */
#define USART_CR1_PS                              USART_CR1_PS_Msk                                  /*!< Parity selection */
#define USART_CR1_PCE_Pos                         (10U)
#define USART_CR1_PCE_Msk                         (0x1UL<<USART_CR1_PCE_Pos)                        /*!< 0x00000400 */
#define USART_CR1_PCE                             USART_CR1_PCE_Msk                                 /*!< Parity control enable */
#define USART_CR1_WAKE_Pos                        (11U)
#define USART_CR1_WAKE_Msk                        (0x1UL<<USART_CR1_WAKE_Pos)                       /*!< 0x00000800 */
#define USART_CR1_WAKE                            USART_CR1_WAKE_Msk                                /*!< Wakeup method */
#define USART_CR1_M0_Pos                          (12U)
#define USART_CR1_M0_Msk                          (0x1UL<<USART_CR1_M0_Pos)                         /*!< 0x00001000 */
#define USART_CR1_M0                              USART_CR1_M0_Msk                                  /*!< word length */
#define USART_CR1_UE_Pos                          (13U)
#define USART_CR1_UE_Msk                          (0x1UL<<USART_CR1_UE_Pos)                         /*!< 0x00002000 */
#define USART_CR1_UE                              USART_CR1_UE_Msk                                  /*!< uesart enable  */
#define USART_CR1_M1_Pos                          (14U)
#define USART_CR1_M1_Msk                          (0x1UL<<USART_CR1_M1_Pos)                         /*!< 0x00004000 */
#define USART_CR1_M1                              USART_CR1_M1_Msk                                  /*!< word length */
#define USART_CR1_MSB_Pos                         (15U)
#define USART_CR1_MSB_Msk                         (0x1UL<<USART_CR1_MSB_Pos)                        /*!< 0x00008000 */
#define USART_CR1_MSB                             USART_CR1_MSB_Msk                                 /*!< msb */
#define USART_CR1_ADDM7_Pos                       (17U)
#define USART_CR1_ADDM7_Msk                       (0x1UL<<USART_CR1_ADDM7_Pos)                      /*!< 0x00020000 */
#define USART_CR1_ADDM7                           USART_CR1_ADDM7_Msk                               /*!< addm7 */
#define USART_CR1_SWAP_Pos                        (18U)
#define USART_CR1_SWAP_Msk                        (0x1UL<<USART_CR1_SWAP_Pos)                       /*!< 0x00040000 */
#define USART_CR1_SWAP                            USART_CR1_SWAP_Msk                                /*!< swap */
#define USART_CR1_TXFTCFG_Pos                     (19U)
#define USART_CR1_TXFTCFG_Msk                     (0x7UL<<USART_CR1_TXFTCFG_Pos)                    /*!< 0x00380000 */
#define USART_CR1_TXFTCFG                         USART_CR1_TXFTCFG_Msk                             /*!< txfifo threshoold cfg  */
#define USART_CR1_TXFTCFG_0                       (0x1UL<<USART_CR1_TXFTCFG_Pos)                    /*!< 0x00080000 */
#define USART_CR1_TXFTCFG_1                       (0x2UL<<USART_CR1_TXFTCFG_Pos)                    /*!< 0x00100000 */
#define USART_CR1_TXFTCFG_2                       (0x4UL<<USART_CR1_TXFTCFG_Pos)                    /*!< 0x00200000 */
#define USART_CR1_RXFTCFG_Pos                     (22U)
#define USART_CR1_RXFTCFG_Msk                     (0x7UL<<USART_CR1_RXFTCFG_Pos)                    /*!< 0x01C00000 */
#define USART_CR1_RXFTCFG                         USART_CR1_RXFTCFG_Msk                             /*!< rxfifo threshoold cfg  */
#define USART_CR1_RXFTCFG_0                       (0x1UL<<USART_CR1_RXFTCFG_Pos)                    /*!< 0x00400000 */
#define USART_CR1_RXFTCFG_1                       (0x2UL<<USART_CR1_RXFTCFG_Pos)                    /*!< 0x00800000 */
#define USART_CR1_RXFTCFG_2                       (0x4UL<<USART_CR1_RXFTCFG_Pos)                    /*!< 0x01000000 */
#define USART_CR1_RX_INV_Pos                      (25U)
#define USART_CR1_RX_INV_Msk                      (0x1UL<<USART_CR1_RX_INV_Pos)                     /*!< 0x02000000 */
#define USART_CR1_RX_INV                          USART_CR1_RX_INV_Msk                              /*!< rxinv */
#define USART_CR1_TX_INV_Pos                      (26U)
#define USART_CR1_TX_INV_Msk                      (0x1UL<<USART_CR1_TX_INV_Pos)                     /*!< 0x04000000 */
#define USART_CR1_TX_INV                          USART_CR1_TX_INV_Msk                              /*!< txinv */
#define USART_CR1_DATAINV_Pos                     (27U)
#define USART_CR1_DATAINV_Msk                     (0x1UL<<USART_CR1_DATAINV_Pos)                    /*!< 0x08000000 */
#define USART_CR1_DATAINV                         USART_CR1_DATAINV_Msk                             /*!< datainv  */
#define USART_CR1_RXFRQ_Pos                       (29U)
#define USART_CR1_RXFRQ_Msk                       (0x1UL<<USART_CR1_RXFRQ_Pos)                      /*!< 0x20000000 */
#define USART_CR1_RXFRQ                           USART_CR1_RXFRQ_Msk                               /*!< receive data flush request */
#define USART_CR1_TXFRQ_Pos                       (30U)
#define USART_CR1_TXFRQ_Msk                       (0x1UL<<USART_CR1_TXFRQ_Pos)                      /*!< 0x40000000 */
#define USART_CR1_TXFRQ                           USART_CR1_TXFRQ_Msk                               /*!< Transmit data flush request */
#define USART_CR1_FIFOEN_Pos                      (31U)
#define USART_CR1_FIFOEN_Msk                      (0x1UL<<USART_CR1_FIFOEN_Pos)                     /*!< 0x80000000 */
#define USART_CR1_FIFOEN                          USART_CR1_FIFOEN_Msk                              /*!< fifo en */

/********************************* Bit definition for USART_CR2 register ********************************************/
#define USART_CR2_LBDL_Pos                        (5U)
#define USART_CR2_LBDL_Msk                        (0x1UL<<USART_CR2_LBDL_Pos)                       /*!< 0x00000020 */
#define USART_CR2_LBDL                            USART_CR2_LBDL_Msk                                /*!< LIN break detection length */
#define USART_CR2_LBDIE_Pos                       (6U)
#define USART_CR2_LBDIE_Msk                       (0x1UL<<USART_CR2_LBDIE_Pos)                      /*!< 0x00000040 */
#define USART_CR2_LBDIE                           USART_CR2_LBDIE_Msk                               /*!< lin break enable */
#define USART_CR2_LBCL_Pos                        (8U)
#define USART_CR2_LBCL_Msk                        (0x1UL<<USART_CR2_LBCL_Pos)                       /*!< 0x00000100 */
#define USART_CR2_LBCL                            USART_CR2_LBCL_Msk                                /*!< lbcl  */
#define USART_CR2_CPHA_Pos                        (9U)
#define USART_CR2_CPHA_Msk                        (0x1UL<<USART_CR2_CPHA_Pos)                       /*!< 0x00000200 */
#define USART_CR2_CPHA                            USART_CR2_CPHA_Msk                                /*!< cpha */
#define USART_CR2_CPOL_Pos                        (10U)
#define USART_CR2_CPOL_Msk                        (0x1UL<<USART_CR2_CPOL_Pos)                       /*!< 0x00000400 */
#define USART_CR2_CPOL                            USART_CR2_CPOL_Msk                                /*!< cpol */
#define USART_CR2_CLKEN_Pos                       (11U)
#define USART_CR2_CLKEN_Msk                       (0x1UL<<USART_CR2_CLKEN_Pos)                      /*!< 0x00000800 */
#define USART_CR2_CLKEN                           USART_CR2_CLKEN_Msk                               /*!< clk en */
#define USART_CR2_STOP_Pos                        (12U)
#define USART_CR2_STOP_Msk                        (0x3UL<<USART_CR2_STOP_Pos)                       /*!< 0x00003000 */
#define USART_CR2_STOP                            USART_CR2_STOP_Msk                                /*!< stop bit */
#define USART_CR2_STOP_0                          (0x1UL<<USART_CR2_STOP_Pos)                       /*!< 0x00001000 */
#define USART_CR2_STOP_1                          (0x2UL<<USART_CR2_STOP_Pos)                       /*!< 0x00002000 */
#define USART_CR2_LINEN_Pos                       (14U)
#define USART_CR2_LINEN_Msk                       (0x1UL<<USART_CR2_LINEN_Pos)                      /*!< 0x00004000 */
#define USART_CR2_LINEN                           USART_CR2_LINEN_Msk                               /*!< lin enable */
#define USART_CR2_ADD_Pos                         (15U)
#define USART_CR2_ADD_Msk                         (0xFFUL<<USART_CR2_ADD_Pos)                       /*!< 0x007F8000 */
#define USART_CR2_ADD                             USART_CR2_ADD_Msk                                 /*!< address */
#define USART_CR2_DEM_Pos                         (23U)
#define USART_CR2_DEM_Msk                         (0x1UL<<USART_CR2_DEM_Pos)                        /*!< 0x00800000 */
#define USART_CR2_DEM                             USART_CR2_DEM_Msk                                 /*!< dem */
#define USART_CR2_DEP_Pos                         (24U)
#define USART_CR2_DEP_Msk                         (0x1UL<<USART_CR2_DEP_Pos)                        /*!< 0x01000000 */
#define USART_CR2_DEP                             USART_CR2_DEP_Msk                                 /*!< dep */
#define USART_CR2_RTOEN_Pos                       (25U)
#define USART_CR2_RTOEN_Msk                       (0x1UL<<USART_CR2_RTOEN_Pos)                      /*!< 0x02000000 */
#define USART_CR2_RTOEN                           USART_CR2_RTOEN_Msk                               /*!< Receiver timeout enable */

